FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
/***********************************************************************/
/*                                                                     */
/*      PROJECT NAME :  RTOSDemo                                       */
/*      FILE         :  iodefine.h                                     */
/*      DESCRIPTION  :  Definition of I/O Registers                    */
/*      CPU SERIES   :  RX600                                          */
/*      CPU TYPE     :  RX64M                                          */
/*                                                                     */
/*      This file is generated by e2 studio.                        */
/*                                                                     */
/***********************************************************************/



/********************************************************************************
 *
 * Device     : RX/RX600/RX64M
 *
 * File Name  : iodefine.h
 *
 * Abstract   : Definition of I/O Register
 *
 * History    : 0.20 (2013-10-03)  [Hardware Manual Revision : 0.40]
 *
 * Note       : This is a typical example.
 *
 * Copyright (C) 2013 Renesas Electronics Corporation and
 * Renesas Solutions Corp. All rights reserved.
 *
 *********************************************************************************/
/*                                                                              */
/*  CPU TYPE    : RX64M                                                         */
/*  DESCRIPTION : Definition of ICU Register                                    */
/*                                                                              */
/*  Usage : IR,DTCER,IER,IPR of ICU Register                                    */
/*     The following IR, DTCE, IEN, IPR macro functions simplify usage.         */
/*     The bit access operation is "Bit_Name(interrupt source,name)".           */
/*     A part of the name can be omitted.                                       */
/*       IR(BSC,BUSERR) = 0;     expands to :                                   */
/*     for example :                                                            */
/*         ICU.IR[16].BIT.IR = 0;                                               */
/*                                                                              */
/*       DTCE(ICU,IRQ0) = 1;     expands to :                                   */
/*         ICU.DTCER[64].BIT.DTCE = 1;                                          */
/*                                                                              */
/*       IEN(CMT0,CMI0) = 1;     expands to :                                   */
/*         ICU.IER[0x03].BIT.IEN4 = 1;                                          */
/*                                                                              */
/*  Usage : #pragma interrupt Function_Identifier(vect=**)                      */
/*     The number of vector is "(interrupt source, name)".                      */
/*       #pragma interrupt INT_IRQ0(vect=VECT(ICU,IRQ0))          expands to :  */
/*     for example :                                                            */
/*       #pragma interrupt INT_CMT0_CMI0(vect=VECT(CMT0,CMI0))    expands to :  */
/*                                                                              */
/*  Usage : MSTPCRA,MSTPCRB,MSTPCRC of SYSTEM Register                          */
/*     The bit access operation is "MSTP(name)".                                */
/*     The name that can be used is a macro name defined with "iodefine.h".     */
/*       MSTP(TMR2) = 0;    // TMR2,TMR3                          expands to :  */
/*     for example :                                                            */
/*         SYSTEM.MSTPCRA.BIT.MSTPA4  = 0;                                      */
/*       MSTP(SCI0) = 0;    // SCI0,SMCI0                         expands to :  */
/*         SYSTEM.MSTPCRB.BIT.MSTPB31 = 0;                                      */
/*       MSTP(TPU4) = 0;    // TPU0,TPU1,TPU2,TPU3,TPU4,TPU5      expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA13 = 0;                                      */
/*       MSTP(CMT3) = 0;    // CMT2,CMT3                          expands to :  */
/*         SYSTEM.MSTPCRA.BIT.MSTPA14 = 0;                                      */
/*                                                                              */
/*                                                                              */
/********************************************************************************/


#ifndef __RX64MIODEFINE_HEADER__
#define __RX64MIODEFINE_HEADER__

#ifdef __RX_LITTLE_ENDIAN__

    struct st_bsc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char STSCLR : 1;
                unsigned char : 7;
            }
            BIT;
        }
        BERCLR;
        char wk0[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IGAEN : 1;
                unsigned char TOEN : 1;
                unsigned char : 6;
            }
            BIT;
        }
        BEREN;
        char wk1[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IA : 1;
                unsigned char TO : 1;
                unsigned char : 2;
                unsigned char MST : 3;
                unsigned char : 1;
            }
            BIT;
        }
        BERSR1;
        char wk2[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 3;
                unsigned short ADDR : 13;
            }
            BIT;
        }
        BERSR2;
        char wk3[ 4 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BPRA : 2;
                unsigned short BPRO : 2;
                unsigned short BPIB : 2;
                unsigned short BPGB : 2;
                unsigned short BPHB : 2;
                unsigned short BPFB : 2;
                unsigned short BPEB : 2;
                unsigned short : 2;
            }
            BIT;
        }
        BUSPRI;
        char wk4[ 7408 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS0MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS0WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS0WCR2;
        char wk5[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS1MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS1WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS1WCR2;
        char wk6[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS2MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS2WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS2WCR2;
        char wk7[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS3MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS3WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS3WCR2;
        char wk8[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS4MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS4WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS4WCR2;
        char wk9[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS5MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS5WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS5WCR2;
        char wk10[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS6MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS6WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS6WCR2;
        char wk11[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short WRMOD : 1;
                unsigned short : 2;
                unsigned short EWENB : 1;
                unsigned short : 4;
                unsigned short PRENB : 1;
                unsigned short PWENB : 1;
                unsigned short : 5;
                unsigned short PRMOD : 1;
            }
            BIT;
        }
        CS7MOD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSPWWAIT : 3;
                unsigned long : 5;
                unsigned long CSPRWAIT : 3;
                unsigned long : 5;
                unsigned long CSWWAIT : 5;
                unsigned long : 3;
                unsigned long CSRWAIT : 5;
                unsigned long : 3;
            }
            BIT;
        }
        CS7WCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CSROFF : 3;
                unsigned long : 1;
                unsigned long CSWOFF : 3;
                unsigned long : 1;
                unsigned long WDOFF : 3;
                unsigned long : 1;
                unsigned long AWAIT : 2;
                unsigned long : 2;
                unsigned long RDON : 3;
                unsigned long : 1;
                unsigned long WRON : 3;
                unsigned long : 1;
                unsigned long WDON : 3;
                unsigned long : 1;
                unsigned long CSON : 3;
                unsigned long : 1;
            }
            BIT;
        }
        CS7WCR2;
        char wk12[ 1926 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short EXENB : 1;
                unsigned short : 3;
                unsigned short BSIZE : 2;
                unsigned short : 2;
                unsigned short EMODE : 1;
                unsigned short : 3;
                unsigned short MPXEN : 1;
                unsigned short : 3;
            }
            BIT;
        }
        CS0CR;
        char wk13[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RRCV : 4;
                unsigned short : 4;
                unsigned short WRCV : 4;
                unsigned short : 4;
            }
            BIT;
        }
        CS0REC;
        char wk14[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short EXENB : 1;
                unsigned short : 3;
                unsigned short BSIZE : 2;
                unsigned short : 2;
                unsigned short EMODE : 1;
                unsigned short : 3;
                unsigned short MPXEN : 1;
                unsigned short : 3;
            }
            BIT;
        }
        CS1CR;
        char wk15[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RRCV : 4;
                unsigned short : 4;
                unsigned short WRCV : 4;
                unsigned short : 4;
            }
            BIT;
        }
        CS1REC;
        char wk16[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short EXENB : 1;
                unsigned short : 3;
                unsigned short BSIZE : 2;
                unsigned short : 2;
                unsigned short EMODE : 1;
                unsigned short : 3;
                unsigned short MPXEN : 1;
                unsigned short : 3;
            }
            BIT;
        }
        CS2CR;
        char wk17[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RRCV : 4;
                unsigned short : 4;
                unsigned short WRCV : 4;
                unsigned short : 4;
            }
            BIT;
        }
        CS2REC;
        char wk18[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short EXENB : 1;
                unsigned short : 3;
                unsigned short BSIZE : 2;
                unsigned short : 2;
                unsigned short EMODE : 1;
                unsigned short : 3;
                unsigned short MPXEN : 1;
                unsigned short : 3;
            }
            BIT;
        }
        CS3CR;
        char wk19[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RRCV : 4;
                unsigned short : 4;
                unsigned short WRCV : 4;
                unsigned short : 4;
            }
            BIT;
        }
        CS3REC;
        char wk20[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short EXENB : 1;
                unsigned short : 3;
                unsigned short BSIZE : 2;
                unsigned short : 2;
                unsigned short EMODE : 1;
                unsigned short : 3;
                unsigned short MPXEN : 1;
                unsigned short : 3;
            }
            BIT;
        }
        CS4CR;
        char wk21[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RRCV : 4;
                unsigned short : 4;
                unsigned short WRCV : 4;
                unsigned short : 4;
            }
            BIT;
        }
        CS4REC;
        char wk22[ 6 ];
        union
        {
