FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_cmt
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short STR0 : 1;
                unsigned short STR1 : 1;
                unsigned short : 14;
            }
            BIT;
        }
        CMSTR0;
        char wk0[ 14 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short STR2 : 1;
                unsigned short STR3 : 1;
                unsigned short : 14;
            }
            BIT;
        }
        CMSTR1;
    };

    struct st_cmt0
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CKS : 2;
                unsigned short : 4;
                unsigned short CMIE : 1;
                unsigned short : 9;
            }
            BIT;
        }
        CMCR;
        unsigned short CMCNT;
        unsigned short CMCOR;
    };

    struct st_cmtw
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short STR : 1;
                unsigned short : 15;
            }
            BIT;
        }
        CMWSTR;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CKS : 2;
                unsigned short : 1;
                unsigned short CM2IE : 1;
                unsigned short IC0IE : 1;
                unsigned short IC1IE : 1;
                unsigned short OC0IE : 1;
                unsigned short OC1IE : 1;
                unsigned short : 1;
                unsigned short CMS : 1;
                unsigned short : 3;
                unsigned short CLLR : 3;
            }
            BIT;
        }
        CMWCR;
        char wk1[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short IC0 : 2;
                unsigned short IC1 : 2;
                unsigned short IC0E : 1;
                unsigned short IC1E : 1;
                unsigned short : 2;
                unsigned short OC0 : 2;
                unsigned short OC1 : 2;
                unsigned short OC0E : 1;
                unsigned short OC1E : 1;
                unsigned short : 1;
                unsigned short CM2E : 1;
            }
            BIT;
        }
        CMWIOR;
        char wk2[ 6 ];
        unsigned long CMWCNT;
        unsigned long CMWCOR;
        unsigned long CMWICR0;
        unsigned long CMWICR1;
        unsigned long CMWOCR0;
        unsigned long CMWOCR1;
    };

    struct st_crc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char GPS : 2;
                unsigned char LMS : 1;
                unsigned char : 4;
                unsigned char DORCLR : 1;
            }
            BIT;
        }
        CRCCR;
        unsigned char CRCDIR;
        unsigned short CRCDOR;
    };

    struct st_da
    {
        unsigned short DADR0;
        unsigned short DADR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char DAE : 1;
                unsigned char DAOE0 : 1;
                unsigned char DAOE1 : 1;
            }
            BIT;
        }
        DACR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char DPSEL : 1;
            }
            BIT;
        }
        DADPR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char DAADST : 1;
            }
            BIT;
        }
        DAADSCR;
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char DAAMP0 : 1;
                unsigned char DAAMP1 : 1;
            }
            BIT;
        }
        DAAMPCR;
    };

    struct st_dmac
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DMST : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DMAST;
        char wk0[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char DMIS4 : 1;
                unsigned char DMIS5 : 1;
                unsigned char DMIS6 : 1;
                unsigned char DMIS7 : 1;
            }
            BIT;
        }
        DMIST;
    };

    struct st_dmac0
    {
        void * DMSAR;
        void * DMDAR;
        unsigned long DMCRA;
        unsigned short DMCRB;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DCTG : 2;
                unsigned short : 6;
                unsigned short SZ : 2;
                unsigned short : 2;
                unsigned short DTS : 2;
                unsigned short MD : 2;
            }
            BIT;
        }
        DMTMD;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DARIE : 1;
                unsigned char SARIE : 1;
                unsigned char RPTIE : 1;
                unsigned char ESIE : 1;
                unsigned char DTIE : 1;
                unsigned char : 3;
            }
            BIT;
        }
        DMINT;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DARA : 5;
                unsigned short : 1;
                unsigned short DM : 2;
                unsigned short SARA : 5;
                unsigned short : 1;
                unsigned short SM : 2;
            }
            BIT;
        }
        DMAMD;
        char wk2[ 2 ];
        unsigned long DMOFR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DTE : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DMCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SWREQ : 1;
                unsigned char : 3;
                unsigned char CLRS : 1;
                unsigned char : 3;
            }
            BIT;
        }
        DMREQ;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ESIF : 1;
                unsigned char : 3;
                unsigned char DTIF : 1;
                unsigned char : 2;
                unsigned char ACT : 1;
            }
            BIT;
        }
        DMSTS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DISEL : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DMCSL;
    };

