FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_dmac1
    {
        void * DMSAR;
        void * DMDAR;
        unsigned long DMCRA;
        unsigned short DMCRB;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DCTG : 2;
                unsigned short : 6;
                unsigned short SZ : 2;
                unsigned short : 2;
                unsigned short DTS : 2;
                unsigned short MD : 2;
            }
            BIT;
        }
        DMTMD;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DARIE : 1;
                unsigned char SARIE : 1;
                unsigned char RPTIE : 1;
                unsigned char ESIE : 1;
                unsigned char DTIE : 1;
                unsigned char : 3;
            }
            BIT;
        }
        DMINT;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DARA : 5;
                unsigned short : 1;
                unsigned short DM : 2;
                unsigned short SARA : 5;
                unsigned short : 1;
                unsigned short SM : 2;
            }
            BIT;
        }
        DMAMD;
        char wk2[ 6 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DTE : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DMCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SWREQ : 1;
                unsigned char : 3;
                unsigned char CLRS : 1;
                unsigned char : 3;
            }
            BIT;
        }
        DMREQ;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ESIF : 1;
                unsigned char : 3;
                unsigned char DTIF : 1;
                unsigned char : 2;
                unsigned char ACT : 1;
            }
            BIT;
        }
        DMSTS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DISEL : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DMCSL;
    };

    struct st_doc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char OMS : 2;
                unsigned char DCSEL : 1;
                unsigned char : 1;
                unsigned char DOPCIE : 1;
                unsigned char DOPCF : 1;
                unsigned char DOPCFCL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        DOCR;
        char wk0[ 1 ];
        unsigned short DODIR;
        unsigned short DODSR;
    };

    struct st_dtc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RRS : 1;
                unsigned char : 3;
            }
            BIT;
        }
        DTCCR;
        char wk0[ 3 ];

        void * DTCVBR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SHORT : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DTCADMOD;
        char wk1[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DTCST : 1;
                unsigned char : 7;
            }
            BIT;
        }
        DTCST;
        char wk2[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short VECN : 8;
                unsigned short : 7;
                unsigned short ACT : 1;
            }
            BIT;
        }
        DTCSTS;
    };

    struct st_eccram
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RAMMOD : 2;
                unsigned char : 6;
            }
            BIT;
        }
        ECCRAMMODE;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RAMERR : 1;
                unsigned char : 7;
            }
            BIT;
        }
        ECCRAMSTS;
        char wk0[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RAMPRCR : 1;
                unsigned char KW : 7;
            }
            BIT;
        }
        ECCRAMPRCR;
        char wk1[ 3 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 3;
                unsigned long READ : 16;
                unsigned long : 13;
            }
            BIT;
        }
        ECCRAMECAD;
        char wk2[ 4 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RAMPRCR2 : 1;
                unsigned char KW2 : 7;
            }
            BIT;
        }
        ECCRAMPRCR2;
        char wk3[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TSTBYP : 1;
                unsigned char : 7;
            }
            BIT;
        }
        ECCRAMETST;
    };

    struct st_edmac
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long SWR : 1;
                unsigned long : 3;
                unsigned long DL : 2;
                unsigned long DE : 1;
                unsigned long : 25;
            }
            BIT;
        }
        EDMR;
        char wk0[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TR : 1;
                unsigned long : 31;
            }
            BIT;
        }
        EDTRR;
        char wk1[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RR : 1;
                unsigned long : 31;
            }
            BIT;
        }
        EDRRR;
        char wk2[ 4 ];
        void * TDLAR;
        char wk3[ 4 ];
        void * RDLAR;
        char wk4[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CERF : 1;
                unsigned long PRE : 1;
                unsigned long RTSF : 1;
                unsigned long RTLF : 1;
                unsigned long RRF : 1;
                unsigned long : 2;
                unsigned long RMAF : 1;
                unsigned long TRO : 1;
                unsigned long CD : 1;
                unsigned long DLC : 1;
                unsigned long CND : 1;
                unsigned long : 4;
                unsigned long RFOF : 1;
                unsigned long RDE : 1;
                unsigned long FR : 1;
                unsigned long TFUF : 1;
                unsigned long TDE : 1;
                unsigned long TC : 1;
                unsigned long ECI : 1;
                unsigned long ADE : 1;
                unsigned long RFCOF : 1;
                unsigned long RABT : 1;
                unsigned long TABT : 1;
                unsigned long : 3;
                unsigned long TWB : 1;
                unsigned long : 1;
            }
            BIT;
        }
        EESR;
        char wk5[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CERFIP : 1;
                unsigned long PREIP : 1;
                unsigned long RTSFIP : 1;
                unsigned long RTLFIP : 1;
                unsigned long RRFIP : 1;
                unsigned long : 2;
                unsigned long RMAFIP : 1;
                unsigned long TROIP : 1;
                unsigned long CDIP : 1;
                unsigned long DLCIP : 1;
                unsigned long CNDIP : 1;
                unsigned long : 4;
                unsigned long RFOFIP : 1;
                unsigned long RDEIP : 1;
                unsigned long FRIP : 1;
                unsigned long TFUFIP : 1;
                unsigned long TDEIP : 1;
                unsigned long TCIP : 1;
                unsigned long ECIIP : 1;
                unsigned long ADEIP : 1;
                unsigned long RFCOFIP : 1;
                unsigned long RABTIP : 1;
                unsigned long TABTIP : 1;
                unsigned long : 3;
                unsigned long TWBIP : 1;
                unsigned long : 1;
            }
            BIT;
        }
        EESIPR;
        char wk6[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CERFCE : 1;
                unsigned long PRECE : 1;
                unsigned long RTSFCE : 1;
                unsigned long RTLFCE : 1;
                unsigned long RRFCE : 1;
                unsigned long : 2;
                unsigned long RMAFCE : 1;
                unsigned long TROCE : 1;
                unsigned long CDCE : 1;
                unsigned long DLCCE : 1;
                unsigned long CNDCE : 1;
                unsigned long : 20;
            }
            BIT;
        }
        TRSCER;
        char wk7[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MFC : 16;
                unsigned long : 16;
            }
            BIT;
        }
        RMFCR;
        char wk8[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TFT : 11;
                unsigned long : 21;
            }
            BIT;
        }
        TFTR;
        char wk9[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RFD : 5;
                unsigned long : 3;
                unsigned long TFD : 5;
                unsigned long : 19;
            }
            BIT;
        }
        FDR;
        char wk10[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RNR : 1;
                unsigned long RNC : 1;
                unsigned long : 30;
            }
            BIT;
        }
        RMCR;
        char wk11[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long UNDER : 16;
                unsigned long : 16;
            }
            BIT;
        }
        TFUCR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long OVER : 16;
                unsigned long : 16;
            }
            BIT;
        }
        RFOCR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ELB : 1;
                unsigned long : 31;
            }
            BIT;
        }
        IOSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RFDO : 3;
                unsigned long : 13;
                unsigned long RFFO : 3;
                unsigned long : 13;
            }
            BIT;
        }
        FCFTR;
        char wk12[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PADR : 6;
                unsigned long : 10;
                unsigned long PADS : 2;
                unsigned long : 14;
            }
            BIT;
        }
        RPADIR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TIS : 1;
                unsigned long : 3;
                unsigned long TIM : 1;
                unsigned long : 27;
            }
            BIT;
        }
        TRIMD;
        char wk13[ 72 ];
        void * RBWAR;
        void * RDFAR;
        char wk14[ 4 ];
        void * TBRAR;
        void * TDFAR;
    };

    struct st_edmacp
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long SWR : 1;
                unsigned long : 3;
                unsigned long DL : 2;
                unsigned long DE : 1;
                unsigned long : 25;
            }
            BIT;
        }
        EDMR;
        char wk0[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TR : 1;
                unsigned long : 31;
            }
            BIT;
        }
        EDTRR;
        char wk1[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RR : 1;
                unsigned long : 31;
            }
            BIT;
        }
        EDRRR;
        char wk2[ 4 ];
        unsigned long TDLAR;
        char wk3[ 4 ];
        unsigned long RDLAR;
        char wk4[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 16;
                unsigned long RFOF : 1;
                unsigned long RDE : 1;
                unsigned long FR : 1;
                unsigned long TFUF : 1;
                unsigned long TDE : 1;
                unsigned long TC : 1;
                unsigned long ECI : 1;
                unsigned long ADE : 1;
                unsigned long RFCOF : 1;
                unsigned long RABT : 1;
                unsigned long TABT : 1;
                unsigned long : 3;
                unsigned long TWB : 1;
                unsigned long : 1;
            }
            BIT;
        }
        EESR;
        char wk5[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 16;
                unsigned long RFOFIP : 1;
                unsigned long RDEIP : 1;
                unsigned long FRIP : 1;
                unsigned long TFUFIP : 1;
                unsigned long TDEIP : 1;
                unsigned long TCIP : 1;
                unsigned long ECIIP : 1;
                unsigned long ADEIP : 1;
                unsigned long RFCOFIP : 1;
                unsigned long RABTIP : 1;
                unsigned long TABTIP : 1;
                unsigned long : 3;
                unsigned long TWBIP : 1;
                unsigned long : 1;
            }
            BIT;
        }
        EESIPR;
        char wk6[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CERFCE : 1;
                unsigned long PRECE : 1;
                unsigned long RTSFCE : 1;
                unsigned long RTLFCE : 1;
                unsigned long RRFCE : 1;
                unsigned long : 2;
                unsigned long RMAFCE : 1;
                unsigned long TROCE : 1;
                unsigned long CDCE : 1;
                unsigned long DLCCE : 1;
                unsigned long CNDCE : 1;
                unsigned long : 20;
            }
            BIT;
        }
        TRSCER;
        char wk7[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MFC : 16;
                unsigned long : 16;
            }
            BIT;
        }
        RMFCR;
        char wk8[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TFT : 11;
                unsigned long : 21;
            }
            BIT;
        }
        TFTR;
        char wk9[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RFD : 5;
                unsigned long : 3;
                unsigned long TFD : 5;
                unsigned long : 19;
            }
            BIT;
        }
        FDR;
        char wk10[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RNR : 1;
                unsigned long RNC : 1;
                unsigned long : 30;
            }
            BIT;
        }
        RMCR;
        char wk11[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long UNDER : 16;
                unsigned long : 16;
            }
            BIT;
        }
        TFUCR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long OVER : 16;
                unsigned long : 16;
            }
            BIT;
        }
        RFOCR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ELB : 1;
                unsigned long : 31;
            }
            BIT;
        }
        IOSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RFDO : 3;
                unsigned long : 13;
                unsigned long RFFO : 3;
                unsigned long : 13;
            }
            BIT;
        }
        FCFTR;
        char wk12[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PADR : 6;
                unsigned long : 10;
                unsigned long PADS : 2;
                unsigned long : 14;
            }
            BIT;
        }
        RPADIR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TIS : 1;
                unsigned long : 3;
                unsigned long TIM : 1;
                unsigned long : 27;
            }
            BIT;
        }
        TRIMD;
        char wk13[ 72 ];
        unsigned long RBWAR;
        unsigned long RDFAR;
        char wk14[ 4 ];
        unsigned long TBRAR;
        unsigned long TDFAR;
    };

