FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_elc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char ELCON : 1;
            }
            BIT;
        }
        ELCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR0;
        char wk0[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR4;
        char wk1[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR7;
        char wk2[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR10;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR11;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR12;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR13;
        char wk3[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR15;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR16;
        char wk4[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR18;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR19;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR20;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR21;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR22;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR23;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR24;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR25;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR26;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR27;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR28;
        char wk5[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MTU0MD : 2;
                unsigned char : 4;
                unsigned char MTU3MD : 2;
            }
            BIT;
        }
        ELOPA;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MTU4MD : 2;
                unsigned char : 6;
            }
            BIT;
        }
        ELOPB;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char CMT1MD : 2;
                unsigned char : 4;
            }
            BIT;
        }
        ELOPC;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMR0MD : 2;
                unsigned char TMR1MD : 2;
                unsigned char TMR2MD : 2;
                unsigned char TMR3MD : 2;
            }
            BIT;
        }
        ELOPD;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PGR0 : 1;
                unsigned char PGR1 : 1;
                unsigned char PGR2 : 1;
                unsigned char PGR3 : 1;
                unsigned char PGR4 : 1;
                unsigned char PGR5 : 1;
                unsigned char PGR6 : 1;
                unsigned char PGR7 : 1;
            }
            BIT;
        }
        PGR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PGR0 : 1;
                unsigned char PGR1 : 1;
                unsigned char PGR2 : 1;
                unsigned char PGR3 : 1;
                unsigned char PGR4 : 1;
                unsigned char PGR5 : 1;
                unsigned char PGR6 : 1;
                unsigned char PGR7 : 1;
            }
            BIT;
        }
        PGR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PGCI : 2;
                unsigned char PGCOVE : 1;
                unsigned char : 1;
                unsigned char PGCO : 3;
                unsigned char : 1;
            }
            BIT;
        }
        PGC1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PGCI : 2;
                unsigned char PGCOVE : 1;
                unsigned char : 1;
                unsigned char PGCO : 3;
                unsigned char : 1;
            }
            BIT;
        }
        PGC2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PDBF0 : 1;
                unsigned char PDBF1 : 1;
                unsigned char PDBF2 : 1;
                unsigned char PDBF3 : 1;
                unsigned char PDBF4 : 1;
                unsigned char PDBF5 : 1;
                unsigned char PDBF6 : 1;
                unsigned char PDBF7 : 1;
            }
            BIT;
        }
        PDBF1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PDBF0 : 1;
                unsigned char PDBF1 : 1;
                unsigned char PDBF2 : 1;
                unsigned char PDBF3 : 1;
                unsigned char PDBF4 : 1;
                unsigned char PDBF5 : 1;
                unsigned char PDBF6 : 1;
                unsigned char PDBF7 : 1;
            }
            BIT;
        }
        PDBF2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSB : 3;
                unsigned char PSP : 2;
                unsigned char PSM : 2;
                unsigned char : 1;
            }
            BIT;
        }
        PEL0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSB : 3;
                unsigned char PSP : 2;
                unsigned char PSM : 2;
                unsigned char : 1;
            }
            BIT;
        }
        PEL1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSB : 3;
                unsigned char PSP : 2;
                unsigned char PSM : 2;
                unsigned char : 1;
            }
            BIT;
        }
        PEL2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSB : 3;
                unsigned char PSP : 2;
                unsigned char PSM : 2;
                unsigned char : 1;
            }
            BIT;
        }
        PEL3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SEG : 1;
                unsigned char : 5;
                unsigned char WE : 1;
                unsigned char WI : 1;
            }
            BIT;
        }
        ELSEGR;
        char wk6[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR33;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR35;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR36;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR37;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR38;
        char wk8[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR41;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR42;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR43;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR44;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ELS : 8;
            }
            BIT;
        }
        ELSR45;
        char wk9[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPU0MD : 2;
                unsigned char TPU1MD : 2;
                unsigned char TPU2MD : 2;
                unsigned char TPU3MD : 2;
            }
            BIT;
        }
        ELOPF;
        char wk10[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CMTW0MD : 2;
                unsigned char : 6;
            }
            BIT;
        }
        ELOPH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char GPT0MD : 3;
                unsigned char : 1;
                unsigned char GPT1MD : 3;
                unsigned char : 1;
            }
            BIT;
        }
        ELOPI;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char GPT2MD : 3;
                unsigned char : 1;
                unsigned char GPT3MD : 3;
                unsigned char : 1;
            }
            BIT;
        }
        ELOPJ;
    };

