FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_eptpcs
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long OFMUD : 1;
                unsigned long INTCHG : 1;
                unsigned long MPDUD : 1;
                unsigned long : 1;
                unsigned long DRPTO : 1;
                unsigned long INTDEV : 1;
                unsigned long DRQOVR : 1;
                unsigned long : 2;
                unsigned long PDRPMR : 1;
                unsigned long : 2;
                unsigned long RECLP : 1;
                unsigned long SRTABT : 1;
                unsigned long INFABT : 1;
                unsigned long : 1;
                unsigned long RESDN : 1;
                unsigned long GENDN : 1;
                unsigned long : 2;
                unsigned long PRE0 : 1;
                unsigned long PRE1 : 1;
                unsigned long PRE2 : 1;
                unsigned long PRE3 : 1;
                unsigned long : 8;
            }
            BIT;
        }
        SYSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long OFMUD : 1;
                unsigned long INTCHG : 1;
                unsigned long MPDUD : 1;
                unsigned long : 1;
                unsigned long DRPTO : 1;
                unsigned long INTDEV : 1;
                unsigned long DRQOVR : 1;
                unsigned long : 2;
                unsigned long PDRPMR : 1;
                unsigned long : 2;
                unsigned long RECLP : 1;
                unsigned long SRTABT : 1;
                unsigned long INFABT : 1;
                unsigned long : 1;
                unsigned long RESDN : 1;
                unsigned long GENDN : 1;
                unsigned long : 2;
                unsigned long PRE0 : 1;
                unsigned long PRE1 : 1;
                unsigned long PRE2 : 1;
                unsigned long PRE3 : 1;
                unsigned long : 8;
            }
            BIT;
        }
        SYIPR;
        char wk0[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REV : 16;
                unsigned long VER : 16;
            }
            BIT;
        }
        SYVRR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACU : 24;
                unsigned long : 8;
            }
            BIT;
        }
        SYMACRU;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACL : 24;
                unsigned long : 8;
            }
            BIT;
        }
        SYMACRL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long LLC : 8;
                unsigned long : 24;
            }
            BIT;
        }
        SYLLCCTLR;
        unsigned long SYIPR2;
        char wk1[ 32 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long VER : 4;
                unsigned long TRSP : 4;
                unsigned long : 24;
            }
            BIT;
        }
        SYSPVRR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long DNUM : 8;
                unsigned long : 24;
            }
            BIT;
        }
        SYDOMR;
        char wk2[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FLG0 : 1;
                unsigned long FLG1 : 1;
                unsigned long FLG2 : 1;
                unsigned long FLG3 : 1;
                unsigned long FLG4 : 1;
                unsigned long FLG5 : 1;
                unsigned long FLG6 : 1;
                unsigned long FLG7 : 1;
                unsigned long FLG8 : 1;
                unsigned long FLG9 : 1;
                unsigned long FLG10 : 1;
                unsigned long FLG11 : 1;
                unsigned long FLG12 : 1;
                unsigned long FLG13 : 1;
                unsigned long FLG14 : 1;
                unsigned long FLG15 : 1;
                unsigned long : 16;
            }
            BIT;
        }
        ANFR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FLG0 : 1;
                unsigned long FLG1 : 1;
                unsigned long FLG2 : 1;
                unsigned long FLG3 : 1;
                unsigned long FLG4 : 1;
                unsigned long FLG5 : 1;
                unsigned long FLG6 : 1;
                unsigned long FLG7 : 1;
                unsigned long FLG8 : 1;
                unsigned long FLG9 : 1;
                unsigned long FLG10 : 1;
                unsigned long FLG11 : 1;
                unsigned long FLG12 : 1;
                unsigned long FLG13 : 1;
                unsigned long FLG14 : 1;
                unsigned long FLG15 : 1;
                unsigned long : 16;
            }
            BIT;
        }
        SYNFR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FLG0 : 1;
                unsigned long FLG1 : 1;
                unsigned long FLG2 : 1;
                unsigned long FLG3 : 1;
                unsigned long FLG4 : 1;
                unsigned long FLG5 : 1;
                unsigned long FLG6 : 1;
                unsigned long FLG7 : 1;
                unsigned long FLG8 : 1;
                unsigned long FLG9 : 1;
                unsigned long FLG10 : 1;
                unsigned long FLG11 : 1;
                unsigned long FLG12 : 1;
                unsigned long FLG13 : 1;
                unsigned long FLG14 : 1;
                unsigned long FLG15 : 1;
                unsigned long : 16;
            }
            BIT;
        }
        DYRQFR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FLG0 : 1;
                unsigned long FLG1 : 1;
                unsigned long FLG2 : 1;
                unsigned long FLG3 : 1;
                unsigned long FLG4 : 1;
                unsigned long FLG5 : 1;
                unsigned long FLG6 : 1;
                unsigned long FLG7 : 1;
                unsigned long FLG8 : 1;
                unsigned long FLG9 : 1;
                unsigned long FLG10 : 1;
                unsigned long FLG11 : 1;
                unsigned long FLG12 : 1;
                unsigned long FLG13 : 1;
                unsigned long FLG14 : 1;
                unsigned long FLG15 : 1;
                unsigned long : 16;
            }
            BIT;
        }
        DYRPFR;
        unsigned long SYCIDRU;
        unsigned long SYCIDRL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PNUM : 16;
                unsigned long : 16;
            }
            BIT;
        }
        SYPNUMR;
        char wk3[ 20 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long BMUP : 1;
                unsigned long STUP : 1;
                unsigned long ANUP : 1;
                unsigned long : 29;
            }
            BIT;
        }
        SYRVLDR;
        char wk4[ 12 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ANCE0 : 1;
                unsigned long ANCE1 : 1;
                unsigned long : 2;
                unsigned long SYNC0 : 1;
                unsigned long SYNC1 : 1;
                unsigned long SYNC2 : 1;
                unsigned long : 1;
                unsigned long FUP0 : 1;
                unsigned long FUP1 : 1;
                unsigned long FUP2 : 1;
                unsigned long : 1;
                unsigned long DRQ0 : 1;
                unsigned long DRQ1 : 1;
                unsigned long DRQ2 : 1;
                unsigned long : 1;
                unsigned long DRP0 : 1;
                unsigned long DRP1 : 1;
                unsigned long DRP2 : 1;
                unsigned long : 1;
                unsigned long PDRQ0 : 1;
                unsigned long PDRQ1 : 1;
                unsigned long PDRQ2 : 1;
                unsigned long : 1;
                unsigned long PDRP0 : 1;
                unsigned long PDRP1 : 1;
                unsigned long PDRP2 : 1;
                unsigned long : 1;
                unsigned long PDFUP0 : 1;
                unsigned long PDFUP1 : 1;
                unsigned long PDFUP2 : 1;
                unsigned long : 1;
            }
            BIT;
        }
        SYRFL1R;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MAN0 : 1;
                unsigned long MAN1 : 1;
                unsigned long : 2;
                unsigned long SIG0 : 1;
                unsigned long SIG1 : 1;
                unsigned long : 22;
                unsigned long ILL0 : 1;
                unsigned long ILL1 : 1;
                unsigned long : 2;
            }
            BIT;
        }
        SYRFL2R;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ANCE : 1;
                unsigned long : 3;
                unsigned long SYNC : 1;
                unsigned long : 3;
                unsigned long DRQ : 1;
                unsigned long : 3;
                unsigned long PDRQ : 1;
                unsigned long : 19;
            }
            BIT;
        }
        SYTRENR;
        char wk5[ 4 ];
        unsigned long MTCIDU;
        unsigned long MTCIDL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PNUM : 16;
                unsigned long : 16;
            }
            BIT;
        }
        MTPID;
        char wk6[ 20 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ANCE : 8;
                unsigned long SYNC : 8;
                unsigned long DRQ : 8;
                unsigned long : 8;
            }
            BIT;
        }
        SYTLIR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ANCE : 8;
                unsigned long SYNC : 8;
                unsigned long DRP : 8;
                unsigned long : 8;
            }
            BIT;
        }
        SYRLIR;
        unsigned long OFMRU;
        unsigned long OFMRL;
        unsigned long MPDRU;
        unsigned long MPDRL;
        char wk7[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long GMPR2 : 8;
                unsigned long : 8;
                unsigned long GMPR1 : 8;
                unsigned long : 8;
            }
            BIT;
        }
        GMPR;
        unsigned long GMCQR;
        unsigned long GMIDRU;
        unsigned long GMIDRL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TSRC : 8;
                unsigned long : 8;
                unsigned long CUTO : 16;
            }
            BIT;
        }
        CUOTSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long SRMV : 16;
                unsigned long : 16;
            }
            BIT;
        }
        SRR;
        char wk8[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACU : 24;
                unsigned long : 8;
            }
            BIT;
        }
        PPMACRU;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACL : 24;
                unsigned long : 8;
            }
            BIT;
        }
        PPMACRL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACU : 24;
                unsigned long : 8;
            }
            BIT;
        }
        PDMACRU;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACL : 24;
                unsigned long : 8;
            }
            BIT;
        }
        PDMACRL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TYPE : 16;
                unsigned long : 16;
            }
            BIT;
        }
        PETYPER;
        char wk9[ 12 ];
        unsigned long PPIPR;
        unsigned long PDIPR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EVTO : 8;
                unsigned long : 24;
            }
            BIT;
        }
        PETOSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long GETO : 8;
                unsigned long : 24;
            }
            BIT;
        }
        PGTOSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PRTL : 8;
                unsigned long : 24;
            }
            BIT;
        }
        PPTTLR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PDTL : 8;
                unsigned long : 24;
            }
            BIT;
        }
        PDTTLR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EVUPT : 16;
                unsigned long : 16;
            }
            BIT;
        }
        PEUDPR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long GEUPT : 16;
                unsigned long : 16;
            }
            BIT;
        }
        PGUDPR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long SEL : 1;
                unsigned long PRT : 1;
                unsigned long ENB : 1;
                unsigned long : 29;
            }
            BIT;
        }
        FFLTR;
        char wk10[ 28 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACU : 24;
                unsigned long : 8;
            }
            BIT;
        }
        FMAC0RU;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACL : 24;
                unsigned long : 8;
            }
            BIT;
        }
        FMAC0RL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACU : 24;
                unsigned long : 8;
            }
            BIT;
        }
        FMAC1RU;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MACL : 24;
                unsigned long : 8;
            }
            BIT;
        }
        FMAC1RL;
        char wk11[ 80 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ASYMU : 16;
                unsigned long : 16;
            }
            BIT;
        }
        DASYMRU;
        unsigned long DASYMRL;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EGP : 16;
                unsigned long INGP : 16;
            }
            BIT;
        }
        TSLATR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long TCYC : 8;
                unsigned long : 4;
                unsigned long SBDIS : 1;
                unsigned long : 3;
                unsigned long FILDIS : 1;
                unsigned long : 3;
                unsigned long TCMOD : 1;
                unsigned long : 3;
                unsigned long TRAN : 1;
                unsigned long : 7;
            }
            BIT;
        }
        SYCONFR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FORM0 : 1;
                unsigned long FORM1 : 1;
                unsigned long : 30;
            }
            BIT;
        }
        SYFORMR;
        unsigned long RSTOUTR;
    };

