FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
                unsigned long EN7 : 1;
                unsigned long EN8 : 1;
                unsigned long EN9 : 1;
                unsigned long EN10 : 1;
                unsigned long EN11 : 1;
                unsigned long EN12 : 1;
                unsigned long EN13 : 1;
                unsigned long EN14 : 1;
                unsigned long EN15 : 1;
                unsigned long EN16 : 1;
                unsigned long EN17 : 1;
                unsigned long EN18 : 1;
                unsigned long EN19 : 1;
                unsigned long EN20 : 1;
                unsigned long EN21 : 1;
                unsigned long EN22 : 1;
                unsigned long EN23 : 1;
                unsigned long EN24 : 1;
                unsigned long EN25 : 1;
                unsigned long EN26 : 1;
                unsigned long EN27 : 1;
                unsigned long EN28 : 1;
                unsigned long EN29 : 1;
                unsigned long EN30 : 1;
                unsigned long EN31 : 1;
            }
            BIT;
        }
        GENAL0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EN0 : 1;
                unsigned long EN1 : 1;
                unsigned long EN2 : 1;
                unsigned long EN3 : 1;
                unsigned long EN4 : 1;
                unsigned long EN5 : 1;
                unsigned long EN6 : 1;
                unsigned long EN7 : 1;
                unsigned long EN8 : 1;
                unsigned long EN9 : 1;
                unsigned long EN10 : 1;
                unsigned long EN11 : 1;
                unsigned long EN12 : 1;
                unsigned long EN13 : 1;
                unsigned long EN14 : 1;
                unsigned long EN15 : 1;
                unsigned long EN16 : 1;
                unsigned long EN17 : 1;
                unsigned long EN18 : 1;
                unsigned long EN19 : 1;
                unsigned long EN20 : 1;
                unsigned long EN21 : 1;
                unsigned long EN22 : 1;
                unsigned long EN23 : 1;
                unsigned long EN24 : 1;
                unsigned long EN25 : 1;
                unsigned long EN26 : 1;
                unsigned long EN27 : 1;
                unsigned long EN28 : 1;
                unsigned long EN29 : 1;
                unsigned long EN30 : 1;
                unsigned long EN31 : 1;
            }
            BIT;
        }
        GENAL1;
        char wk27[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CLR0 : 1;
                unsigned long CLR1 : 1;
                unsigned long CLR2 : 1;
                unsigned long CLR3 : 1;
                unsigned long CLR4 : 1;
                unsigned long CLR5 : 1;
                unsigned long CLR6 : 1;
                unsigned long CLR7 : 1;
                unsigned long CLR8 : 1;
                unsigned long CLR9 : 1;
                unsigned long CLR10 : 1;
                unsigned long CLR11 : 1;
                unsigned long CLR12 : 1;
                unsigned long CLR13 : 1;
                unsigned long CLR14 : 1;
                unsigned long CLR15 : 1;
                unsigned long CLR16 : 1;
                unsigned long CLR17 : 1;
                unsigned long CLR18 : 1;
                unsigned long CLR19 : 1;
                unsigned long CLR20 : 1;
                unsigned long CLR21 : 1;
                unsigned long CLR22 : 1;
                unsigned long CLR23 : 1;
                unsigned long CLR24 : 1;
                unsigned long CLR25 : 1;
                unsigned long CLR26 : 1;
                unsigned long CLR27 : 1;
                unsigned long CLR28 : 1;
                unsigned long CLR29 : 1;
                unsigned long CLR30 : 1;
                unsigned long CLR31 : 1;
            }
            BIT;
        }
        GCREAE0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CLR0 : 1;
                unsigned long CLR1 : 1;
                unsigned long CLR2 : 1;
                unsigned long CLR3 : 1;
                unsigned long CLR4 : 1;
                unsigned long CLR5 : 1;
                unsigned long CLR6 : 1;
                unsigned long CLR7 : 1;
                unsigned long CLR8 : 1;
                unsigned long CLR9 : 1;
                unsigned long CLR10 : 1;
                unsigned long CLR11 : 1;
                unsigned long CLR12 : 1;
                unsigned long CLR13 : 1;
                unsigned long CLR14 : 1;
                unsigned long CLR15 : 1;
                unsigned long CLR16 : 1;
                unsigned long CLR17 : 1;
                unsigned long CLR18 : 1;
                unsigned long CLR19 : 1;
                unsigned long CLR20 : 1;
                unsigned long CLR21 : 1;
                unsigned long CLR22 : 1;
                unsigned long CLR23 : 1;
                unsigned long CLR24 : 1;
                unsigned long CLR25 : 1;
                unsigned long CLR26 : 1;
                unsigned long CLR27 : 1;
                unsigned long CLR28 : 1;
                unsigned long CLR29 : 1;
                unsigned long CLR30 : 1;
                unsigned long CLR31 : 1;
            }
            BIT;
        }
        GCREAE1;
        char wk28[ 120 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR4;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR5;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR6;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR7;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR8;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIAR9;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIARA;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR0 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR7 : 1;
            }
            BIT;
        }
        PIARB;
        char wk29[ 196 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR208;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR209;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR210;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR211;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR212;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR213;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR214;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR215;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR216;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR217;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR218;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR219;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR220;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR221;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR222;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR223;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR224;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR225;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR226;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR227;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR228;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR229;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR230;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR231;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR232;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR233;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR234;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR235;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR236;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR237;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR238;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR239;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR240;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR241;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR242;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR243;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR244;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR245;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR246;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR247;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR248;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR249;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR250;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR251;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR252;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR253;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR254;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLI : 8;
            }
            BIT;
        }
        SLIAR255;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char WPRC : 1;
                unsigned char : 7;
            }
            BIT;
        }
        SLIPRCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SELEXD0 : 1;
                unsigned char SELEXD1 : 1;
                unsigned char : 6;
            }
            BIT;
        }
        SELEXDR;
    };

