FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PB4PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PB5PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PB6PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PB7PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC0PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC1PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC2PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC3PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC4PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC5PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC6PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PC7PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD0PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD1PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD2PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD3PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD4PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD5PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD6PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PD7PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE0PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE1PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE2PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE3PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE4PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE5PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE6PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char ASEL : 1;
            }
            BIT;
        }
        PE7PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PF0PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PF1PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PF2PFS;
        char wk11[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char ISEL : 1;
                unsigned char : 1;
            }
            BIT;
        }
        PF5PFS;
        char wk12[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG0PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG1PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG2PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG3PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG4PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG5PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG6PFS;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PG7PFS;
        char wk13[ 11 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PJ3PFS;
        char wk14[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PSEL : 6;
                unsigned char : 2;
            }
            BIT;
        }
        PJ5PFS;
    };

