FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_mtu5
    {
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFUEN : 1;
                unsigned char NFVEN : 1;
                unsigned char NFWEN : 1;
                unsigned char : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR5;
        char wk1[ 2538 ];
        unsigned short TCNTU;
        unsigned short TGRU;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 2;
                unsigned char : 6;
            }
            BIT;
        }
        TCRU;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC2 : 3;
                unsigned char CKEG : 2;
                unsigned char : 3;
            }
            BIT;
        }
        TCR2U;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 5;
                unsigned char : 3;
            }
            BIT;
        }
        TIORU;
        char wk2[ 9 ];
        unsigned short TCNTV;
        unsigned short TGRV;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 2;
                unsigned char : 6;
            }
            BIT;
        }
        TCRV;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC2 : 3;
                unsigned char CKEG : 2;
                unsigned char : 3;
            }
            BIT;
        }
        TCR2V;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 5;
                unsigned char : 3;
            }
            BIT;
        }
        TIORV;
        char wk3[ 9 ];
        unsigned short TCNTW;
        unsigned short TGRW;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 2;
                unsigned char : 6;
            }
            BIT;
        }
        TCRW;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC2 : 3;
                unsigned char CKEG : 2;
                unsigned char : 3;
            }
            BIT;
        }
        TCR2W;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 5;
                unsigned char : 3;
            }
            BIT;
        }
        TIORW;
        char wk4[ 9 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CMFW5 : 1;
                unsigned char CMFV5 : 1;
                unsigned char CMFU5 : 1;
                unsigned char : 5;
            }
            BIT;
        }
        TSR;
        char wk5[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIE5W : 1;
                unsigned char TGIE5V : 1;
                unsigned char TGIE5U : 1;
                unsigned char : 5;
            }
            BIT;
        }
        TIER;
        char wk6[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CSTW5 : 1;
                unsigned char CSTV5 : 1;
                unsigned char CSTU5 : 1;
                unsigned char : 5;
            }
            BIT;
        }
        TSTR;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CMPCLR5W : 1;
                unsigned char CMPCLR5V : 1;
                unsigned char CMPCLR5U : 1;
                unsigned char : 5;
            }
            BIT;
        }
        TCNTCMPCLR;
    };

    struct st_mtu6
    {
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFAEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFDEN : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR6;
        char wk1[ 1884 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 3;
                unsigned char CKEG : 2;
                unsigned char CCLR : 3;
            }
            BIT;
        }
        TCR;
        char wk2[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MD : 4;
                unsigned char BFA : 1;
                unsigned char BFB : 1;
                unsigned char : 2;
            }
            BIT;
        }
        TMDR1;
        char wk3[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOA : 4;
                unsigned char IOB : 4;
            }
            BIT;
        }
        TIORH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 4;
                unsigned char IOD : 4;
            }
            BIT;
        }
        TIORL;
        char wk4[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIEA : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIED : 1;
                unsigned char TCIEV : 1;
                unsigned char : 2;
                unsigned char TTGE : 1;
            }
            BIT;
        }
        TIER;
        char wk5[ 7 ];
        unsigned short TCNT;
        char wk6[ 6 ];
        unsigned short TGRA;
        unsigned short TGRB;
        char wk7[ 8 ];
        unsigned short TGRC;
        unsigned short TGRD;
        char wk8[ 4 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGFA : 1;
                unsigned char TGFB : 1;
                unsigned char TGFC : 1;
                unsigned char TGFD : 1;
                unsigned char TCFV : 1;
                unsigned char : 2;
                unsigned char TCFD : 1;
            }
            BIT;
        }
        TSR;
        char wk9[ 11 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TTSA : 1;
                unsigned char TTSB : 1;
                unsigned char : 6;
            }
            BIT;
        }
        TBTM;
        char wk10[ 19 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC2 : 3;
                unsigned char : 5;
            }
            BIT;
        }
        TCR2;
        char wk11[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CE2B : 1;
                unsigned char CE2A : 1;
                unsigned char CE1B : 1;
                unsigned char CE1A : 1;
                unsigned char CE0D : 1;
                unsigned char CE0C : 1;
                unsigned char CE0B : 1;
                unsigned char CE0A : 1;
            }
            BIT;
        }
        TSYCR;
        char wk12[ 33 ];
        unsigned short TGRE;
    };

