FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_mtu7
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFAEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFDEN : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR7;
        char wk0[ 1884 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 3;
                unsigned char CKEG : 2;
                unsigned char CCLR : 3;
            }
            BIT;
        }
        TCR;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MD : 4;
                unsigned char BFA : 1;
                unsigned char BFB : 1;
                unsigned char : 2;
            }
            BIT;
        }
        TMDR1;
        char wk2[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOA : 4;
                unsigned char IOB : 4;
            }
            BIT;
        }
        TIORH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 4;
                unsigned char IOD : 4;
            }
            BIT;
        }
        TIORL;
        char wk3[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIEA : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIED : 1;
                unsigned char TCIEV : 1;
                unsigned char : 1;
                unsigned char TTGE2 : 1;
                unsigned char TTGE : 1;
            }
            BIT;
        }
        TIER;
        char wk4[ 8 ];
        unsigned short TCNT;
        char wk5[ 8 ];
        unsigned short TGRA;
        unsigned short TGRB;
        char wk6[ 8 ];
        unsigned short TGRC;
        unsigned short TGRD;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGFA : 1;
                unsigned char TGFB : 1;
                unsigned char TGFC : 1;
                unsigned char TGFD : 1;
                unsigned char TCFV : 1;
                unsigned char : 2;
                unsigned char TCFD : 1;
            }
            BIT;
        }
        TSR;
        char wk8[ 11 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TTSA : 1;
                unsigned char TTSB : 1;
                unsigned char : 6;
            }
            BIT;
        }
        TBTM;
        char wk9[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ITB7VE : 1;
                unsigned short ITB6AE : 1;
                unsigned short ITA7VE : 1;
                unsigned short ITA6AE : 1;
                unsigned short DT7BE : 1;
                unsigned short UT7BE : 1;
                unsigned short DT7AE : 1;
                unsigned short UT7AE : 1;
                unsigned short : 6;
                unsigned short BF : 2;
            }
            BIT;
        }
        TADCR;
        char wk10[ 2 ];
        unsigned short TADCORA;
        unsigned short TADCORB;
        unsigned short TADCOBRA;
        unsigned short TADCOBRB;
        char wk11[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC2 : 3;
                unsigned char : 5;
            }
            BIT;
        }
        TCR2;
        char wk12[ 38 ];
        unsigned short TGRE;
        unsigned short TGRF;
    };

    struct st_mtu8
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFAEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFDEN : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR8;
        char wk0[ 871 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 3;
                unsigned char CKEG : 2;
                unsigned char CCLR : 3;
            }
            BIT;
        }
        TCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MD : 4;
                unsigned char BFA : 1;
                unsigned char BFB : 1;
                unsigned char : 2;
            }
            BIT;
        }
        TMDR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOA : 4;
                unsigned char IOB : 4;
            }
            BIT;
        }
        TIORH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 4;
                unsigned char IOD : 4;
            }
            BIT;
        }
        TIORL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIEA : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIED : 1;
                unsigned char TCIEV : 1;
                unsigned char TCIEU : 1;
                unsigned char : 2;
            }
            BIT;
        }
        TIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGFA : 1;
                unsigned char TGFB : 1;
                unsigned char TGFC : 1;
                unsigned char TGFD : 1;
                unsigned char TCFV : 1;
                unsigned char : 3;
            }
            BIT;
        }
        TSR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC2 : 3;
                unsigned char PCB : 2;
                unsigned char : 3;
            }
            BIT;
        }
        TCR2;
        char wk1[ 1 ];
        unsigned long TCNT;
        unsigned long TGRA;
        unsigned long TGRB;
        unsigned long TGRC;
        unsigned long TGRD;
    };

    struct st_pdc
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PCKE : 1;
                unsigned long VPS : 1;
                unsigned long HPS : 1;
                unsigned long PRST : 1;
                unsigned long DFIE : 1;
                unsigned long FEIE : 1;
                unsigned long OVIE : 1;
                unsigned long UDRIE : 1;
                unsigned long VERIE : 1;
                unsigned long HERIE : 1;
                unsigned long PCKOE : 1;
                unsigned long PCKDIV : 3;
                unsigned long EDS : 1;
                unsigned long : 17;
            }
            BIT;
        }
        PCCR0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long PCE : 1;
                unsigned long : 31;
            }
            BIT;
        }
        PCCR1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FBSY : 1;
                unsigned long FEMPF : 1;
                unsigned long FEF : 1;
                unsigned long OVRF : 1;
                unsigned long UDRF : 1;
                unsigned long VERF : 1;
                unsigned long HERF : 1;
                unsigned long : 25;
            }
            BIT;
        }
        PCSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long VSYNC : 1;
                unsigned long HSYNC : 1;
                unsigned long : 30;
            }
            BIT;
        }
        PCMONR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long B0 : 1;
                unsigned long B1 : 1;
                unsigned long B2 : 1;
                unsigned long B3 : 1;
                unsigned long B4 : 1;
                unsigned long B5 : 1;
                unsigned long B6 : 1;
                unsigned long B7 : 1;
                unsigned long B8 : 1;
                unsigned long B9 : 1;
                unsigned long B10 : 1;
                unsigned long B11 : 1;
                unsigned long B12 : 1;
                unsigned long B13 : 1;
                unsigned long B14 : 1;
                unsigned long B15 : 1;
                unsigned long B16 : 1;
                unsigned long B17 : 1;
                unsigned long B18 : 1;
                unsigned long B19 : 1;
                unsigned long B20 : 1;
                unsigned long B21 : 1;
                unsigned long B22 : 1;
                unsigned long B23 : 1;
                unsigned long B24 : 1;
                unsigned long B25 : 1;
                unsigned long B26 : 1;
                unsigned long B27 : 1;
                unsigned long B28 : 1;
                unsigned long B29 : 1;
                unsigned long B30 : 1;
                unsigned long B31 : 1;
            }
            BIT;
        }
        PCDR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long VST : 12;
                unsigned long : 4;
                unsigned long VSZ : 12;
                unsigned long : 4;
            }
            BIT;
        }
        VCR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long HST : 12;
                unsigned long : 4;
                unsigned long HSZ : 12;
                unsigned long : 4;
            }
            BIT;
        }
        HCR;
    };

    struct st_poe
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char POE0M : 2;
                unsigned char : 6;
                unsigned char PIE1 : 1;
                unsigned char : 3;
                unsigned char POE0F : 1;
                unsigned char : 3;
            }
            BIT;
        }
        ICSR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char OIE1 : 1;
                unsigned char OCE1 : 1;
                unsigned char : 5;
                unsigned char OSF1 : 1;
            }
            BIT;
        }
        OCSR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char POE4M : 2;
                unsigned char : 6;
                unsigned char PIE2 : 1;
                unsigned char : 3;
                unsigned char POE4F : 1;
                unsigned char : 3;
            }
            BIT;
        }
        ICSR2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char OIE2 : 1;
                unsigned char OCE2 : 1;
                unsigned char : 5;
                unsigned char OSF2 : 1;
            }
            BIT;
        }
        OCSR2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char POE8M : 2;
                unsigned char : 6;
                unsigned char PIE3 : 1;
                unsigned char POE8E : 1;
                unsigned char : 2;
                unsigned char POE8F : 1;
                unsigned char : 3;
            }
            BIT;
        }
        ICSR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MTUCH34HIZ : 1;
                unsigned char MTUCH67HIZ : 1;
                unsigned char MTUCH0HIZ : 1;
                unsigned char GPT01HIZ : 1;
                unsigned char GPT23HIZ : 1;
                unsigned char : 3;
            }
            BIT;
        }
        SPOER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MTU0AZE : 1;
                unsigned char MTU0BZE : 1;
                unsigned char MTU0CZE : 1;
                unsigned char MTU0DZE : 1;
                unsigned char : 4;
            }
            BIT;
        }
        POECR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short MTU7BDZE : 1;
                unsigned short MTU7ACZE : 1;
                unsigned short MTU6BDZE : 1;
                unsigned short : 5;
                unsigned short MTU4BDZE : 1;
                unsigned short MTU4ACZE : 1;
                unsigned short MTU3BDZE : 1;
                unsigned short : 5;
            }
            BIT;
        }
        POECR2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short GPT0ABZE : 1;
                unsigned short GPT1ABZE : 1;
                unsigned short : 6;
                unsigned short GPT2ABZE : 1;
                unsigned short GPT3ABZE : 1;
                unsigned short : 6;
            }
            BIT;
        }
        POECR3;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 2;
                unsigned short IC2ADDMT34ZE : 1;
                unsigned short IC3ADDMT34ZE : 1;
                unsigned short IC4ADDMT34ZE : 1;
                unsigned short IC5ADDMT34ZE : 1;
                unsigned short : 3;
                unsigned short IC1ADDMT67ZE : 1;
                unsigned short : 1;
                unsigned short IC3ADDMT67ZE : 1;
                unsigned short IC4ADDMT67ZE : 1;
                unsigned short IC5ADDMT67ZE : 1;
                unsigned short : 2;
            }
            BIT;
        }
        POECR4;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short IC1ADDMT0ZE : 1;
                unsigned short IC2ADDMT0ZE : 1;
                unsigned short : 1;
                unsigned short IC4ADDMT0ZE : 1;
                unsigned short IC5ADDMT0ZE : 1;
                unsigned short : 10;
            }
            BIT;
        }
        POECR5;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short IC1ADDGPT01ZE : 1;
                unsigned short IC2ADDGPT01Z : 1;
                unsigned short IC3ADDGPT01ZE : 1;
                unsigned short : 1;
                unsigned short IC5ADDGPT01ZE : 1;
                unsigned short : 3;
                unsigned short IC1ADDGPT23ZE : 1;
                unsigned short IC2ADDGPT23Z : 1;
                unsigned short IC3ADDGPT23ZE : 1;
                unsigned short IC4ADDGPT23ZE : 1;
                unsigned short : 3;
            }
            BIT;
        }
        POECR6;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char POE10M : 2;
                unsigned char : 6;
                unsigned char PIE4 : 1;
                unsigned char POE10E : 1;
                unsigned char : 2;
                unsigned char POE10F : 1;
                unsigned char : 3;
            }
            BIT;
        }
        ICSR4;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char POE11M : 2;
                unsigned char : 6;
                unsigned char PIE5 : 1;
                unsigned char POE11E : 1;
                unsigned char : 2;
                unsigned char POE11F : 1;
                unsigned char : 3;
            }
            BIT;
        }
        ICSR5;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char OLSG0A : 1;
                unsigned char OLSG0B : 1;
                unsigned char OLSG1A : 1;
                unsigned char OLSG1B : 1;
                unsigned char OLSG2A : 1;
                unsigned char OLSG2B : 1;
                unsigned char : 1;
                unsigned char OLSEN : 1;
                unsigned char : 8;
            }
            BIT;
        }
        ALR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char : 1;
                unsigned char OSTSTE : 1;
                unsigned char : 2;
                unsigned char OSTSTF : 1;
                unsigned char : 3;
            }
            BIT;
        }
        ICSR6;
        char wk0[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G0ASEL : 4;
                unsigned char G0BSEL : 4;
            }
            BIT;
        }
        G0SELR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G1ASEL : 4;
                unsigned char G1BSEL : 4;
            }
            BIT;
        }
        G1SELR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G2ASEL : 4;
                unsigned char G2BSEL : 4;
            }
            BIT;
        }
        G2SELR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G3ASEL : 4;
                unsigned char G3BSEL : 4;
            }
            BIT;
        }
        G3SELR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char M0ASEL : 4;
                unsigned char M0BSEL : 4;
            }
            BIT;
        }
        M0SELR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char M0CSEL : 4;
                unsigned char M0DSEL : 4;
            }
            BIT;
        }
        M0SELR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char M3BSEL : 4;
                unsigned char M3DSEL : 4;
            }
            BIT;
        }
        M3SELR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char M4ASEL : 4;
                unsigned char M4CSEL : 4;
            }
            BIT;
        }
        M4SELR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char M4BSEL : 4;
                unsigned char M4DSEL : 4;
            }
            BIT;
        }
        M4SELR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char M4G0SEL : 1;
                unsigned char M4G1SEL : 1;
                unsigned char M4G2SEL : 1;
                unsigned char : 5;
            }
            BIT;
        }
        MGSELR;
    };

