FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_qspi
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char SPSSLIE : 1;
                unsigned char : 3;
                unsigned char SPTIE : 1;
                unsigned char SPE : 1;
                unsigned char SPRIE : 1;
            }
            BIT;
        }
        SPCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SSLP : 1;
                unsigned char : 7;
            }
            BIT;
        }
        SSLP;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPLP : 1;
                unsigned char IO2FV : 1;
                unsigned char IO3FV : 1;
                unsigned char : 1;
                unsigned char MOIFV : 1;
                unsigned char MOIFE : 1;
                unsigned char : 2;
            }
            BIT;
        }
        SPPCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char SPSSLF : 1;
                unsigned char SPTEF : 1;
                unsigned char TREND : 1;
                unsigned char SPRFF : 1;
            }
            BIT;
        }
        SPSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long SPD0 : 1;
                unsigned long SPD1 : 1;
                unsigned long SPD2 : 1;
                unsigned long SPD3 : 1;
                unsigned long SPD4 : 1;
                unsigned long SPD5 : 1;
                unsigned long SPD6 : 1;
                unsigned long SPD7 : 1;
                unsigned long SPD8 : 1;
                unsigned long SPD9 : 1;
                unsigned long SPD10 : 1;
                unsigned long SPD11 : 1;
                unsigned long SPD12 : 1;
                unsigned long SPD13 : 1;
                unsigned long SPD14 : 1;
                unsigned long SPD15 : 1;
                unsigned long SPD16 : 1;
                unsigned long SPD17 : 1;
                unsigned long SPD18 : 1;
                unsigned long SPD19 : 1;
                unsigned long SPD20 : 1;
                unsigned long SPD21 : 1;
                unsigned long SPD22 : 1;
                unsigned long SPD23 : 1;
                unsigned long SPD24 : 1;
                unsigned long SPD25 : 1;
                unsigned long SPD26 : 1;
                unsigned long SPD27 : 1;
                unsigned long SPD28 : 1;
                unsigned long SPD29 : 1;
                unsigned long SPD30 : 1;
                unsigned long SPD31 : 1;
            }
            BIT;
        }
        SPDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPSC : 2;
                unsigned char : 6;
            }
            BIT;
        }
        SPSCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPSS : 2;
                unsigned char : 6;
            }
            BIT;
        }
        SPSSR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPBR0 : 1;
                unsigned char SPBR1 : 1;
                unsigned char SPBR2 : 1;
                unsigned char SPBR3 : 1;
                unsigned char SPBR4 : 1;
                unsigned char SPBR5 : 1;
                unsigned char SPBR6 : 1;
                unsigned char SPBR7 : 1;
            }
            BIT;
        }
        SPBR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char TXDMY : 1;
            }
            BIT;
        }
        SPDCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SCKDL : 3;
                unsigned char : 5;
            }
            BIT;
        }
        SPCKD;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SLNDL : 3;
                unsigned char : 5;
            }
            BIT;
        }
        SSLND;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPNDL : 3;
                unsigned char : 5;
            }
            BIT;
        }
        SPND;
        char wk0[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CPHA : 1;
                unsigned short CPOL : 1;
                unsigned short BRDV : 2;
                unsigned short SPRW : 1;
                unsigned short SPIMOD : 2;
                unsigned short SSLKP : 1;
                unsigned short SPB : 4;
                unsigned short LSBF : 1;
                unsigned short SPNDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SCKDEN : 1;
            }
            BIT;
        }
        SPCMD0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CPHA : 1;
                unsigned short CPOL : 1;
                unsigned short BRDV : 2;
                unsigned short SPRW : 1;
                unsigned short SPIMOD : 2;
                unsigned short SSLKP : 1;
                unsigned short SPB : 4;
                unsigned short LSBF : 1;
                unsigned short SPNDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SCKDEN : 1;
            }
            BIT;
        }
        SPCMD1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CPHA : 1;
                unsigned short CPOL : 1;
                unsigned short BRDV : 2;
                unsigned short SPRW : 1;
                unsigned short SPIMOD : 2;
                unsigned short SSLKP : 1;
                unsigned short SPB : 4;
                unsigned short LSBF : 1;
                unsigned short SPNDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SCKDEN : 1;
            }
            BIT;
        }
        SPCMD2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CPHA : 1;
                unsigned short CPOL : 1;
                unsigned short BRDV : 2;
                unsigned short SPRW : 1;
                unsigned short SPIMOD : 2;
                unsigned short SSLKP : 1;
                unsigned short SPB : 4;
                unsigned short LSBF : 1;
                unsigned short SPNDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SCKDEN : 1;
            }
            BIT;
        }
        SPCMD3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RXTRG : 3;
                unsigned char TXTRGEX : 1;
                unsigned char TXTRG : 2;
                unsigned char RXRST : 1;
                unsigned char TXRST : 1;
            }
            BIT;
        }
        SPBFCR;
        char wk1[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RXBC : 6;
                unsigned short : 2;
                unsigned short TXBC : 6;
                unsigned short : 2;
            }
            BIT;
        }
        SPBDCR;
        union
        {
            unsigned long LONG;
        }
        SPBMUL0;
        union
        {
            unsigned long LONG;
        }
        SPBMUL1;
        union
        {
            unsigned long LONG;
        }
        SPBMUL2;
        union
        {
            unsigned long LONG;
        }
        SPBMUL3;
    };

    struct st_riic0
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SDAI : 1;
                unsigned char SCLI : 1;
                unsigned char SDAO : 1;
                unsigned char SCLO : 1;
                unsigned char SOWP : 1;
                unsigned char CLO : 1;
                unsigned char IICRST : 1;
                unsigned char ICE : 1;
            }
            BIT;
        }
        ICCR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ST : 1;
                unsigned char RS : 1;
                unsigned char SP : 1;
                unsigned char : 1;
                unsigned char TRS : 1;
                unsigned char MST : 1;
                unsigned char BBSY : 1;
            }
            BIT;
        }
        ICCR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BC : 3;
                unsigned char BCWP : 1;
                unsigned char CKS : 3;
                unsigned char MTWP : 1;
            }
            BIT;
        }
        ICMR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOS : 1;
                unsigned char TMOL : 1;
                unsigned char TMOH : 1;
                unsigned char : 1;
                unsigned char SDDL : 3;
                unsigned char DLCS : 1;
            }
            BIT;
        }
        ICMR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NF : 2;
                unsigned char ACKBR : 1;
                unsigned char ACKBT : 1;
                unsigned char ACKWP : 1;
                unsigned char RDRFS : 1;
                unsigned char WAIT : 1;
                unsigned char SMBS : 1;
            }
            BIT;
        }
        ICMR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOE : 1;
                unsigned char MALE : 1;
                unsigned char NALE : 1;
                unsigned char SALE : 1;
                unsigned char NACKE : 1;
                unsigned char NFE : 1;
                unsigned char SCLE : 1;
                unsigned char FMPE : 1;
            }
            BIT;
        }
        ICFER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SAR0E : 1;
                unsigned char SAR1E : 1;
                unsigned char SAR2E : 1;
                unsigned char GCAE : 1;
                unsigned char : 1;
                unsigned char DIDE : 1;
                unsigned char : 1;
                unsigned char HOAE : 1;
            }
            BIT;
        }
        ICSER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOIE : 1;
                unsigned char ALIE : 1;
                unsigned char STIE : 1;
                unsigned char SPIE : 1;
                unsigned char NAKIE : 1;
                unsigned char RIE : 1;
                unsigned char TEIE : 1;
                unsigned char TIE : 1;
            }
            BIT;
        }
        ICIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char AAS0 : 1;
                unsigned char AAS1 : 1;
                unsigned char AAS2 : 1;
                unsigned char GCA : 1;
                unsigned char : 1;
                unsigned char DID : 1;
                unsigned char : 1;
                unsigned char HOA : 1;
            }
            BIT;
        }
        ICSR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOF : 1;
                unsigned char AL : 1;
                unsigned char START : 1;
                unsigned char STOP : 1;
                unsigned char NACKF : 1;
                unsigned char RDRF : 1;
                unsigned char TEND : 1;
                unsigned char TDRE : 1;
            }
            BIT;
        }
        ICSR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SVA0 : 1;
                unsigned char SVA : 7;
            }
            BIT;
        }
        SARL0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FS : 1;
                unsigned char SVA : 2;
                unsigned char : 5;
            }
            BIT;
        }
        SARU0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SVA0 : 1;
                unsigned char SVA : 7;
            }
            BIT;
        }
        SARL1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FS : 1;
                unsigned char SVA : 2;
                unsigned char : 5;
            }
            BIT;
        }
        SARU1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SVA0 : 1;
                unsigned char SVA : 7;
            }
            BIT;
        }
        SARL2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FS : 1;
                unsigned char SVA : 2;
                unsigned char : 5;
            }
            BIT;
        }
        SARU2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BRL : 5;
                unsigned char : 3;
            }
            BIT;
        }
        ICBRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BRH : 5;
                unsigned char : 3;
            }
            BIT;
        }
        ICBRH;
        unsigned char ICDRT;
        unsigned char ICDRR;
    };

    struct st_riic2
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SDAI : 1;
                unsigned char SCLI : 1;
                unsigned char SDAO : 1;
                unsigned char SCLO : 1;
                unsigned char SOWP : 1;
                unsigned char CLO : 1;
                unsigned char IICRST : 1;
                unsigned char ICE : 1;
            }
            BIT;
        }
        ICCR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ST : 1;
                unsigned char RS : 1;
                unsigned char SP : 1;
                unsigned char : 1;
                unsigned char TRS : 1;
                unsigned char MST : 1;
                unsigned char BBSY : 1;
            }
            BIT;
        }
        ICCR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BC : 3;
                unsigned char BCWP : 1;
                unsigned char CKS : 3;
                unsigned char MTWP : 1;
            }
            BIT;
        }
        ICMR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOS : 1;
                unsigned char TMOL : 1;
                unsigned char TMOH : 1;
                unsigned char : 1;
                unsigned char SDDL : 3;
                unsigned char DLCS : 1;
            }
            BIT;
        }
        ICMR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NF : 2;
                unsigned char ACKBR : 1;
                unsigned char ACKBT : 1;
                unsigned char ACKWP : 1;
                unsigned char RDRFS : 1;
                unsigned char WAIT : 1;
                unsigned char SMBS : 1;
            }
            BIT;
        }
        ICMR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOE : 1;
                unsigned char MALE : 1;
                unsigned char NALE : 1;
                unsigned char SALE : 1;
                unsigned char NACKE : 1;
                unsigned char NFE : 1;
                unsigned char SCLE : 1;
                unsigned char : 1;
            }
            BIT;
        }
        ICFER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SAR0E : 1;
                unsigned char SAR1E : 1;
                unsigned char SAR2E : 1;
                unsigned char GCAE : 1;
                unsigned char : 1;
                unsigned char DIDE : 1;
                unsigned char : 1;
                unsigned char HOAE : 1;
            }
            BIT;
        }
        ICSER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOIE : 1;
                unsigned char ALIE : 1;
                unsigned char STIE : 1;
                unsigned char SPIE : 1;
                unsigned char NAKIE : 1;
                unsigned char RIE : 1;
                unsigned char TEIE : 1;
                unsigned char TIE : 1;
            }
            BIT;
        }
        ICIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char AAS0 : 1;
                unsigned char AAS1 : 1;
                unsigned char AAS2 : 1;
                unsigned char GCA : 1;
                unsigned char : 1;
                unsigned char DID : 1;
                unsigned char : 1;
                unsigned char HOA : 1;
            }
            BIT;
        }
        ICSR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TMOF : 1;
                unsigned char AL : 1;
                unsigned char START : 1;
                unsigned char STOP : 1;
                unsigned char NACKF : 1;
                unsigned char RDRF : 1;
                unsigned char TEND : 1;
                unsigned char TDRE : 1;
            }
            BIT;
        }
        ICSR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SVA0 : 1;
                unsigned char SVA : 7;
            }
            BIT;
        }
        SARL0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FS : 1;
                unsigned char SVA : 2;
                unsigned char : 5;
            }
            BIT;
        }
        SARU0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SVA0 : 1;
                unsigned char SVA : 7;
            }
            BIT;
        }
        SARL1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FS : 1;
                unsigned char SVA : 2;
                unsigned char : 5;
            }
            BIT;
        }
        SARU1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SVA0 : 1;
                unsigned char SVA : 7;
            }
            BIT;
        }
        SARL2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FS : 1;
                unsigned char SVA : 2;
                unsigned char : 5;
            }
            BIT;
        }
        SARU2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BRL : 5;
                unsigned char : 3;
            }
            BIT;
        }
        ICBRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BRH : 5;
                unsigned char : 3;
            }
            BIT;
        }
        ICBRH;
        unsigned char ICDRT;
        unsigned char ICDRR;
    };

