FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_rtc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char F64HZ : 1;
                unsigned char F32HZ : 1;
                unsigned char F16HZ : 1;
                unsigned char F8HZ : 1;
                unsigned char F4HZ : 1;
                unsigned char F2HZ : 1;
                unsigned char F1HZ : 1;
                unsigned char : 1;
            }
            BIT;
        }
        R64CNT;
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SEC1 : 4;
                unsigned char SEC10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RSECCNT;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MIN1 : 4;
                unsigned char MIN10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RMINCNT;
        char wk2[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char HR1 : 4;
                unsigned char HR10 : 2;
                unsigned char PM : 1;
                unsigned char : 1;
            }
            BIT;
        }
        RHRCNT;
        char wk3[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DAYW : 3;
                unsigned char : 5;
            }
            BIT;
        }
        RWKCNT;
        char wk4[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DATE1 : 4;
                unsigned char DATE10 : 2;
                unsigned char : 2;
            }
            BIT;
        }
        RDAYCNT;
        char wk5[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MON1 : 4;
                unsigned char MON10 : 1;
                unsigned char : 3;
            }
            BIT;
        }
        RMONCNT;
        char wk6[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short YR1 : 4;
                unsigned short YR10 : 4;
                unsigned short : 8;
            }
            BIT;
        }
        RYRCNT;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SEC1 : 4;
                unsigned char SEC10 : 3;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RSECAR;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MIN1 : 4;
                unsigned char MIN10 : 3;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RMINAR;
        char wk8[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char HR1 : 4;
                unsigned char HR10 : 2;
                unsigned char PM : 1;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RHRAR;
        char wk9[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DAYW : 3;
                unsigned char : 4;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RWKAR;
        char wk10[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DATE1 : 4;
                unsigned char DATE10 : 2;
                unsigned char : 1;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RDAYAR;
        char wk11[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MON1 : 4;
                unsigned char MON10 : 1;
                unsigned char : 2;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RMONAR;
        char wk12[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short YR1 : 4;
                unsigned short YR10 : 4;
                unsigned short : 8;
            }
            BIT;
        }
        RYRAR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char ENB : 1;
            }
            BIT;
        }
        RYRAREN;
        char wk13[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char AIE : 1;
                unsigned char CIE : 1;
                unsigned char PIE : 1;
                unsigned char RTCOS : 1;
                unsigned char PES : 4;
            }
            BIT;
        }
        RCR1;
        char wk14[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char START : 1;
                unsigned char RESET : 1;
                unsigned char ADJ30 : 1;
                unsigned char RTCOE : 1;
                unsigned char AADJE : 1;
                unsigned char AADJP : 1;
                unsigned char HR24 : 1;
                unsigned char CNTMD : 1;
            }
            BIT;
        }
        RCR2;
        char wk15[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RTCEN : 1;
                unsigned char RTCDV : 3;
                unsigned char : 4;
            }
            BIT;
        }
        RCR3;
        char wk16[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RCKSEL : 1;
                unsigned char : 7;
            }
            BIT;
        }
        RCR4;
        char wk17[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RFC : 1;
                unsigned short : 15;
            }
            BIT;
        }
        RFRH;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RFC : 16;
            }
            BIT;
        }
        RFRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ADJ : 6;
                unsigned char PMADJ : 2;
            }
            BIT;
        }
        RADJ;
        char wk18[ 17 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TCCT : 2;
                unsigned char TCST : 1;
                unsigned char : 1;
                unsigned char TCNF : 2;
                unsigned char : 1;
                unsigned char TCEN : 1;
            }
            BIT;
        }
        RTCCR0;
        char wk19[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TCCT : 2;
                unsigned char TCST : 1;
                unsigned char : 1;
                unsigned char TCNF : 2;
                unsigned char : 1;
                unsigned char TCEN : 1;
            }
            BIT;
        }
        RTCCR1;
        char wk20[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TCCT : 2;
                unsigned char TCST : 1;
                unsigned char : 1;
                unsigned char TCNF : 2;
                unsigned char : 1;
                unsigned char TCEN : 1;
            }
            BIT;
        }
        RTCCR2;
        char wk21[ 13 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SEC1 : 4;
                unsigned char SEC10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RSECCP0;
        char wk22[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MIN1 : 4;
                unsigned char MIN10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RMINCP0;
        char wk23[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char HR1 : 4;
                unsigned char HR10 : 2;
                unsigned char PM : 1;
                unsigned char : 1;
            }
            BIT;
        }
        RHRCP0;
        char wk24[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DATE1 : 4;
                unsigned char DATE10 : 2;
                unsigned char : 2;
            }
            BIT;
        }
        RDAYCP0;
        char wk25[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MON1 : 4;
                unsigned char MON10 : 1;
                unsigned char : 3;
            }
            BIT;
        }
        RMONCP0;
        char wk26[ 5 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SEC1 : 4;
                unsigned char SEC10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RSECCP1;
        char wk27[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MIN1 : 4;
                unsigned char MIN10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RMINCP1;
        char wk28[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char HR1 : 4;
                unsigned char HR10 : 2;
                unsigned char PM : 1;
                unsigned char : 1;
            }
            BIT;
        }
        RHRCP1;
        char wk29[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DATE1 : 4;
                unsigned char DATE10 : 2;
                unsigned char : 2;
            }
            BIT;
        }
        RDAYCP1;
        char wk30[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MON1 : 4;
                unsigned char MON10 : 1;
                unsigned char : 3;
            }
            BIT;
        }
        RMONCP1;
        char wk31[ 5 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SEC1 : 4;
                unsigned char SEC10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RSECCP2;
        char wk32[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MIN1 : 4;
                unsigned char MIN10 : 3;
                unsigned char : 1;
            }
            BIT;
        }
        RMINCP2;
        char wk33[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char HR1 : 4;
                unsigned char HR10 : 2;
                unsigned char PM : 1;
                unsigned char : 1;
            }
            BIT;
        }
        RHRCP2;
        char wk34[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DATE1 : 4;
                unsigned char DATE10 : 2;
                unsigned char : 2;
            }
            BIT;
        }
        RDAYCP2;
        char wk35[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MON1 : 4;
                unsigned char MON10 : 1;
                unsigned char : 3;
            }
            BIT;
        }
        RMONCP2;
    };

    struct st_rtcb
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT0;
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT1;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT2;
        char wk2[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNT : 8;
            }
            BIT;
        }
        BCNT3;
        char wk3[ 7 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT0AR;
        char wk4[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT1AR;
        char wk5[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT2AR;
        char wk6[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNTAR : 8;
            }
            BIT;
        }
        BCNT3AR;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 8;
            }
            BIT;
        }
        BCNT0AER;
        char wk8[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 8;
            }
            BIT;
        }
        BCNT1AER;
        char wk9[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ENB : 8;
                unsigned short : 8;
            }
            BIT;
        }
        BCNT2AER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ENB : 8;
            }
            BIT;
        }
        BCNT3AER;
        char wk10[ 5 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char START : 1;
                unsigned char RESET : 1;
                unsigned char : 1;
                unsigned char RTCOE : 1;
                unsigned char AADJE : 1;
                unsigned char AADJP : 1;
                unsigned char : 1;
                unsigned char CNTMD : 1;
            }
            BIT;
        }
        BRCR2;
        char wk11[ 45 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT0CP0;
        char wk12[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT1CP0;
        char wk13[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT2CP0;
        char wk14[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP0 : 8;
            }
            BIT;
        }
        BCNT3CP0;
        char wk15[ 7 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT0CP1;
        char wk16[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT1CP1;
        char wk17[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT2CP1;
        char wk18[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP1 : 8;
            }
            BIT;
        }
        BCNT3CP1;
        char wk19[ 7 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT0CP2;
        char wk20[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT1CP2;
        char wk21[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT2CP2;
        char wk22[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCNCP2 : 8;
            }
            BIT;
        }
        BCNT3CP2;
    };

