FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_s12ad
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DBLANS : 5;
                unsigned short : 1;
                unsigned short GBADIE : 1;
                unsigned short DBLE : 1;
                unsigned short EXTRG : 1;
                unsigned short TRGE : 1;
                unsigned short : 2;
                unsigned short ADIE : 1;
                unsigned short ADCS : 2;
                unsigned short ADST : 1;
            }
            BIT;
        }
        ADCSR;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ANSA0 : 16;
            }
            BIT;
        }
        ADANSA0;
        char wk1[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ADS0 : 16;
            }
            BIT;
        }
        ADADS0;
        char wk2[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ADC : 2;
                unsigned char : 5;
                unsigned char AVEE : 1;
            }
            BIT;
        }
        ADADC;
        char wk3[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short ADPRC : 2;
                unsigned short : 2;
                unsigned short ACE : 1;
                unsigned short : 2;
                unsigned short DIAGVAL : 2;
                unsigned short DIAGLD : 1;
                unsigned short DIAGM : 1;
                unsigned short : 3;
                unsigned short ADRFMT : 1;
            }
            BIT;
        }
        ADCER;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRSB : 6;
                unsigned short : 2;
                unsigned short TRSA : 6;
                unsigned short : 2;
            }
            BIT;
        }
        ADSTRGR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TSSAD : 1;
                unsigned short OCSAD : 1;
                unsigned short : 6;
                unsigned short TSS : 1;
                unsigned short OCS : 1;
                unsigned short : 3;
                unsigned short EXSEL : 2;
                unsigned short EXOEN : 1;
            }
            BIT;
        }
        ADEXICR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ANSB0 : 16;
            }
            BIT;
        }
        ADANSB0;
        char wk4[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short AD : 12;
                unsigned short : 4;
            }
            BIT;
        }
        ADDBLDR;
        char wk5[ 4 ];
        union
        {
            unsigned short WORD;
            union
            {
                struct
                {
                    unsigned short AD : 12;
                    unsigned short : 2;
                    unsigned short DIAGST : 2;
                }
                RIGHT;
                struct
                {
                    unsigned short DIAGST : 2;
                    unsigned short : 2;
                    unsigned short AD : 12;
                }
                LEFT;
            }
            BIT;
        }
        ADRD;
        unsigned short ADDR0;
        unsigned short ADDR1;
        unsigned short ADDR2;
        unsigned short ADDR3;
        unsigned short ADDR4;
        unsigned short ADDR5;
        unsigned short ADDR6;
        unsigned short ADDR7;
        char wk6[ 48 ];
        unsigned char ADSSTR0;
        unsigned char ADSSTRL;
        char wk7[ 4 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SSTSH : 8;
                unsigned short SHANS : 3;
                unsigned short : 5;
            }
            BIT;
        }
        ADSHCR;
        char wk8[ 11 ];
        unsigned char ADSSTR1;
        unsigned char ADSSTR2;
        unsigned char ADSSTR3;
        unsigned char ADSSTR4;
        unsigned char ADSSTR5;
        unsigned char ADSSTR6;
        unsigned char ADSSTR7;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ADNDIS : 5;
                unsigned char : 3;
            }
            BIT;
        }
        ADDISCR;
        char wk9[ 5 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short PGS : 1;
                unsigned short GBRSCN : 1;
                unsigned short : 13;
                unsigned short GBRP : 1;
            }
            BIT;
        }
        ADGSPCR;
        char wk10[ 2 ];
        unsigned short ADDBLDRA;
        unsigned short ADDBLDRB;
        char wk11[ 8 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char WCMPE : 1;
                unsigned char CMPIE : 1;
            }
            BIT;
        }
        ADCMPCR;
        char wk12[ 3 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPS0 : 16;
            }
            BIT;
        }
        ADCMPANSR0;
        char wk13[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPL0 : 16;
            }
            BIT;
        }
        ADCMPLR0;
        char wk14[ 2 ];
        unsigned short ADCMPDR0;
        unsigned short ADCMPDR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPF0 : 16;
            }
            BIT;
        }
        ADCMPSR0;
    };

    struct st_s12ad1
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ANSA0 : 16;
            }
            BIT;
        }
        ADANSA0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ANSA1 : 5;
                unsigned short : 11;
            }
            BIT;
        }
        ADANSA1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ADS0 : 16;
            }
            BIT;
        }
        ADADS0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ADS1 : 5;
                unsigned short : 11;
            }
            BIT;
        }
        ADADS1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ADC : 2;
                unsigned char : 5;
                unsigned char AVEE : 1;
            }
            BIT;
        }
        ADADC;
        char wk0[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short ADPRC : 2;
                unsigned short : 2;
                unsigned short ACE : 1;
                unsigned short : 2;
                unsigned short DIAGVAL : 2;
                unsigned short DIAGLD : 1;
                unsigned short DIAGM : 1;
                unsigned short : 3;
                unsigned short ADRFMT : 1;
            }
            BIT;
        }
        ADCER;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRSB : 6;
                unsigned short : 2;
                unsigned short TRSA : 6;
                unsigned short : 2;
            }
            BIT;
        }
        ADSTRGR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TSSAD : 1;
                unsigned short OCSAD : 1;
                unsigned short : 6;
                unsigned short TSS : 1;
                unsigned short OCS : 1;
                unsigned short : 3;
                unsigned short EXSEL : 2;
                unsigned short EXOEN : 1;
            }
            BIT;
        }
        ADEXICR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ANSB0 : 16;
            }
            BIT;
        }
        ADANSB0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short ANSB1 : 5;
                unsigned short : 11;
            }
            BIT;
        }
        ADANSB1;
        unsigned short ADDBLDR;
        unsigned short ADTSDR;
        unsigned short ADOCDR;
        union
        {
            unsigned short WORD;
            union
            {
                struct
                {
                    unsigned short AD : 12;
                    unsigned short : 2;
                    unsigned short DIAGST : 2;
                }
                RIGHT;
                struct
                {
                    unsigned short DIAGST : 2;
                    unsigned short : 2;
                    unsigned short AD : 12;
                }
                LEFT;
            }
            BIT;
        }
        ADRD;
        unsigned short ADDR0;
        unsigned short ADDR1;
        unsigned short ADDR2;
        unsigned short ADDR3;
        unsigned short ADDR4;
        unsigned short ADDR5;
        unsigned short ADDR6;
        unsigned short ADDR7;
        unsigned short ADDR8;
        unsigned short ADDR9;
        unsigned short ADDR10;
        unsigned short ADDR11;
        unsigned short ADDR12;
        unsigned short ADDR13;
        unsigned short ADDR14;
        unsigned short ADDR15;
        unsigned short ADDR16;
        unsigned short ADDR17;
        unsigned short ADDR18;
        unsigned short ADDR19;
        unsigned short ADDR20;
        char wk1[ 22 ];
        unsigned char ADSSTR0;
        unsigned char ADSSTRL;
        char wk2[ 14 ];
        unsigned char ADSSTRT;
        unsigned char ADSSTRO;
        char wk3[ 1 ];
        unsigned char ADSSTR1;
        unsigned char ADSSTR2;
        unsigned char ADSSTR3;
        unsigned char ADSSTR4;
        unsigned char ADSSTR5;
        unsigned char ADSSTR6;
        unsigned char ADSSTR7;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ADNDIS : 5;
                unsigned char : 3;
            }
            BIT;
        }
        ADDISCR;
        char wk4[ 5 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short PGS : 1;
                unsigned short GBRSCN : 1;
                unsigned short : 13;
                unsigned short GBRP : 1;
            }
            BIT;
        }
        ADGSPCR;
        char wk5[ 2 ];
        unsigned short ADDBLDRA;
        unsigned short ADDBLDRB;
        char wk6[ 8 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char WCMPE : 1;
                unsigned char CMPIE : 1;
            }
            BIT;
        }
        ADCMPCR;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CMPSTS : 1;
                unsigned char CMPSOC : 1;
                unsigned char : 6;
            }
            BIT;
        }
        ADCMPANSER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CMPLTS : 1;
                unsigned char CMPLOC : 1;
                unsigned char : 6;
            }
            BIT;
        }
        ADCMPLER;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPS0 : 16;
            }
            BIT;
        }
        ADCMPANSR0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPS1 : 5;
                unsigned short : 11;
            }
            BIT;
        }
        ADCMPANSR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPL0 : 16;
            }
            BIT;
        }
        ADCMPLR0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPL1 : 5;
                unsigned short : 11;
            }
            BIT;
        }
        ADCMPLR1;
        unsigned short ADCMPDR0;
        unsigned short ADCMPDR1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPF0 : 16;
            }
            BIT;
        }
        ADCMPSR0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short CMPF1 : 5;
                unsigned short : 11;
            }
            BIT;
        }
        ADCMPSR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CMPFTS : 1;
                unsigned char CMPFOC : 1;
                unsigned char : 6;
            }
            BIT;
        }
        ADCMPSER;
    };

    struct st_sci0
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CKS : 2;
                unsigned char MP : 1;
                unsigned char STOP : 1;
                unsigned char PM : 1;
                unsigned char PE : 1;
                unsigned char CHR : 1;
                unsigned char CM : 1;
            }
            BIT;
        }
        SMR;
        unsigned char BRR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CKE : 2;
                unsigned char TEIE : 1;
                unsigned char MPIE : 1;
                unsigned char RE : 1;
                unsigned char TE : 1;
                unsigned char RIE : 1;
                unsigned char TIE : 1;
            }
            BIT;
        }
        SCR;
        unsigned char TDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MPBT : 1;
                unsigned char MPB : 1;
                unsigned char TEND : 1;
                unsigned char PER : 1;
                unsigned char FER : 1;
                unsigned char ORER : 1;
                unsigned char : 2;
            }
            BIT;
        }
        SSR;
        unsigned char RDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SMIF : 1;
                unsigned char : 1;
                unsigned char SINV : 1;
                unsigned char SDIR : 1;
                unsigned char CHR1 : 1;
                unsigned char : 2;
                unsigned char BCP2 : 1;
            }
            BIT;
        }
        SCMR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char ACS0 : 1;
                unsigned char : 1;
                unsigned char BRME : 1;
                unsigned char : 1;
                unsigned char ABCS : 1;
                unsigned char NFEN : 1;
                unsigned char BGDM : 1;
                unsigned char RXDESEL : 1;
            }
            BIT;
        }
        SEMR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFCS : 3;
                unsigned char : 5;
            }
            BIT;
        }
        SNFR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IICM : 1;
                unsigned char : 2;
                unsigned char IICDL : 5;
            }
            BIT;
        }
        SIMR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IICINTM : 1;
                unsigned char IICCSC : 1;
                unsigned char : 3;
                unsigned char IICACKT : 1;
                unsigned char : 2;
            }
            BIT;
        }
        SIMR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IICSTAREQ : 1;
                unsigned char IICRSTAREQ : 1;
                unsigned char IICSTPREQ : 1;
                unsigned char IICSTIF : 1;
                unsigned char IICSDAS : 2;
                unsigned char IICSCLS : 2;
            }
            BIT;
        }
        SIMR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IICACKR : 1;
                unsigned char : 7;
            }
            BIT;
        }
        SISR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SSE : 1;
                unsigned char CTSE : 1;
                unsigned char MSS : 1;
                unsigned char : 1;
                unsigned char MFF : 1;
                unsigned char : 1;
                unsigned char CKPOL : 1;
                unsigned char CKPH : 1;
            }
            BIT;
        }
        SPMR;
        unsigned char TDRH;
        unsigned char TDRL;
        unsigned char RDRH;
        unsigned char RDRL;
        unsigned char MDDR;
    };

