FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_tpu3
    {
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFAEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFDEN : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR;
        char wk1[ 52 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 3;
                unsigned char CKEG : 2;
                unsigned char CCLR : 3;
            }
            BIT;
        }
        TCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MD : 4;
                unsigned char BFA : 1;
                unsigned char BFB : 1;
                unsigned char ICSELB : 1;
                unsigned char ICSELD : 1;
            }
            BIT;
        }
        TMDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOA : 4;
                unsigned char IOB : 4;
            }
            BIT;
        }
        TIORH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOC : 4;
                unsigned char IOD : 4;
            }
            BIT;
        }
        TIORL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIEA : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIED : 1;
                unsigned char TCIEV : 1;
                unsigned char TCIEU : 1;
                unsigned char : 1;
                unsigned char TTGE : 1;
            }
            BIT;
        }
        TIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGFA : 1;
                unsigned char TGFB : 1;
                unsigned char TGFC : 1;
                unsigned char TGFD : 1;
                unsigned char TCFV : 1;
                unsigned char TCFU : 1;
                unsigned char : 1;
                unsigned char TCFD : 1;
            }
            BIT;
        }
        TSR;
        unsigned short TCNT;
        unsigned short TGRA;
        unsigned short TGRB;
        unsigned short TGRC;
        unsigned short TGRD;
    };

    struct st_tpu4
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFAEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFDEN : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR;
        char wk0[ 67 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 3;
                unsigned char CKEG : 2;
                unsigned char CCLR : 3;
            }
            BIT;
        }
        TCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MD : 4;
                unsigned char BFA : 1;
                unsigned char BFB : 1;
                unsigned char ICSELB : 1;
                unsigned char ICSELD : 1;
            }
            BIT;
        }
        TMDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOA : 4;
                unsigned char IOB : 4;
            }
            BIT;
        }
        TIOR;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIEA : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIED : 1;
                unsigned char TCIEV : 1;
                unsigned char TCIEU : 1;
                unsigned char : 1;
                unsigned char TTGE : 1;
            }
            BIT;
        }
        TIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGFA : 1;
                unsigned char TGFB : 1;
                unsigned char TGFC : 1;
                unsigned char TGFD : 1;
                unsigned char TCFV : 1;
                unsigned char TCFU : 1;
                unsigned char : 1;
                unsigned char TCFD : 1;
            }
            BIT;
        }
        TSR;
        unsigned short TCNT;
        unsigned short TGRA;
        unsigned short TGRB;
    };

    struct st_tpu5
    {
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NFAEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFDEN : 1;
                unsigned char NFCS : 2;
                unsigned char : 2;
            }
            BIT;
        }
        NFCR;
        char wk1[ 82 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TPSC : 3;
                unsigned char CKEG : 2;
                unsigned char CCLR : 3;
            }
            BIT;
        }
        TCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MD : 4;
                unsigned char BFA : 1;
                unsigned char BFB : 1;
                unsigned char ICSELB : 1;
                unsigned char ICSELD : 1;
            }
            BIT;
        }
        TMDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOA : 4;
                unsigned char IOB : 4;
            }
            BIT;
        }
        TIOR;
        char wk2[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGIEA : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIED : 1;
                unsigned char TCIEV : 1;
                unsigned char TCIEU : 1;
                unsigned char : 1;
                unsigned char TTGE : 1;
            }
            BIT;
        }
        TIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TGFA : 1;
                unsigned char TGFB : 1;
                unsigned char TGFC : 1;
                unsigned char TGFD : 1;
                unsigned char TCFV : 1;
                unsigned char TCFU : 1;
                unsigned char : 1;
                unsigned char TCFD : 1;
            }
            BIT;
        }
        TSR;
        unsigned short TCNT;
        unsigned short TGRA;
        unsigned short TGRB;
    };

