FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_gpt
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char : 4;
                unsigned char CST3 : 1;
                unsigned char CST2 : 1;
                unsigned char CST1 : 1;
                unsigned char CST0 : 1;
            }
            BIT;
        }
        GTSTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short NFCS3 : 2;
                unsigned short NFCS2 : 2;
                unsigned short NFCS1 : 2;
                unsigned short NFCS0 : 2;
                unsigned short NFB3EN : 1;
                unsigned short NFA3EN : 1;
                unsigned short NFB2EN : 1;
                unsigned short NFA2EN : 1;
                unsigned short NFB1EN : 1;
                unsigned short NFA1EN : 1;
                unsigned short NFB0EN : 1;
                unsigned short NFA0EN : 1;
            }
            BIT;
        }
        NFCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char CPHW3 : 2;
                unsigned char CPHW2 : 2;
                unsigned char CPHW1 : 2;
                unsigned char CPHW0 : 2;
                unsigned char CSHW3 : 2;
                unsigned char CSHW2 : 2;
                unsigned char CSHW1 : 2;
                unsigned char CSHW0 : 2;
            }
            BIT;
        }
        GTHSCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char CCSW3 : 1;
                unsigned char CCSW2 : 1;
                unsigned char CCSW1 : 1;
                unsigned char CCSW0 : 1;
                unsigned char CCHW3 : 2;
                unsigned char CCHW2 : 2;
                unsigned char CCHW1 : 2;
                unsigned char CCHW0 : 2;
            }
            BIT;
        }
        GTHCCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char CSHSL3 : 4;
                unsigned char CSHSL2 : 4;
                unsigned char CSHSL1 : 4;
                unsigned char CSHSL0 : 4;
            }
            BIT;
        }
        GTHSSR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char CSHPL3 : 4;
                unsigned char CSHPL2 : 4;
                unsigned char CSHPL1 : 4;
                unsigned char CSHPL0 : 4;
            }
            BIT;
        }
        GTHPSR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char : 4;
                unsigned char WP3 : 1;
                unsigned char WP2 : 1;
                unsigned char WP1 : 1;
                unsigned char WP0 : 1;
            }
            BIT;
        }
        GTWP;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char SYNC3 : 2;
                unsigned char : 2;
                unsigned char SYNC2 : 2;
                unsigned char : 2;
                unsigned char SYNC1 : 2;
                unsigned char : 2;
                unsigned char SYNC0 : 2;
            }
            BIT;
        }
        GTSYNC;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char GTETRGEN : 1;
                unsigned char GTENFCS : 2;
                unsigned char : 3;
                unsigned char ETINF : 1;
                unsigned char ETIPF : 1;
                unsigned char : 6;
                unsigned char ETINEN : 1;
                unsigned char ETIPEN : 1;
            }
            BIT;
        }
        GTETINT;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char BD33 : 1;
                unsigned char BD32 : 1;
                unsigned char BD31 : 1;
                unsigned char BD30 : 1;
                unsigned char BD23 : 1;
                unsigned char BD22 : 1;
                unsigned char BD21 : 1;
                unsigned char BD20 : 1;
                unsigned char BD13 : 1;
                unsigned char BD12 : 1;
                unsigned char BD11 : 1;
                unsigned char BD10 : 1;
                unsigned char BD03 : 1;
                unsigned char BD02 : 1;
                unsigned char BD01 : 1;
                unsigned char BD00 : 1;
            }
            BIT;
        }
        GTBDR;
        char wk1[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char : 4;
                unsigned char SWP3 : 1;
                unsigned char SWP2 : 1;
                unsigned char SWP1 : 1;
                unsigned char SWP0 : 1;
            }
            BIT;
        }
        GTSWP;
    };

    struct st_gpt0
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char OBHLD : 1;
                unsigned char OBDFLT : 1;
                unsigned char GTIOB : 6;
                unsigned char OAHLD : 1;
                unsigned char OADFLT : 1;
                unsigned char GTIOA : 6;
            }
            BIT;
        }
        GTIOR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char ADTRBDEN : 1;
                unsigned char ADTRBUEN : 1;
                unsigned char ADTRADEN : 1;
                unsigned char ADTRAUEN : 1;
                unsigned char EINT : 1;
                unsigned char : 3;
                unsigned char GTINTPR : 2;
                unsigned char GTINTF : 1;
                unsigned char GTINTE : 1;
                unsigned char GTINTD : 1;
                unsigned char GTINTC : 1;
                unsigned char GTINTB : 1;
                unsigned char GTINTA : 1;
            }
            BIT;
        }
        GTINTAD;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char CCLR : 2;
                unsigned char : 2;
                unsigned char TPCS : 2;
                unsigned char : 5;
                unsigned char MD : 3;
            }
            BIT;
        }
        GTCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ADTDB : 1;
                unsigned char ADTTB : 2;
                unsigned char : 1;
                unsigned char ADTDA : 1;
                unsigned char ADTTA : 2;
                unsigned char : 1;
                unsigned char CCRSWT : 1;
                unsigned char PR : 2;
                unsigned char CCRB : 2;
                unsigned char CCRA : 2;
            }
            BIT;
        }
        GTBER;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 8;
                unsigned char : 6;
                unsigned char UDF : 1;
                unsigned char UD : 1;
            }
            BIT;
        }
        GTUDC;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ADTBL : 1;
                unsigned char : 1;
                unsigned char ADTAL : 1;
                unsigned char : 1;
                unsigned char IVTT : 3;
                unsigned char IVTC : 2;
                unsigned char ITLF : 1;
                unsigned char ITLE : 1;
                unsigned char ITLD : 1;
                unsigned char ITLC : 1;
                unsigned char ITLB : 1;
                unsigned char ITLA : 1;
            }
            BIT;
        }
        GTITC;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned char H;
                unsigned char L;
            }
            BYTE;
            struct
            {
                unsigned char TUCF : 1;
                unsigned char : 3;
                unsigned char DTEF : 1;
                unsigned char ITCNT : 3;
                unsigned char TCFPU : 1;
                unsigned char TCFPO : 1;
                unsigned char TCFF : 1;
                unsigned char TCFE : 1;
                unsigned char TCFD : 1;
                unsigned char TCFC : 1;
                unsigned char TCFB : 1;
                unsigned char TCFA : 1;
            }
            BIT;
        }
        GTST;
        unsigned short GTCNT;
        unsigned short GTCCRA;
        unsigned short GTCCRB;
        unsigned short GTCCRC;
        unsigned short GTCCRD;
        unsigned short GTCCRE;
        unsigned short GTCCRF;
        unsigned short GTPR;
        unsigned short GTPBR;
        unsigned short GTPDBR;
        char wk0[ 2 ];
        unsigned short GTADTRA;
        unsigned short GTADTBRA;
        unsigned short GTADTDBRA;
        char wk1[ 2 ];
        unsigned short GTADTRB;
        unsigned short GTADTBRB;
        unsigned short GTADTDBRB;
        char wk2[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OBE : 1;
                unsigned short OAE : 1;
                unsigned short : 1;
                unsigned short SWN : 1;
                unsigned short : 3;
                unsigned short NFV : 1;
                unsigned short NFS : 4;
                unsigned short NVB : 1;
                unsigned short NVA : 1;
                unsigned short NEB : 1;
                unsigned short NEA : 1;
            }
            BIT;
        }
        GTONCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 7;
                unsigned short TDFER : 1;
                unsigned short : 2;
                unsigned short TDBDE : 1;
                unsigned short TDBUE : 1;
                unsigned short : 3;
                unsigned short TDE : 1;
            }
            BIT;
        }
        GTDTCR;
        unsigned short GTDVU;
        unsigned short GTDVD;
        unsigned short GTDBU;
        unsigned short GTDBD;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 14;
                unsigned short SOS : 2;
            }
            BIT;
        }
        GTSOS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 15;
                unsigned short SOTR : 1;
            }
            BIT;
        }
        GTSOTR;
    };

