FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_icu
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char IR : 1;
            }
            BIT;
        }
        IR[ 256 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char DTCE : 1;
            }
            BIT;
        }
        DTCER[ 256 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IEN7 : 1;
                unsigned char IEN6 : 1;
                unsigned char IEN5 : 1;
                unsigned char IEN4 : 1;
                unsigned char IEN3 : 1;
                unsigned char IEN2 : 1;
                unsigned char IEN1 : 1;
                unsigned char IEN0 : 1;
            }
            BIT;
        }
        IER[ 32 ];
        char wk0[ 192 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char SWINT : 1;
            }
            BIT;
        }
        SWINTR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char SWINT2 : 1;
            }
            BIT;
        }
        SWINT2R;
        char wk1[ 14 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short FIEN : 1;
                unsigned short : 7;
                unsigned short FVCT : 8;
            }
            BIT;
        }
        FIR;
        char wk2[ 14 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char IPR : 4;
            }
            BIT;
        }
        IPR[ 256 ];
        unsigned char DMRSR0;
        char wk3[ 3 ];
        unsigned char DMRSR1;
        char wk4[ 3 ];
        unsigned char DMRSR2;
        char wk5[ 3 ];
        unsigned char DMRSR3;
        char wk6[ 3 ];
        unsigned char DMRSR4;
        char wk7[ 3 ];
        unsigned char DMRSR5;
        char wk8[ 3 ];
        unsigned char DMRSR6;
        char wk9[ 3 ];
        unsigned char DMRSR7;
        char wk10[ 227 ];
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR0; */
/*    char           wk3[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR1; */
/*    char           wk4[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR2; */
/*    char           wk5[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR3; */
/*    char           wk6[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR4; */
/*    char           wk7[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR5; */
/*    char           wk8[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR6; */
/*    char           wk9[3]; */
/*    union { */
/*        unsigned char BYTE; */
/*        struct { */
/*            unsigned char DMRS:8; */
/*        } BIT; */
/*    } DMRSR7; */
/*    char           wk10[227]; */
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char IRQMD : 2;
            }
            BIT;
        }
        IRQCR[ 16 ];
        char wk11[ 16 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FLTEN7 : 1;
                unsigned char FLTEN6 : 1;
                unsigned char FLTEN5 : 1;
                unsigned char FLTEN4 : 1;
                unsigned char FLTEN3 : 1;
                unsigned char FLTEN2 : 1;
                unsigned char FLTEN1 : 1;
                unsigned char FLTEN0 : 1;
            }
            BIT;
        }
        IRQFLTE0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char FLTEN15 : 1;
                unsigned char FLTEN14 : 1;
                unsigned char FLTEN13 : 1;
                unsigned char FLTEN12 : 1;
                unsigned char FLTEN11 : 1;
                unsigned char FLTEN10 : 1;
                unsigned char FLTEN9 : 1;
                unsigned char FLTEN8 : 1;
            }
            BIT;
        }
        IRQFLTE1;
        char wk12[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short FCLKSEL7 : 2;
                unsigned short FCLKSEL6 : 2;
                unsigned short FCLKSEL5 : 2;
                unsigned short FCLKSEL4 : 2;
                unsigned short FCLKSEL3 : 2;
                unsigned short FCLKSEL2 : 2;
                unsigned short FCLKSEL1 : 2;
                unsigned short FCLKSEL0 : 2;
            }
            BIT;
        }
        IRQFLTC0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short FCLKSEL15 : 2;
                unsigned short FCLKSEL14 : 2;
                unsigned short FCLKSEL13 : 2;
                unsigned short FCLKSEL12 : 2;
                unsigned short FCLKSEL11 : 2;
                unsigned short FCLKSEL10 : 2;
                unsigned short FCLKSEL9 : 2;
                unsigned short FCLKSEL8 : 2;
            }
            BIT;
        }
        IRQFLTC1;
        char wk13[ 84 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ECCRAMST : 1;
                unsigned char LVD2ST : 1;
                unsigned char LVD1ST : 1;
                unsigned char IWDTST : 1;
                unsigned char WDTST : 1;
                unsigned char OSTST : 1;
                unsigned char NMIST : 1;
            }
            BIT;
        }
        NMISR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ECCRAMEN : 1;
                unsigned char LVD2EN : 1;
                unsigned char LVD1EN : 1;
                unsigned char IWDTEN : 1;
                unsigned char WDTEN : 1;
                unsigned char OSTEN : 1;
                unsigned char NMIEN : 1;
            }
            BIT;
        }
        NMIER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char ECCRAMCLR : 1;
                unsigned char LVD2CLR : 1;
                unsigned char LVD1CLR : 1;
                unsigned char IWDTCLR : 1;
                unsigned char WDTCLR : 1;
                unsigned char OSTCLR : 1;
                unsigned char NMICLR : 1;
            }
            BIT;
        }
        NMICLR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char NMIMD : 1;
            }
            BIT;
        }
        NMICR;
        char wk14[ 12 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char NFLTEN : 1;
            }
            BIT;
        }
        NMIFLTE;
        char wk15[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char NFCLKSEL : 2;
            }
            BIT;
        }
        NMIFLTC;
        char wk16[ 107 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long IS31 : 1;
                unsigned long IS30 : 1;
                unsigned long IS29 : 1;
                unsigned long IS28 : 1;
                unsigned long IS27 : 1;
                unsigned long IS26 : 1;
                unsigned long IS25 : 1;
                unsigned long IS24 : 1;
                unsigned long IS23 : 1;
                unsigned long IS22 : 1;
                unsigned long IS21 : 1;
                unsigned long IS20 : 1;
                unsigned long IS19 : 1;
                unsigned long IS18 : 1;
                unsigned long IS17 : 1;
                unsigned long IS16 : 1;
                unsigned long IS15 : 1;
                unsigned long IS14 : 1;
                unsigned long IS13 : 1;
                unsigned long IS12 : 1;
                unsigned long IS11 : 1;
                unsigned long IS10 : 1;
                unsigned long IS9 : 1;
                unsigned long IS8 : 1;
                unsigned long IS7 : 1;
                unsigned long IS6 : 1;
                unsigned long IS5 : 1;
                unsigned long IS4 : 1;
                unsigned long IS3 : 1;
                unsigned long IS2 : 1;
                unsigned long IS1 : 1;
                unsigned long IS0 : 1;
            }
            BIT;
        }
        GRPBE0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long IS31 : 1;
                unsigned long IS30 : 1;
                unsigned long IS29 : 1;
                unsigned long IS28 : 1;
                unsigned long IS27 : 1;
                unsigned long IS26 : 1;
                unsigned long IS25 : 1;
                unsigned long IS24 : 1;
                unsigned long IS23 : 1;
                unsigned long IS22 : 1;
                unsigned long IS21 : 1;
                unsigned long IS20 : 1;
                unsigned long IS19 : 1;
                unsigned long IS18 : 1;
                unsigned long IS17 : 1;
                unsigned long IS16 : 1;
                unsigned long IS15 : 1;
                unsigned long IS14 : 1;
                unsigned long IS13 : 1;
                unsigned long IS12 : 1;
                unsigned long IS11 : 1;
                unsigned long IS10 : 1;
                unsigned long IS9 : 1;
                unsigned long IS8 : 1;
                unsigned long IS7 : 1;
                unsigned long IS6 : 1;
                unsigned long IS5 : 1;
                unsigned long IS4 : 1;
                unsigned long IS3 : 1;
                unsigned long IS2 : 1;
                unsigned long IS1 : 1;
                unsigned long IS0 : 1;
            }
            BIT;
        }
        GRPBE1;
        char wk17[ 40 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long IS31 : 1;
                unsigned long IS30 : 1;
                unsigned long IS29 : 1;
                unsigned long IS28 : 1;
                unsigned long IS27 : 1;
                unsigned long IS26 : 1;
                unsigned long IS25 : 1;
                unsigned long IS24 : 1;
                unsigned long IS23 : 1;
                unsigned long IS22 : 1;
                unsigned long IS21 : 1;
                unsigned long IS20 : 1;
                unsigned long IS19 : 1;
                unsigned long IS18 : 1;
                unsigned long IS17 : 1;
                unsigned long IS16 : 1;
                unsigned long IS15 : 1;
                unsigned long IS14 : 1;
                unsigned long IS13 : 1;
                unsigned long IS12 : 1;
                unsigned long IS11 : 1;
                unsigned long IS10 : 1;
                unsigned long IS9 : 1;
                unsigned long IS8 : 1;
                unsigned long IS7 : 1;
                unsigned long IS6 : 1;
                unsigned long IS5 : 1;
                unsigned long IS4 : 1;
                unsigned long IS3 : 1;
                unsigned long IS2 : 1;
                unsigned long IS1 : 1;
                unsigned long IS0 : 1;
            }
            BIT;
        }
        GRPBL0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long IS31 : 1;
                unsigned long IS30 : 1;
                unsigned long IS29 : 1;
                unsigned long IS28 : 1;
                unsigned long IS27 : 1;
                unsigned long IS26 : 1;
                unsigned long IS25 : 1;
                unsigned long IS24 : 1;
                unsigned long IS23 : 1;
                unsigned long IS22 : 1;
                unsigned long IS21 : 1;
                unsigned long IS20 : 1;
                unsigned long IS19 : 1;
                unsigned long IS18 : 1;
                unsigned long IS17 : 1;
                unsigned long IS16 : 1;
                unsigned long IS15 : 1;
                unsigned long IS14 : 1;
                unsigned long IS13 : 1;
                unsigned long IS12 : 1;
                unsigned long IS11 : 1;
                unsigned long IS10 : 1;
                unsigned long IS9 : 1;
                unsigned long IS8 : 1;
                unsigned long IS7 : 1;
                unsigned long IS6 : 1;
                unsigned long IS5 : 1;
                unsigned long IS4 : 1;
                unsigned long IS3 : 1;
                unsigned long IS2 : 1;
                unsigned long IS1 : 1;
                unsigned long IS0 : 1;
            }
            BIT;
        }
        GRPBL1;
        char wk18[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EN31 : 1;
                unsigned long EN30 : 1;
                unsigned long EN29 : 1;
                unsigned long EN28 : 1;
                unsigned long EN27 : 1;
                unsigned long EN26 : 1;
                unsigned long EN25 : 1;
                unsigned long EN24 : 1;
                unsigned long EN23 : 1;
                unsigned long EN22 : 1;
                unsigned long EN21 : 1;
                unsigned long EN20 : 1;
                unsigned long EN19 : 1;
                unsigned long EN18 : 1;
                unsigned long EN17 : 1;
                unsigned long EN16 : 1;
                unsigned long EN15 : 1;
                unsigned long EN14 : 1;
                unsigned long EN13 : 1;
                unsigned long EN12 : 1;
                unsigned long EN11 : 1;
                unsigned long EN10 : 1;
                unsigned long EN9 : 1;
                unsigned long EN8 : 1;
                unsigned long EN7 : 1;
                unsigned long EN6 : 1;
                unsigned long EN5 : 1;
                unsigned long EN4 : 1;
                unsigned long EN3 : 1;
                unsigned long EN2 : 1;
                unsigned long EN1 : 1;
                unsigned long EN0 : 1;
            }
            BIT;
        }
        GENBE0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EN31 : 1;
                unsigned long EN30 : 1;
                unsigned long EN29 : 1;
                unsigned long EN28 : 1;
                unsigned long EN27 : 1;
                unsigned long EN26 : 1;
                unsigned long EN25 : 1;
                unsigned long EN24 : 1;
                unsigned long EN23 : 1;
                unsigned long EN22 : 1;
                unsigned long EN21 : 1;
                unsigned long EN20 : 1;
                unsigned long EN19 : 1;
                unsigned long EN18 : 1;
                unsigned long EN17 : 1;
                unsigned long EN16 : 1;
                unsigned long EN15 : 1;
                unsigned long EN14 : 1;
                unsigned long EN13 : 1;
                unsigned long EN12 : 1;
                unsigned long EN11 : 1;
                unsigned long EN10 : 1;
                unsigned long EN9 : 1;
                unsigned long EN8 : 1;
                unsigned long EN7 : 1;
                unsigned long EN6 : 1;
                unsigned long EN5 : 1;
                unsigned long EN4 : 1;
                unsigned long EN3 : 1;
                unsigned long EN2 : 1;
                unsigned long EN1 : 1;
                unsigned long EN0 : 1;
            }
            BIT;
        }
        GENBE1;
        char wk19[ 40 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EN31 : 1;
                unsigned long EN30 : 1;
                unsigned long EN29 : 1;
                unsigned long EN28 : 1;
                unsigned long EN27 : 1;
                unsigned long EN26 : 1;
                unsigned long EN25 : 1;
                unsigned long EN24 : 1;
                unsigned long EN23 : 1;
                unsigned long EN22 : 1;
                unsigned long EN21 : 1;
                unsigned long EN20 : 1;
                unsigned long EN19 : 1;
                unsigned long EN18 : 1;
                unsigned long EN17 : 1;
                unsigned long EN16 : 1;
                unsigned long EN15 : 1;
                unsigned long EN14 : 1;
                unsigned long EN13 : 1;
                unsigned long EN12 : 1;
                unsigned long EN11 : 1;
                unsigned long EN10 : 1;
                unsigned long EN9 : 1;
                unsigned long EN8 : 1;
                unsigned long EN7 : 1;
                unsigned long EN6 : 1;
                unsigned long EN5 : 1;
                unsigned long EN4 : 1;
                unsigned long EN3 : 1;
                unsigned long EN2 : 1;
                unsigned long EN1 : 1;
                unsigned long EN0 : 1;
            }
            BIT;
        }
        GENBL0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long EN31 : 1;
                unsigned long EN30 : 1;
                unsigned long EN29 : 1;
                unsigned long EN28 : 1;
                unsigned long EN27 : 1;
                unsigned long EN26 : 1;
                unsigned long EN25 : 1;
                unsigned long EN24 : 1;
                unsigned long EN23 : 1;
                unsigned long EN22 : 1;
                unsigned long EN21 : 1;
                unsigned long EN20 : 1;
                unsigned long EN19 : 1;
                unsigned long EN18 : 1;
                unsigned long EN17 : 1;
                unsigned long EN16 : 1;
                unsigned long EN15 : 1;
                unsigned long EN14 : 1;
                unsigned long EN13 : 1;
                unsigned long EN12 : 1;
                unsigned long EN11 : 1;
                unsigned long EN10 : 1;
                unsigned long EN9 : 1;
                unsigned long EN8 : 1;
                unsigned long EN7 : 1;
                unsigned long EN6 : 1;
                unsigned long EN5 : 1;
                unsigned long EN4 : 1;
                unsigned long EN3 : 1;
                unsigned long EN2 : 1;
                unsigned long EN1 : 1;
                unsigned long EN0 : 1;
            }
            BIT;
        }
        GENBL1;
        char wk20[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CLR31 : 1;
                unsigned long CLR30 : 1;
                unsigned long CLR29 : 1;
                unsigned long CLR28 : 1;
                unsigned long CLR27 : 1;
                unsigned long CLR26 : 1;
                unsigned long CLR25 : 1;
                unsigned long CLR24 : 1;
                unsigned long CLR23 : 1;
                unsigned long CLR22 : 1;
                unsigned long CLR21 : 1;
                unsigned long CLR20 : 1;
                unsigned long CLR19 : 1;
                unsigned long CLR18 : 1;
                unsigned long CLR17 : 1;
                unsigned long CLR16 : 1;
                unsigned long CLR15 : 1;
                unsigned long CLR14 : 1;
                unsigned long CLR13 : 1;
                unsigned long CLR12 : 1;
                unsigned long CLR11 : 1;
                unsigned long CLR10 : 1;
                unsigned long CLR9 : 1;
                unsigned long CLR8 : 1;
                unsigned long CLR7 : 1;
                unsigned long CLR6 : 1;
                unsigned long CLR5 : 1;
                unsigned long CLR4 : 1;
                unsigned long CLR3 : 1;
                unsigned long CLR2 : 1;
                unsigned long CLR1 : 1;
                unsigned long CLR0 : 1;
            }
            BIT;
        }
        GCREBE0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long CLR31 : 1;
                unsigned long CLR30 : 1;
                unsigned long CLR29 : 1;
                unsigned long CLR28 : 1;
                unsigned long CLR27 : 1;
                unsigned long CLR26 : 1;
                unsigned long CLR25 : 1;
                unsigned long CLR24 : 1;
                unsigned long CLR23 : 1;
                unsigned long CLR22 : 1;
                unsigned long CLR21 : 1;
                unsigned long CLR20 : 1;
                unsigned long CLR19 : 1;
                unsigned long CLR18 : 1;
                unsigned long CLR17 : 1;
                unsigned long CLR16 : 1;
                unsigned long CLR15 : 1;
                unsigned long CLR14 : 1;
                unsigned long CLR13 : 1;
                unsigned long CLR12 : 1;
                unsigned long CLR11 : 1;
                unsigned long CLR10 : 1;
                unsigned long CLR9 : 1;
                unsigned long CLR8 : 1;
                unsigned long CLR7 : 1;
                unsigned long CLR6 : 1;
                unsigned long CLR5 : 1;
                unsigned long CLR4 : 1;
                unsigned long CLR3 : 1;
                unsigned long CLR2 : 1;
                unsigned long CLR1 : 1;
                unsigned long CLR0 : 1;
            }
            BIT;
        }
        GCREBE1;
        char wk21[ 120 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR7 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR0 : 1;
            }
            BIT;
        }
        PIBR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR7 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR0 : 1;
            }
            BIT;
        }
        PIBR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIR7 : 1;
                unsigned char PIR6 : 1;
                unsigned char PIR5 : 1;
                unsigned char PIR4 : 1;
                unsigned char PIR3 : 1;
                unsigned char PIR2 : 1;
                unsigned char PIR1 : 1;
                unsigned char PIR0 : 1;
