FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_mpu
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE1;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE2;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE2;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE3;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE3;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE4;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE4;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE5;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE5;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE6;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE6;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long RSPN : 28;
            }
            BIT;
        }
        RSPAGE7;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long REPN : 28;
                unsigned long UAC : 3;
                unsigned long V : 1;
            }
            BIT;
        }
        REPAGE7;
        char wk0[ 192 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 31;
                unsigned long MPEN : 1;
            }
            BIT;
        }
        MPEN;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 28;
                unsigned long UBAC : 3;
            }
            BIT;
        }
        MPBAC;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 31;
                unsigned long CLR : 1;
            }
            BIT;
        }
        MPECLR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 29;
                unsigned long DRW : 1;
                unsigned long DA : 1;
                unsigned long IA : 1;
            }
            BIT;
        }
        MPESTS;
        char wk1[ 4 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long DEA : 32;
            }
            BIT;
        }
        MPDEA;
        char wk2[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long SA : 32;
            }
            BIT;
        }
        MPSA;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 15;
                unsigned short S : 1;
            }
            BIT;
        }
        MPOPS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 15;
                unsigned short INV : 1;
            }
            BIT;
        }
        MPOPI;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 8;
                unsigned long HITI : 8;
                unsigned long : 12;
                unsigned long UHACI : 3;
            }
            BIT;
        }
        MHITI;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 8;
                unsigned long HITD : 8;
                unsigned long : 12;
                unsigned long UHACD : 3;
            }
            BIT;
        }
        MHITD;
    };

