FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_mtu3
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CCLR : 3;
                unsigned char CKEG : 2;
                unsigned char TPSC : 3;
            }
            BIT;
        }
        TCR;
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char BFB : 1;
                unsigned char BFA : 1;
                unsigned char MD : 4;
            }
            BIT;
        }
        TMDR1;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOB : 4;
                unsigned char IOA : 4;
            }
            BIT;
        }
        TIORH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOD : 4;
                unsigned char IOC : 4;
            }
            BIT;
        }
        TIORL;
        char wk2[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TTGE : 1;
                unsigned char : 2;
                unsigned char TCIEV : 1;
                unsigned char TGIED : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEA : 1;
            }
            BIT;
        }
        TIER;
        char wk3[ 7 ];
        unsigned short TCNT;
        char wk4[ 6 ];
        unsigned short TGRA;
        unsigned short TGRB;
        char wk5[ 8 ];
        unsigned short TGRC;
        unsigned short TGRD;
        char wk6[ 4 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TCFD : 1;
                unsigned char : 2;
                unsigned char TCFV : 1;
                unsigned char TGFD : 1;
                unsigned char TGFC : 1;
                unsigned char TGFB : 1;
                unsigned char TGFA : 1;
            }
            BIT;
        }
        TSR;
        char wk7[ 11 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char TTSB : 1;
                unsigned char TTSA : 1;
            }
            BIT;
        }
        TBTM;
        char wk8[ 19 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char TPSC2 : 3;
            }
            BIT;
        }
        TCR2;
        char wk9[ 37 ];
        unsigned short TGRE;
        char wk10[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char NFCS : 2;
                unsigned char NFDEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFAEN : 1;
            }
            BIT;
        }
        NFCR3;
    };

    struct st_mtu4
    {
        char wk0[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CCLR : 3;
                unsigned char CKEG : 2;
                unsigned char TPSC : 3;
            }
            BIT;
        }
        TCR;
        char wk1[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char BFB : 1;
                unsigned char BFA : 1;
                unsigned char MD : 4;
            }
            BIT;
        }
        TMDR1;
        char wk2[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOB : 4;
                unsigned char IOA : 4;
            }
            BIT;
        }
        TIORH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IOD : 4;
                unsigned char IOC : 4;
            }
            BIT;
        }
        TIORL;
        char wk3[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TTGE : 1;
                unsigned char TTGE2 : 1;
                unsigned char : 1;
                unsigned char TCIEV : 1;
                unsigned char TGIED : 1;
                unsigned char TGIEC : 1;
                unsigned char TGIEB : 1;
                unsigned char TGIEA : 1;
            }
            BIT;
        }
        TIER;
        char wk4[ 8 ];
        unsigned short TCNT;
        char wk5[ 8 ];
        unsigned short TGRA;
        unsigned short TGRB;
        char wk6[ 8 ];
        unsigned short TGRC;
        unsigned short TGRD;
        char wk7[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TCFD : 1;
                unsigned char : 2;
                unsigned char TCFV : 1;
                unsigned char TGFD : 1;
                unsigned char TGFC : 1;
                unsigned char TGFB : 1;
                unsigned char TGFA : 1;
            }
            BIT;
        }
        TSR;
        char wk8[ 11 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char TTSB : 1;
                unsigned char TTSA : 1;
            }
            BIT;
        }
        TBTM;
        char wk9[ 6 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BF : 2;
                unsigned short : 6;
                unsigned short UT4AE : 1;
                unsigned short DT4AE : 1;
                unsigned short UT4BE : 1;
                unsigned short DT4BE : 1;
                unsigned short ITA3AE : 1;
                unsigned short ITA4VE : 1;
                unsigned short ITB3AE : 1;
                unsigned short ITB4VE : 1;
            }
            BIT;
        }
        TADCR;
        char wk10[ 2 ];
        unsigned short TADCORA;
        unsigned short TADCORB;
        unsigned short TADCOBRA;
        unsigned short TADCOBRB;
        char wk11[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char TPSC2 : 3;
            }
            BIT;
        }
        TCR2;
        char wk12[ 38 ];
        unsigned short TGRE;
        unsigned short TGRF;
        char wk13[ 28 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char NFCS : 2;
                unsigned char NFDEN : 1;
                unsigned char NFCEN : 1;
                unsigned char NFBEN : 1;
                unsigned char NFAEN : 1;
            }
            BIT;
        }
        NFCR4;
    };

