FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_port0
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char : 1;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char : 1;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char : 1;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char : 1;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 3;
                unsigned char B2 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 62 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char : 1;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
        char wk5[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        DSCR;
    };

    struct st_port1
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 32 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 61 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
    };

