FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_portb
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 42 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 51 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
        char wk5[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        DSCR;
    };

    struct st_portc
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 43 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 50 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
        char wk5[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        DSCR;
    };

    struct st_portd
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 44 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 49 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
        char wk5[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        DSCR;
    };

    struct st_porte
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 45 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 48 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
        char wk5[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        DSCR;
    };

    struct st_portf
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 46 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 47 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
    };

    struct st_portg
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 47 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
                unsigned char : 1;
                unsigned char B4 : 1;
                unsigned char : 1;
                unsigned char B2 : 1;
                unsigned char : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 46 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char B7 : 1;
                unsigned char B6 : 1;
                unsigned char B5 : 1;
                unsigned char B4 : 1;
                unsigned char B3 : 1;
                unsigned char B2 : 1;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        PCR;
        char wk5[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char B1 : 1;
                unsigned char B0 : 1;
            }
            BIT;
        }
        DSCR;
    };

    struct st_portj
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
            }
            BIT;
        }
        PDR;
        char wk0[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
            }
            BIT;
        }
        PODR;
        char wk1[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
            }
            BIT;
        }
        PIDR;
        char wk2[ 31 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
            }
            BIT;
        }
        PMR;
        char wk3[ 49 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char B6 : 1;
            }
            BIT;
        }
        ODR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char B2 : 1;
            }
            BIT;
        }
        ODR1;
        char wk4[ 44 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char B5 : 1;
                unsigned char : 1;
                unsigned char B3 : 1;
            }
            BIT;
        }
        PCR;
    };

