FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_ppg0
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G3CMS : 2;
                unsigned char G2CMS : 2;
                unsigned char G1CMS : 2;
                unsigned char G0CMS : 2;
            }
            BIT;
        }
        PCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G3INV : 1;
                unsigned char G2INV : 1;
                unsigned char G1INV : 1;
                unsigned char G0INV : 1;
                unsigned char G3NOV : 1;
                unsigned char G2NOV : 1;
                unsigned char G1NOV : 1;
                unsigned char G0NOV : 1;
            }
            BIT;
        }
        PMR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDER15 : 1;
                unsigned char NDER14 : 1;
                unsigned char NDER13 : 1;
                unsigned char NDER12 : 1;
                unsigned char NDER11 : 1;
                unsigned char NDER10 : 1;
                unsigned char NDER9 : 1;
                unsigned char NDER8 : 1;
            }
            BIT;
        }
        NDERH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDER7 : 1;
                unsigned char NDER6 : 1;
                unsigned char NDER5 : 1;
                unsigned char NDER4 : 1;
                unsigned char NDER3 : 1;
                unsigned char NDER2 : 1;
                unsigned char NDER1 : 1;
                unsigned char NDER0 : 1;
            }
            BIT;
        }
        NDERL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char POD15 : 1;
                unsigned char POD14 : 1;
                unsigned char POD13 : 1;
                unsigned char POD12 : 1;
                unsigned char POD11 : 1;
                unsigned char POD10 : 1;
                unsigned char POD9 : 1;
                unsigned char POD8 : 1;
            }
            BIT;
        }
        PODRH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char POD7 : 1;
                unsigned char POD6 : 1;
                unsigned char POD5 : 1;
                unsigned char POD4 : 1;
                unsigned char POD3 : 1;
                unsigned char POD2 : 1;
                unsigned char POD1 : 1;
                unsigned char POD0 : 1;
            }
            BIT;
        }
        PODRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDR15 : 1;
                unsigned char NDR14 : 1;
                unsigned char NDR13 : 1;
                unsigned char NDR12 : 1;
                unsigned char NDR11 : 1;
                unsigned char NDR10 : 1;
                unsigned char NDR9 : 1;
                unsigned char NDR8 : 1;
            }
            BIT;
        }
        NDRH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDR7 : 1;
                unsigned char NDR6 : 1;
                unsigned char NDR5 : 1;
                unsigned char NDR4 : 1;
                unsigned char NDR3 : 1;
                unsigned char NDR2 : 1;
                unsigned char NDR1 : 1;
                unsigned char NDR0 : 1;
            }
            BIT;
        }
        NDRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char NDR11 : 1;
                unsigned char NDR10 : 1;
                unsigned char NDR9 : 1;
                unsigned char NDR8 : 1;
            }
            BIT;
        }
        NDRH2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char NDR3 : 1;
                unsigned char NDR2 : 1;
                unsigned char NDR1 : 1;
                unsigned char NDR0 : 1;
            }
            BIT;
        }
        NDRL2;
    };

    struct st_ppg1
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char PTRSL : 1;
            }
            BIT;
        }
        PTRSLR;
        char wk0[ 5 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G3CMS : 2;
                unsigned char G2CMS : 2;
                unsigned char G1CMS : 2;
                unsigned char G0CMS : 2;
            }
            BIT;
        }
        PCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char G3INV : 1;
                unsigned char G2INV : 1;
                unsigned char G1INV : 1;
                unsigned char G0INV : 1;
                unsigned char G3NOV : 1;
                unsigned char G2NOV : 1;
                unsigned char G1NOV : 1;
                unsigned char G0NOV : 1;
            }
            BIT;
        }
        PMR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDER31 : 1;
                unsigned char NDER30 : 1;
                unsigned char NDER29 : 1;
                unsigned char NDER28 : 1;
                unsigned char NDER27 : 1;
                unsigned char NDER26 : 1;
                unsigned char NDER25 : 1;
                unsigned char NDER24 : 1;
            }
            BIT;
        }
        NDERH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDER23 : 1;
                unsigned char NDER22 : 1;
                unsigned char NDER21 : 1;
                unsigned char NDER20 : 1;
                unsigned char NDER19 : 1;
                unsigned char NDER18 : 1;
                unsigned char NDER17 : 1;
                unsigned char NDER16 : 1;
            }
            BIT;
        }
        NDERL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char POD31 : 1;
                unsigned char POD30 : 1;
                unsigned char POD29 : 1;
                unsigned char POD28 : 1;
                unsigned char POD27 : 1;
                unsigned char POD26 : 1;
                unsigned char POD25 : 1;
                unsigned char POD24 : 1;
            }
            BIT;
        }
        PODRH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char POD23 : 1;
                unsigned char POD22 : 1;
                unsigned char POD21 : 1;
                unsigned char POD20 : 1;
                unsigned char POD19 : 1;
                unsigned char POD18 : 1;
                unsigned char POD17 : 1;
                unsigned char POD16 : 1;
            }
            BIT;
        }
        PODRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDR31 : 1;
                unsigned char NDR30 : 1;
                unsigned char NDR29 : 1;
                unsigned char NDR28 : 1;
                unsigned char NDR27 : 1;
                unsigned char NDR26 : 1;
                unsigned char NDR25 : 1;
                unsigned char NDR24 : 1;
            }
            BIT;
        }
        NDRH;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char NDR23 : 1;
                unsigned char NDR22 : 1;
                unsigned char NDR21 : 1;
                unsigned char NDR20 : 1;
                unsigned char NDR19 : 1;
                unsigned char NDR18 : 1;
                unsigned char NDR17 : 1;
                unsigned char NDR16 : 1;
            }
            BIT;
        }
        NDRL;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char NDR27 : 1;
                unsigned char NDR26 : 1;
                unsigned char NDR25 : 1;
                unsigned char NDR24 : 1;
            }
            BIT;
        }
        NDRH2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char NDR19 : 1;
                unsigned char NDR18 : 1;
                unsigned char NDR17 : 1;
                unsigned char NDR16 : 1;
            }
            BIT;
        }
        NDRL2;
    };

