FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_rspi0
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPRIE : 1;
                unsigned char SPE : 1;
                unsigned char SPTIE : 1;
                unsigned char SPEIE : 1;
                unsigned char MSTR : 1;
                unsigned char MODFEN : 1;
                unsigned char TXMD : 1;
                unsigned char SPMS : 1;
            }
            BIT;
        }
        SPCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char SSL3P : 1;
                unsigned char SSL2P : 1;
                unsigned char SSL1P : 1;
                unsigned char SSL0P : 1;
            }
            BIT;
        }
        SSLP;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char MOIFE : 1;
                unsigned char MOIFV : 1;
                unsigned char : 2;
                unsigned char SPLP2 : 1;
                unsigned char SPLP : 1;
            }
            BIT;
        }
        SPPCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char PERF : 1;
                unsigned char MODF : 1;
                unsigned char IDLNF : 1;
                unsigned char OVRF : 1;
            }
            BIT;
        }
        SPSR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned short H;
            }
            WORD;
        }
        SPDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char SPSLN : 3;
            }
            BIT;
        }
        SPSCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char SPECM : 3;
                unsigned char : 1;
                unsigned char SPCP : 3;
            }
            BIT;
        }
        SPSSR;
        unsigned char SPBR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char SPLW : 1;
                unsigned char SPRDTD : 1;
                unsigned char : 2;
                unsigned char SPFC : 2;
            }
            BIT;
        }
        SPDCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char SCKDL : 3;
            }
            BIT;
        }
        SPCKD;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char SLNDL : 3;
            }
            BIT;
        }
        SSLND;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char SPNDL : 3;
            }
            BIT;
        }
        SPND;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SPTDDL : 3;
                unsigned char SCKASE : 1;
                unsigned char PTE : 1;
                unsigned char SPIIE : 1;
                unsigned char SPOE : 1;
                unsigned char SPPE : 1;
            }
            BIT;
        }
        SPCR2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD3;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD4;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD5;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD6;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SCKDEN : 1;
                unsigned short SLNDEN : 1;
                unsigned short SPNDEN : 1;
                unsigned short LSBF : 1;
                unsigned short SPB : 4;
                unsigned short SSLKP : 1;
                unsigned short SSLA : 3;
                unsigned short BRDV : 2;
                unsigned short CPOL : 1;
                unsigned short CPHA : 1;
            }
            BIT;
        }
        SPCMD7;
    };

