FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_sci12
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CM : 1;
                unsigned char CHR : 1;
                unsigned char PE : 1;
                unsigned char PM : 1;
                unsigned char STOP : 1;
                unsigned char MP : 1;
                unsigned char CKS : 2;
            }
            BIT;
        }
        SMR;
        unsigned char BRR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TIE : 1;
                unsigned char RIE : 1;
                unsigned char TE : 1;
                unsigned char RE : 1;
                unsigned char MPIE : 1;
                unsigned char TEIE : 1;
                unsigned char CKE : 2;
            }
            BIT;
        }
        SCR;
        unsigned char TDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char ORER : 1;
                unsigned char FER : 1;
                unsigned char PER : 1;
                unsigned char TEND : 1;
                unsigned char MPB : 1;
                unsigned char MPBT : 1;
            }
            BIT;
        }
        SSR;
        unsigned char RDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCP2 : 1;
                unsigned char : 2;
                unsigned char CHR1 : 1;
                unsigned char SDIR : 1;
                unsigned char SINV : 1;
                unsigned char : 1;
                unsigned char SMIF : 1;
            }
            BIT;
        }
        SCMR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RXDESEL : 1;
                unsigned char BGDM : 1;
                unsigned char NFEN : 1;
                unsigned char ABCS : 1;
                unsigned char : 1;
                unsigned char BRME : 1;
                unsigned char : 1;
                unsigned char ACS0 : 1;
            }
            BIT;
        }
        SEMR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char NFCS : 3;
            }
            BIT;
        }
        SNFR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IICDL : 5;
                unsigned char : 2;
                unsigned char IICM : 1;
            }
            BIT;
        }
        SIMR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char IICACKT : 1;
                unsigned char : 3;
                unsigned char IICCSC : 1;
                unsigned char IICINTM : 1;
            }
            BIT;
        }
        SIMR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char IICSCLS : 2;
                unsigned char IICSDAS : 2;
                unsigned char IICSTIF : 1;
                unsigned char IICSTPREQ : 1;
                unsigned char IICRSTAREQ : 1;
                unsigned char IICSTAREQ : 1;
            }
            BIT;
        }
        SIMR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char IICACKR : 1;
            }
            BIT;
        }
        SISR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CKPH : 1;
                unsigned char CKPOL : 1;
                unsigned char : 1;
                unsigned char MFF : 1;
                unsigned char : 1;
                unsigned char MSS : 1;
                unsigned char CTSE : 1;
                unsigned char SSE : 1;
            }
            BIT;
        }
        SPMR;
        unsigned char TDRH;
        unsigned char TDRL;
        unsigned char RDRH;
        unsigned char RDRL;
        unsigned char MDDR;
        char wk0[ 13 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char ESME : 1;
            }
            BIT;
        }
        ESMER;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 4;
                unsigned char BRME : 1;
                unsigned char RXDSF : 1;
                unsigned char SFSF : 1;
            }
            BIT;
        }
        CR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char PIBS : 3;
                unsigned char PIBE : 1;
                unsigned char CF1DS : 2;
                unsigned char CF0RE : 1;
                unsigned char BFE : 1;
            }
            BIT;
        }
        CR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RTS : 2;
                unsigned char BCCS : 2;
                unsigned char : 1;
                unsigned char DFCS : 3;
            }
            BIT;
        }
        CR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char SDST : 1;
            }
            BIT;
        }
        CR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 3;
                unsigned char SHARPS : 1;
                unsigned char : 2;
                unsigned char RXDXPS : 1;
                unsigned char TXDXPS : 1;
            }
            BIT;
        }
        PCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char AEDIE : 1;
                unsigned char BCDIE : 1;
                unsigned char PIBDIE : 1;
                unsigned char CF1MIE : 1;
                unsigned char CF0MIE : 1;
                unsigned char BFDIE : 1;
            }
            BIT;
        }
        ICR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char AEDF : 1;
                unsigned char BCDF : 1;
                unsigned char PIBDF : 1;
                unsigned char CF1MF : 1;
                unsigned char CF0MF : 1;
                unsigned char BFDF : 1;
            }
            BIT;
        }
        STR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char AEDCL : 1;
                unsigned char BCDCL : 1;
                unsigned char PIBDCL : 1;
                unsigned char CF1MCL : 1;
                unsigned char CF0MCL : 1;
                unsigned char BFDCL : 1;
            }
            BIT;
        }
        STCR;
        unsigned char CF0DR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CF0CE7 : 1;
                unsigned char CF0CE6 : 1;
                unsigned char CF0CE5 : 1;
                unsigned char CF0CE4 : 1;
                unsigned char CF0CE3 : 1;
                unsigned char CF0CE2 : 1;
                unsigned char CF0CE1 : 1;
                unsigned char CF0CE0 : 1;
            }
            BIT;
        }
        CF0CR;
        unsigned char CF0RR;
        unsigned char PCF1DR;
        unsigned char SCF1DR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char CF1CE7 : 1;
                unsigned char CF1CE6 : 1;
                unsigned char CF1CE5 : 1;
                unsigned char CF1CE4 : 1;
                unsigned char CF1CE3 : 1;
                unsigned char CF1CE2 : 1;
                unsigned char CF1CE1 : 1;
                unsigned char CF1CE0 : 1;
            }
            BIT;
        }
        CF1CR;
        unsigned char CF1RR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char TCST : 1;
            }
            BIT;
        }
        TCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char TCSS : 3;
                unsigned char TWRC : 1;
                unsigned char : 1;
                unsigned char TOMS : 2;
            }
            BIT;
        }
        TMR;
        unsigned char TPRE;
        unsigned char TCNT;
    };

    struct st_scif
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short CM : 1;
                unsigned short CHR : 1;
                unsigned short PE : 1;
                unsigned short PM : 1;
                unsigned short STOP : 1;
                unsigned short : 1;
                unsigned short CKS : 2;
            }
            BIT;
        }
        SMR;
/*    unsigned char  BRR; */
        union
        {
            unsigned char BRR;
            unsigned char MDDR;
        };
        char wk0[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short TIE : 1;
                unsigned short RIE : 1;
                unsigned short TE : 1;
                unsigned short RE : 1;
                unsigned short REIE : 1;
                unsigned short TEIE : 1;
                unsigned short CKE : 2;
            }
            BIT;
        }
        SCR;
        unsigned char FTDR;
        char wk1[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short ER : 1;
                unsigned short TEND : 1;
                unsigned short TDFE : 1;
                unsigned short BRK : 1;
                unsigned short FER : 1;
                unsigned short PER : 1;
                unsigned short RDF : 1;
                unsigned short DR : 1;
            }
            BIT;
        }
        FSR;
        unsigned char FRDR;
        char wk2[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 5;
                unsigned short RSTRG : 3;
                unsigned short RTRG : 2;
                unsigned short TTRG : 2;
                unsigned short MCE : 1;
                unsigned short TFRST : 1;
                unsigned short RFRST : 1;
                unsigned short LOOP : 1;
            }
            BIT;
        }
        FCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 3;
                unsigned short T : 5;
                unsigned short : 3;
                unsigned short R : 5;
            }
            BIT;
        }
        FDR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short RTS2IO : 1;
                unsigned short RTS2DT : 1;
                unsigned short CTS2IO : 1;
                unsigned short CTS2DT : 1;
                unsigned short SCKIO : 1;
                unsigned short SCKDT : 1;
                unsigned short SPB2IO : 1;
                unsigned short SPB2DT : 1;
            }
            BIT;
        }
        SPTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 4;
                unsigned short PER : 4;
                unsigned short : 2;
                unsigned short FER : 4;
                unsigned short : 1;
                unsigned short ORER : 1;
            }
            BIT;
        }
        LSR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BGDM : 1;
                unsigned char ACS0 : 1;
                unsigned char BRME : 1;
                unsigned char MDDRS : 1;
                unsigned char DIR : 1;
                unsigned char NFEN : 1;
                unsigned char : 1;
                unsigned char ABCS0 : 1;
            }
            BIT;
        }
        SEMR;
        char wk3[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RTRGS : 1;
                unsigned short : 2;
                unsigned short RFTC : 5;
                unsigned short TTRGS : 1;
                unsigned short : 2;
                unsigned short TFTC : 5;
            }
            BIT;
        }
        FTCR;
    };

    struct st_smci
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char GM : 1;
                unsigned char BLK : 1;
                unsigned char PE : 1;
                unsigned char PM : 1;
                unsigned char BCP : 2;
                unsigned char CKS : 2;
            }
            BIT;
        }
        SMR;
        char wk0[ 3 ];
/*    unsigned char  BRR; */
        union
        {
            unsigned char BRR;
            unsigned char MDDR;
        };
        char wk1[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TIE : 1;
                unsigned char RIE : 1;
                unsigned char TE : 1;
                unsigned char RE : 1;
                unsigned char MPIE : 1;
                unsigned char TEIE : 1;
                unsigned char CKE : 2;
            }
            BIT;
        }
        SCR;
        char wk2[ 3 ];
        unsigned char TDR;
        char wk3[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char ORER : 1;
                unsigned char ERS : 1;
                unsigned char PER : 1;
                unsigned char TEND : 1;
                unsigned char MPB : 1;
                unsigned char MPBT : 1;
            }
            BIT;
        }
        SSR;
        char wk4[ 3 ];
        unsigned char RDR;
        char wk5[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCP2 : 1;
                unsigned char : 2;
                unsigned char CHR1 : 1;
                unsigned char SDIR : 1;
                unsigned char SINV : 1;
                unsigned char : 1;
                unsigned char SMIF : 1;
            }
            BIT;
        }
        SCMR;
        char wk6[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BRME : 1;
                unsigned char MDDRS : 1;
                unsigned char : 1;
                unsigned char ABCS : 1;
                unsigned char : 1;
                unsigned char RSDMOS : 1;
                unsigned char : 1;
                unsigned char ACS0 : 1;
            }
            BIT;
        }
        SEMR;
    };

