FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_smci0
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char GM : 1;
                unsigned char BLK : 1;
                unsigned char PE : 1;
                unsigned char PM : 1;
                unsigned char BCP : 2;
                unsigned char CKS : 2;
            }
            BIT;
        }
        SMR;
        unsigned char BRR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TIE : 1;
                unsigned char RIE : 1;
                unsigned char TE : 1;
                unsigned char RE : 1;
                unsigned char MPIE : 1;
                unsigned char TEIE : 1;
                unsigned char CKE : 2;
            }
            BIT;
        }
        SCR;
        unsigned char TDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char ORER : 1;
                unsigned char ERS : 1;
                unsigned char PER : 1;
                unsigned char TEND : 1;
                unsigned char MPB : 1;
                unsigned char MPBT : 1;
            }
            BIT;
        }
        SSR;
        unsigned char RDR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char BCP2 : 1;
                unsigned char : 2;
                unsigned char CHR1 : 1;
                unsigned char SDIR : 1;
                unsigned char SINV : 1;
                unsigned char : 1;
                unsigned char SMIF : 1;
            }
            BIT;
        }
        SCMR;
    };

    struct st_src
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 10;
                unsigned long SRCFCTR : 22;
            }
            BIT;
        }
        SRCFCTR[ 5552 ];
        char wk0[ 2352 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long B31 : 1;
                unsigned long B30 : 1;
                unsigned long B29 : 1;
                unsigned long B28 : 1;
                unsigned long B27 : 1;
                unsigned long B26 : 1;
                unsigned long B25 : 1;
                unsigned long B24 : 1;
                unsigned long B23 : 1;
                unsigned long B22 : 1;
                unsigned long B21 : 1;
                unsigned long B20 : 1;
                unsigned long B19 : 1;
                unsigned long B18 : 1;
                unsigned long B17 : 1;
                unsigned long B16 : 1;
                unsigned long B15 : 1;
                unsigned long B14 : 1;
                unsigned long B13 : 1;
                unsigned long B12 : 1;
                unsigned long B11 : 1;
                unsigned long B10 : 1;
                unsigned long B9 : 1;
                unsigned long B8 : 1;
                unsigned long B7 : 1;
                unsigned long B6 : 1;
                unsigned long B5 : 1;
                unsigned long B4 : 1;
                unsigned long B3 : 1;
                unsigned long B2 : 1;
                unsigned long B1 : 1;
                unsigned long B0 : 1;
            }
            BIT;
        }
        SRCID;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long B31 : 1;
                unsigned long B30 : 1;
                unsigned long B29 : 1;
                unsigned long B28 : 1;
                unsigned long B27 : 1;
                unsigned long B26 : 1;
                unsigned long B25 : 1;
                unsigned long B24 : 1;
                unsigned long B23 : 1;
                unsigned long B22 : 1;
                unsigned long B21 : 1;
                unsigned long B20 : 1;
                unsigned long B19 : 1;
                unsigned long B18 : 1;
                unsigned long B17 : 1;
                unsigned long B16 : 1;
                unsigned long B15 : 1;
                unsigned long B14 : 1;
                unsigned long B13 : 1;
                unsigned long B12 : 1;
                unsigned long B11 : 1;
                unsigned long B10 : 1;
                unsigned long B9 : 1;
                unsigned long B8 : 1;
                unsigned long B7 : 1;
                unsigned long B6 : 1;
                unsigned long B5 : 1;
                unsigned long B4 : 1;
                unsigned long B3 : 1;
                unsigned long B2 : 1;
                unsigned long B1 : 1;
                unsigned long B0 : 1;
            }
            BIT;
        }
        SRCOD;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short IED : 1;
                unsigned short IEN : 1;
                unsigned short : 6;
                unsigned short IFTRG : 2;
            }
            BIT;
        }
        SRCIDCTRL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 5;
                unsigned short OCH : 1;
                unsigned short OED : 1;
                unsigned short OEN : 1;
                unsigned short : 6;
                unsigned short OFTRG : 2;
            }
            BIT;
        }
        SRCODCTRL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short FICRAE : 1;
                unsigned short : 1;
                unsigned short CEEN : 1;
                unsigned short SRCEN : 1;
                unsigned short UDEN : 1;
                unsigned short OVEN : 1;
                unsigned short FL : 1;
                unsigned short CL : 1;
                unsigned short IFS : 4;
                unsigned short : 1;
                unsigned short OFS : 3;
            }
            BIT;
        }
        SRCCTRL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OFDN : 5;
                unsigned short IFDN : 3;
                unsigned short : 2;
                unsigned short CEF : 1;
                unsigned short FLF : 1;
                unsigned short UDF : 1;
                unsigned short OVF : 1;
                unsigned short IINIT : 1;
                unsigned short OINT : 1;
            }
            BIT;
        }
        SRCSTAT;
    };

    struct st_ssi
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 1;
                unsigned long CKS : 1;
                unsigned long TUIEN : 1;
                unsigned long TOIEN : 1;
                unsigned long RUIEN : 1;
                unsigned long ROIEN : 1;
                unsigned long IIEN : 1;
                unsigned long : 1;
                unsigned long CHNL : 2;
                unsigned long DWL : 3;
                unsigned long SWL : 3;
                unsigned long SCKD : 1;
                unsigned long SWSD : 1;
                unsigned long SCKP : 1;
                unsigned long SWSP : 1;
                unsigned long SPDP : 1;
                unsigned long SDTA : 1;
                unsigned long PDTA : 1;
                unsigned long DEL : 1;
                unsigned long CKDV : 4;
                unsigned long MUEN : 1;
                unsigned long : 1;
                unsigned long TEN : 1;
                unsigned long REN : 1;
            }
            BIT;
        }
        SSICR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 2;
                unsigned long TUIRQ : 1;
                unsigned long TOIRQ : 1;
                unsigned long RUIRQ : 1;
                unsigned long ROIRQ : 1;
                unsigned long IIRQ : 1;
                unsigned long : 18;
                unsigned long TCHNO : 2;
                unsigned long TSWNO : 1;
                unsigned long RCHNO : 2;
                unsigned long RSWNO : 1;
                unsigned long IDST : 1;
            }
            BIT;
        }
        SSISR;
        char wk0[ 8 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long AUCKE : 1;
                unsigned long : 23;
                unsigned long TTRG : 2;
                unsigned long RTRG : 2;
                unsigned long TUE : 1;
                unsigned long RIE : 1;
                unsigned long TFRST : 1;
                unsigned long RFRST : 1;
            }
            BIT;
        }
        SSIFCR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 4;
                unsigned long TDC : 4;
                unsigned long : 7;
                unsigned long TDE : 1;
                unsigned long : 4;
                unsigned long RDC : 4;
                unsigned long : 7;
                unsigned long RDF : 1;
            }
            BIT;
        }
        SSIFSR;
        unsigned long SSIFTDR;
        unsigned long SSIFRDR;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 23;
                unsigned long CONT : 1;
            }
            BIT;
        }
        SSITDMR;
    };

