FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_system
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 15;
                unsigned short MD : 1;
            }
            BIT;
        }
        MDMONR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 10;
                unsigned short UBTS : 1;
            }
            BIT;
        }
        MDSR;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short KEY : 8;
                unsigned short : 6;
                unsigned short EXBE : 1;
                unsigned short ROME : 1;
            }
            BIT;
        }
        SYSCR0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short SBYRAME : 1;
                unsigned short ECCRAME : 1;
                unsigned short : 5;
                unsigned short RAME : 1;
            }
            BIT;
        }
        SYSCR1;
        char wk1[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short SSBY : 1;
                unsigned short OPE : 1;
            }
            BIT;
        }
        SBYCR;
        char wk2[ 2 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long ACSE : 1;
                unsigned long : 1;
                unsigned long MSTPA29 : 1;
                unsigned long MSTPA28 : 1;
                unsigned long MSTPA27 : 1;
                unsigned long : 7;
                unsigned long MSTPA19 : 1;
                unsigned long : 1;
                unsigned long MSTPA17 : 1;
                unsigned long MSTPA16 : 1;
                unsigned long MSTPA15 : 1;
                unsigned long MSTPA14 : 1;
                unsigned long MSTPA13 : 1;
                unsigned long : 1;
                unsigned long MSTPA11 : 1;
                unsigned long MSTPA10 : 1;
                unsigned long MSTPA9 : 1;
                unsigned long : 1;
                unsigned long MSTPA7 : 1;
                unsigned long : 1;
                unsigned long MSTPA5 : 1;
                unsigned long MSTPA4 : 1;
                unsigned long : 2;
                unsigned long MSTPA1 : 1;
                unsigned long MSTPA0 : 1;
            }
            BIT;
        }
        MSTPCRA;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MSTPB31 : 1;
                unsigned long MSTPB30 : 1;
                unsigned long MSTPB29 : 1;
                unsigned long MSTPB28 : 1;
                unsigned long MSTPB27 : 1;
                unsigned long MSTPB26 : 1;
                unsigned long MSTPB25 : 1;
                unsigned long MSTPB24 : 1;
                unsigned long MSTPB23 : 1;
                unsigned long MSTPB22 : 1;
                unsigned long MSTPB21 : 1;
                unsigned long : 1;
                unsigned long MSTPB19 : 1;
                unsigned long : 1;
                unsigned long MSTPB17 : 1;
                unsigned long : 1;
                unsigned long MSTPB15 : 1;
                unsigned long MSTPB14 : 1;
                unsigned long : 1;
                unsigned long MSTPB12 : 1;
                unsigned long : 2;
                unsigned long MSTPB9 : 1;
                unsigned long MSTPB8 : 1;
                unsigned long : 1;
                unsigned long MSTPB6 : 1;
                unsigned long : 1;
                unsigned long MSTPB4 : 1;
                unsigned long : 1;
                unsigned long MSTPB2 : 1;
                unsigned long MSTPB1 : 1;
                unsigned long MSTPB0 : 1;
            }
            BIT;
        }
        MSTPCRB;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 4;
                unsigned long MSTPC27 : 1;
                unsigned long MSTPC26 : 1;
                unsigned long MSTPC25 : 1;
                unsigned long MSTPC24 : 1;
                unsigned long MSTPC23 : 1;
                unsigned long : 3;
                unsigned long MSTPC19 : 1;
                unsigned long : 1;
                unsigned long MSTPC17 : 1;
                unsigned long : 9;
                unsigned long MSTPC7 : 1;
                unsigned long : 4;
                unsigned long MSTPC2 : 1;
                unsigned long : 1;
                unsigned long MSTPC0 : 1;
            }
            BIT;
        }
        MSTPCRC;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long MSTPD31 : 1;
                unsigned long MSTPD30 : 1;
                unsigned long MSTPD29 : 1;
                unsigned long MSTPD28 : 1;
                unsigned long : 4;
                unsigned long MSTPD23 : 1;
                unsigned long : 1;
                unsigned long MSTPD21 : 1;
                unsigned long : 1;
                unsigned long MSTPD19 : 1;
                unsigned long : 3;
                unsigned long MSTPD15 : 1;
                unsigned long MSTPD14 : 1;
            }
            BIT;
        }
        MSTPCRD;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long FCK : 4;
                unsigned long ICK : 4;
                unsigned long PSTOP1 : 1;
                unsigned long PSTOP0 : 1;
                unsigned long : 2;
                unsigned long BCK : 4;
                unsigned long PCKA : 4;
                unsigned long PCKB : 4;
                unsigned long PCKC : 4;
                unsigned long PCKD : 4;
            }
            BIT;
        }
        SCKCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short UCK : 4;
            }
            BIT;
        }
        SCKCR2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 5;
                unsigned short CKSEL : 3;
            }
            BIT;
        }
        SCKCR3;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 2;
                unsigned short STC : 6;
                unsigned short : 3;
                unsigned short PLLSRCSEL : 1;
                unsigned short : 2;
                unsigned short PLIDIV : 2;
            }
            BIT;
        }
        PLLCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char PLLEN : 1;
            }
            BIT;
        }
        PLLCR2;
        char wk3[ 5 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char BCLKDIV : 1;
            }
            BIT;
        }
        BCKCR;
        char wk4[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char MOSTP : 1;
            }
            BIT;
        }
        MOSCCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char SOSTP : 1;
            }
            BIT;
        }
        SOSCCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char LCSTP : 1;
            }
            BIT;
        }
        LOCOCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char ILCSTP : 1;
            }
            BIT;
        }
        ILOCOCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char HCSTP : 1;
            }
            BIT;
        }
        HOCOCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char HCFRQ : 2;
            }
            BIT;
        }
        HOCOCR2;
        char wk6[ 4 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 3;
                unsigned char ILCOVF : 1;
                unsigned char HCOVF : 1;
                unsigned char PLOVF : 1;
                unsigned char SOOVF : 1;
                unsigned char MOOVF : 1;
            }
            BIT;
        }
        OSCOVFSR;
        char wk7[ 3 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char OSTDE : 1;
                unsigned char : 6;
                unsigned char OSTDIE : 1;
            }
            BIT;
        }
        OSTDCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char OSTDF : 1;
            }
            BIT;
        }
        OSTDSR;
        char wk8[ 94 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 3;
                unsigned char OPCMTSF : 1;
                unsigned char : 1;
                unsigned char OPCM : 3;
            }
            BIT;
        }
        OPCCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RSTCKEN : 1;
                unsigned char : 4;
                unsigned char RSTCKSEL : 3;
            }
            BIT;
        }
        RSTCKCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char MSTS : 8;
            }
            BIT;
        }
        MOSCWTCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char SSTS : 8;
            }
            BIT;
        }
        SOSCWTCR;
        char wk9[ 28 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char SWRF : 1;
                unsigned char WDTRF : 1;
                unsigned char IWTDRF : 1;
            }
            BIT;
        }
        RSTSR2;
        char wk10[ 1 ];
        unsigned short SWRR;
        char wk11[ 28 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char LVD1IRQSEL : 1;
                unsigned char LVD1IDTSEL : 2;
            }
            BIT;
        }
        LVD1CR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char LVD1MON : 1;
                unsigned char LVD1DET : 1;
            }
            BIT;
        }
        LVD1SR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 5;
                unsigned char LVD2IRQSEL : 1;
                unsigned char LVD2IDTSEL : 2;
            }
            BIT;
        }
        LVD2CR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 6;
                unsigned char LVD2MON : 1;
                unsigned char LVD2DET : 1;
            }
            BIT;
        }
        LVD2SR;
        char wk12[ 794 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short PRKEY : 8;
                unsigned short : 4;
                unsigned short PRC3 : 1;
                unsigned short : 1;
                unsigned short PRC1 : 1;
                unsigned short PRC0 : 1;
            }
            BIT;
        }
        PRCR;
        char wk13[ 48768 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DPSBY : 1;
                unsigned char IOKEEP : 1;
                unsigned char : 4;
                unsigned char DEEPCUT : 2;
            }
            BIT;
        }
        DPSBYCR;
        char wk14[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DIRQ7E : 1;
                unsigned char DIRQ6E : 1;
                unsigned char DIRQ5E : 1;
                unsigned char DIRQ4E : 1;
                unsigned char DIRQ3E : 1;
                unsigned char DIRQ2E : 1;
                unsigned char DIRQ1E : 1;
                unsigned char DIRQ0E : 1;
            }
            BIT;
        }
        DPSIER0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DIRQ15E : 1;
                unsigned char DIRQ14E : 1;
                unsigned char DIRQ13E : 1;
                unsigned char DIRQ12E : 1;
                unsigned char DIRQ11E : 1;
                unsigned char DIRQ10E : 1;
                unsigned char DIRQ9E : 1;
                unsigned char DIRQ8E : 1;
            }
            BIT;
        }
        DPSIER1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DUSBIE : 1;
                unsigned char DRIICCIE : 1;
                unsigned char DRIICDIE : 1;
                unsigned char DNMIE : 1;
                unsigned char DRTCAIE : 1;
                unsigned char DRTCIIE : 1;
                unsigned char DLVD2IE : 1;
                unsigned char DLVD1IE : 1;
            }
            BIT;
        }
        DPSIER2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char DCANIE : 1;
            }
            BIT;
        }
        DPSIER3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DIRQ7F : 1;
                unsigned char DIRQ6F : 1;
                unsigned char DIRQ5F : 1;
                unsigned char DIRQ4F : 1;
                unsigned char DIRQ3F : 1;
                unsigned char DIRQ2F : 1;
                unsigned char DIRQ1F : 1;
                unsigned char DIRQ0F : 1;
            }
            BIT;
        }
        DPSIFR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DIRQ15F : 1;
                unsigned char DIRQ14F : 1;
                unsigned char DIRQ13F : 1;
                unsigned char DIRQ12F : 1;
                unsigned char DIRQ11F : 1;
                unsigned char DIRQ10F : 1;
                unsigned char DIRQ9F : 1;
                unsigned char DIRQ8F : 1;
            }
            BIT;
        }
        DPSIFR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DUSBIF : 1;
                unsigned char DRIICCIF : 1;
                unsigned char DRIICDIF : 1;
                unsigned char DNMIF : 1;
                unsigned char DRTCAIF : 1;
                unsigned char DRTCIIF : 1;
                unsigned char DLVD2IF : 1;
                unsigned char DLVD1IF : 1;
            }
            BIT;
        }
        DPSIFR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char DCANIF : 1;
            }
            BIT;
        }
        DPSIFR3;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DIRQ7EG : 1;
                unsigned char DIRQ6EG : 1;
                unsigned char DIRQ5EG : 1;
                unsigned char DIRQ4EG : 1;
                unsigned char DIRQ3EG : 1;
                unsigned char DIRQ2EG : 1;
                unsigned char DIRQ1EG : 1;
                unsigned char DIRQ0EG : 1;
            }
            BIT;
        }
        DPSIEGR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DIRQ15EG : 1;
                unsigned char DIRQ14EG : 1;
                unsigned char DIRQ13EG : 1;
                unsigned char DIRQ12EG : 1;
                unsigned char DIRQ11EG : 1;
                unsigned char DIRQ10EG : 1;
                unsigned char DIRQ9EG : 1;
                unsigned char DIRQ8EG : 1;
            }
            BIT;
        }
        DPSIEGR1;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char DRIICCEG : 1;
                unsigned char DRIICDEG : 1;
                unsigned char DNMIEG : 1;
                unsigned char : 2;
                unsigned char DLVD2EG : 1;
                unsigned char DLVD1EG : 1;
            }
            BIT;
        }
        DPSIEGR2;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char DCANIEG : 1;
            }
            BIT;
        }
        DPSIEGR3;
        char wk15[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char DPSRSTF : 1;
                unsigned char : 3;
                unsigned char LVD2RF : 1;
                unsigned char LVD1RF : 1;
                unsigned char LVD0RF : 1;
                unsigned char PORF : 1;
            }
            BIT;
        }
        RSTSR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char CWSF : 1;
            }
            BIT;
        }
        RSTSR1;
        char wk16[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char MOSEL : 1;
                unsigned char MODRV2 : 2;
                unsigned char MODRV : 3;
                unsigned char MOFXIN : 1;
            }
            BIT;
        }
        MOFCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char HOCOPCNT : 1;
            }
            BIT;
        }
        HOCOPCR;
        char wk17[ 2 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 1;
                unsigned char LVD2E : 1;
                unsigned char LVD1E : 1;
            }
            BIT;
        }
        LVCMPCR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char LVD2LVL : 4;
                unsigned char LVD1LVL : 4;
            }
            BIT;
        }
        LVDLVLR;
        char wk18[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char LVD1RN : 1;
                unsigned char LVD1RI : 1;
                unsigned char LVD1FSAMP : 2;
                unsigned char : 1;
                unsigned char LVD1CMPE : 1;
                unsigned char LVD1DFDIS : 1;
                unsigned char LVD1RIE : 1;
            }
            BIT;
        }
        LVD1CR0;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char LVD2RN : 1;
                unsigned char LVD2RI : 1;
                unsigned char LVD2FSAMP : 2;
                unsigned char : 1;
                unsigned char LVD2CMPE : 1;
                unsigned char LVD2DFDIS : 1;
                unsigned char LVD2RIE : 1;
            }
            BIT;
        }
        LVD2CR0;
        char wk19[ 1 ];
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char VBATTMNSEL : 1;
            }
            BIT;
        }
        VBATTMNSELR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 7;
                unsigned char VBATTMON : 1;
            }
            BIT;
        }
        VBATTMONR;
        char wk20[ 1 ];
        unsigned char DPSBKR[ 32 ];
        char wk21[ 7794020 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 29;
                unsigned long MDE : 3;
            }
            BIT;
        }
        MDE;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 3;
                unsigned long WDTRSTIRQS : 1;
                unsigned long WDTRPSS : 2;
                unsigned long WDTRPES : 2;
                unsigned long WDTCKS : 4;
                unsigned long WDTTOPS : 2;
                unsigned long WDTSTRT : 1;
                unsigned long : 2;
                unsigned long IWDTSLCSTP : 1;
                unsigned long : 1;
                unsigned long IWDTRSTIRQS : 1;
                unsigned long IWDTRPSS : 2;
                unsigned long IWDTRPES : 2;
                unsigned long IWDTCKS : 4;
                unsigned long IWDTTOPS : 2;
                unsigned long IWDTSTRT : 1;
            }
            BIT;
        }
        OFS0;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 23;
                unsigned long HOCOEN : 1;
                unsigned long : 5;
                unsigned long LVDAS : 1;
                unsigned long VDSEL : 2;
            }
            BIT;
        }
        OFS1;
    };

    struct st_temps
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char TSEN : 1;
                unsigned char : 2;
                unsigned char TSOE : 1;
            }
            BIT;
        }
        TSCR;
    };

