FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
    struct st_tpua
    {
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char CST5 : 1;
                unsigned char CST4 : 1;
                unsigned char CST3 : 1;
                unsigned char CST2 : 1;
                unsigned char CST1 : 1;
                unsigned char CST0 : 1;
            }
            BIT;
        }
        TSTR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char : 2;
                unsigned char SYNC5 : 1;
                unsigned char SYNC4 : 1;
                unsigned char SYNC3 : 1;
                unsigned char SYNC2 : 1;
                unsigned char SYNC1 : 1;
                unsigned char SYNC0 : 1;
            }
            BIT;
        }
        TSYR;
    };

    struct st_usb
    {
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 8;
                unsigned long DVBSTS0 : 1;
                unsigned long : 1;
                unsigned long DOVCB0 : 1;
                unsigned long DOVCA0 : 1;
                unsigned long : 2;
                unsigned long DM0 : 1;
                unsigned long DP0 : 1;
                unsigned long : 11;
                unsigned long FIXPHY0 : 1;
                unsigned long DRPD0 : 1;
                unsigned long : 1;
                unsigned long RPUE0 : 1;
                unsigned long SRPC0 : 1;
            }
            BIT;
        }
        DPUSR0R;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 8;
                unsigned long DVBINT0 : 1;
                unsigned long : 1;
                unsigned long DOVRCRB0 : 1;
                unsigned long DOVRCRA0 : 1;
                unsigned long : 2;
                unsigned long DMINT0 : 1;
                unsigned long DPINT0 : 1;
                unsigned long : 8;
                unsigned long DVBSE0 : 1;
                unsigned long : 1;
                unsigned long DOVRCRBE0 : 1;
                unsigned long DOVRCRAE0 : 1;
                unsigned long : 2;
                unsigned long DMINTE0 : 1;
                unsigned long DPINTE0 : 1;
            }
            BIT;
        }
        DPUSR1R;
    };

    struct st_usb0
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 5;
                unsigned short SCKE : 1;
                unsigned short : 3;
                unsigned short DCFM : 1;
                unsigned short DRPD : 1;
                unsigned short DPRPU : 1;
                unsigned short : 3;
                unsigned short USBE : 1;
            }
            BIT;
        }
        SYSCFG;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVCMON : 2;
                unsigned short : 7;
                unsigned short HTACT : 1;
                unsigned short : 3;
                unsigned short IDMON : 1;
                unsigned short LNST : 2;
            }
            BIT;
        }
        SYSSTS0;
        char wk1[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 4;
                unsigned short HNPBTOA : 1;
                unsigned short EXICEN : 1;
                unsigned short VBUSEN : 1;
                unsigned short WKUP : 1;
                unsigned short RWUPE : 1;
                unsigned short USBRST : 1;
                unsigned short RESUME : 1;
                unsigned short UACT : 1;
                unsigned short : 1;
                unsigned short RHST : 3;
            }
            BIT;
        }
        DVSTCTR0;
        char wk2[ 10 ];
        unsigned short CFIFO;
        char wk3[ 2 ];
        unsigned short D0FIFO;
        char wk4[ 2 ];
        unsigned short D1FIFO;
        char wk5[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RCNT : 1;
                unsigned short REW : 1;
                unsigned short : 3;
                unsigned short MBW : 1;
                unsigned short : 1;
                unsigned short BIGEND : 1;
                unsigned short : 2;
                unsigned short ISEL : 1;
                unsigned short : 1;
                unsigned short CURPIPE : 4;
            }
            BIT;
        }
        CFIFOSEL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BVAL : 1;
                unsigned short BCLR : 1;
                unsigned short FRDY : 1;
                unsigned short : 4;
                unsigned short DTLN : 9;
            }
            BIT;
        }
        CFIFOCTR;
        char wk6[ 4 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RCNT : 1;
                unsigned short REW : 1;
                unsigned short DCLRM : 1;
                unsigned short DREQE : 1;
                unsigned short : 1;
                unsigned short MBW : 1;
                unsigned short : 1;
                unsigned short BIGEND : 1;
                unsigned short : 4;
                unsigned short CURPIPE : 4;
            }
            BIT;
        }
        D0FIFOSEL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BVAL : 1;
                unsigned short BCLR : 1;
                unsigned short FRDY : 1;
                unsigned short : 4;
                unsigned short DTLN : 9;
            }
            BIT;
        }
        D0FIFOCTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RCNT : 1;
                unsigned short REW : 1;
                unsigned short DCLRM : 1;
                unsigned short DREQE : 1;
                unsigned short : 1;
                unsigned short MBW : 1;
                unsigned short : 1;
                unsigned short BIGEND : 1;
                unsigned short : 4;
                unsigned short CURPIPE : 4;
            }
            BIT;
        }
        D1FIFOSEL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BVAL : 1;
                unsigned short BCLR : 1;
                unsigned short FRDY : 1;
                unsigned short : 4;
                unsigned short DTLN : 9;
            }
            BIT;
        }
        D1FIFOCTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short VBSE : 1;
                unsigned short RSME : 1;
                unsigned short SOFE : 1;
                unsigned short DVSE : 1;
                unsigned short CTRE : 1;
                unsigned short BEMPE : 1;
                unsigned short NRDYE : 1;
                unsigned short BRDYE : 1;
            }
            BIT;
        }
        INTENB0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVRCRE : 1;
                unsigned short BCHGE : 1;
                unsigned short : 1;
                unsigned short DTCHE : 1;
                unsigned short ATTCHE : 1;
                unsigned short : 4;
                unsigned short EOFERRE : 1;
                unsigned short SIGNE : 1;
                unsigned short SACKE : 1;
            }
            BIT;
        }
        INTENB1;
        char wk7[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BRDYE : 1;
                unsigned short PIPE8BRDYE : 1;
                unsigned short PIPE7BRDYE : 1;
                unsigned short PIPE6BRDYE : 1;
                unsigned short PIPE5BRDYE : 1;
                unsigned short PIPE4BRDYE : 1;
                unsigned short PIPE3BRDYE : 1;
                unsigned short PIPE2BRDYE : 1;
                unsigned short PIPE1BRDYE : 1;
                unsigned short PIPE0BRDYE : 1;
            }
            BIT;
        }
        BRDYENB;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9NRDYE : 1;
                unsigned short PIPE8NRDYE : 1;
                unsigned short PIPE7NRDYE : 1;
                unsigned short PIPE6NRDYE : 1;
                unsigned short PIPE5NRDYE : 1;
                unsigned short PIPE4NRDYE : 1;
                unsigned short PIPE3NRDYE : 1;
                unsigned short PIPE2NRDYE : 1;
                unsigned short PIPE1NRDYE : 1;
                unsigned short PIPE0NRDYE : 1;
            }
            BIT;
        }
        NRDYENB;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BEMPE : 1;
                unsigned short PIPE8BEMPE : 1;
                unsigned short PIPE7BEMPE : 1;
                unsigned short PIPE6BEMPE : 1;
                unsigned short PIPE5BEMPE : 1;
                unsigned short PIPE4BEMPE : 1;
                unsigned short PIPE3BEMPE : 1;
                unsigned short PIPE2BEMPE : 1;
                unsigned short PIPE1BEMPE : 1;
                unsigned short PIPE0BEMPE : 1;
            }
            BIT;
        }
        BEMPENB;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 7;
                unsigned short TRNENSEL : 1;
                unsigned short : 1;
                unsigned short BRDYM : 1;
                unsigned short : 1;
                unsigned short EDGESTS : 1;
            }
            BIT;
        }
        SOFCFG;
        char wk8[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short VBINT : 1;
                unsigned short RESM : 1;
                unsigned short SOFR : 1;
                unsigned short DVST : 1;
                unsigned short CTRT : 1;
                unsigned short BEMP : 1;
                unsigned short NRDY : 1;
                unsigned short BRDY : 1;
                unsigned short VBSTS : 1;
                unsigned short DVSQ : 3;
                unsigned short VALID : 1;
                unsigned short CTSQ : 3;
            }
            BIT;
        }
        INTSTS0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVRCR : 1;
                unsigned short BCHG : 1;
                unsigned short : 1;
                unsigned short DTCH : 1;
                unsigned short ATTCH : 1;
                unsigned short : 4;
                unsigned short EOFERR : 1;
                unsigned short SIGN : 1;
                unsigned short SACK : 1;
            }
            BIT;
        }
        INTSTS1;
        char wk9[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BRDY : 1;
                unsigned short PIPE8BRDY : 1;
                unsigned short PIPE7BRDY : 1;
                unsigned short PIPE6BRDY : 1;
                unsigned short PIPE5BRDY : 1;
                unsigned short PIPE4BRDY : 1;
                unsigned short PIPE3BRDY : 1;
                unsigned short PIPE2BRDY : 1;
                unsigned short PIPE1BRDY : 1;
                unsigned short PIPE0BRDY : 1;
            }
            BIT;
        }
        BRDYSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9NRDY : 1;
                unsigned short PIPE8NRDY : 1;
                unsigned short PIPE7NRDY : 1;
                unsigned short PIPE6NRDY : 1;
                unsigned short PIPE5NRDY : 1;
                unsigned short PIPE4NRDY : 1;
                unsigned short PIPE3NRDY : 1;
                unsigned short PIPE2NRDY : 1;
                unsigned short PIPE1NRDY : 1;
                unsigned short PIPE0NRDY : 1;
            }
            BIT;
        }
        NRDYSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BEMP : 1;
                unsigned short PIPE8BEMP : 1;
                unsigned short PIPE7BEMP : 1;
                unsigned short PIPE6BEMP : 1;
                unsigned short PIPE5BEMP : 1;
                unsigned short PIPE4BEMP : 1;
                unsigned short PIPE3BEMP : 1;
                unsigned short PIPE2BEMP : 1;
                unsigned short PIPE1BEMP : 1;
                unsigned short PIPE0BEMP : 1;
            }
            BIT;
        }
        BEMPSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVRN : 1;
                unsigned short CRCE : 1;
                unsigned short : 3;
                unsigned short FRNM : 11;
            }
            BIT;
        }
        FRMNUM;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DVCHG : 1;
            }
            BIT;
        }
        DVCHGR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 4;
                unsigned short STSRECOV : 4;
                unsigned short : 1;
                unsigned short USBADDR : 7;
            }
            BIT;
        }
        USBADDR;
        char wk10[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BREQUEST : 8;
                unsigned short BMREQUESTTYPE : 8;
            }
            BIT;
        }
        USBREQ;
        unsigned short USBVAL;
        unsigned short USBINDX;
        unsigned short USBLENG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short SHTNAK : 1;
                unsigned short : 2;
                unsigned short DIR : 1;
            }
            BIT;
        }
        DCPCFG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DEVSEL : 4;
                unsigned short : 5;
                unsigned short MXPS : 7;
            }
            BIT;
        }
        DCPMAXP;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short SUREQ : 1;
                unsigned short : 2;
                unsigned short SUREQCLR : 1;
                unsigned short : 2;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 2;
                unsigned short CCPL : 1;
                unsigned short PID : 2;
            }
            BIT;
        }
        DCPCTR;
        char wk11[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 12;
                unsigned short PIPESEL : 4;
            }
            BIT;
        }
        PIPESEL;
        char wk12[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TYPE : 2;
                unsigned short : 3;
                unsigned short BFRE : 1;
                unsigned short DBLB : 1;
                unsigned short : 1;
                unsigned short SHTNAK : 1;
                unsigned short : 2;
                unsigned short DIR : 1;
                unsigned short EPNUM : 4;
            }
            BIT;
        }
        PIPECFG;
        char wk13[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DEVSEL : 4;
                unsigned short : 3;
                unsigned short MXPS : 9;
            }
            BIT;
        }
        PIPEMAXP;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 3;
                unsigned short IFIS : 1;
                unsigned short : 9;
                unsigned short IITV : 3;
            }
            BIT;
        }
        PIPEPERI;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short : 3;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE1CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short : 3;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE2CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short : 3;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE3CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short : 3;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE4CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short : 3;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE5CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short : 5;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE6CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short : 5;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE7CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short : 5;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE8CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short : 5;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE9CTR;
        char wk14[ 14 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE1TRE;
        unsigned short PIPE1TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE2TRE;
        unsigned short PIPE2TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE3TRE;
        unsigned short PIPE3TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE4TRE;
        unsigned short PIPE4TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE5TRE;
        unsigned short PIPE5TRN;
        char wk15[ 44 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD0;
        union
        {
            unsigned short WORD;
            struct
            {
