FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
                unsigned short : 8;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD3;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD4;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD5;
        char wk16[ 20 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 24;
                unsigned long USBSPD : 2;
                unsigned long : 2;
                unsigned long SLEWF01 : 1;
                unsigned long SLEWF00 : 1;
                unsigned long SLEWR01 : 1;
                unsigned long SLEWR00 : 1;
            }
            BIT;
        }
        DPUSR2R;
    };

    struct st_usbhs
    {
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 7;
                unsigned short CNEN : 1;
                unsigned short HSE : 1;
                unsigned short DCFM : 1;
                unsigned short DRPD : 1;
                unsigned short DPRPU : 1;
                unsigned short : 3;
                unsigned short USBE : 1;
            }
            BIT;
        }
        SYSCFG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 12;
                unsigned short BWAIT : 4;
            }
            BIT;
        }
        BUSWAIT;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVCMON : 2;
                unsigned short : 7;
                unsigned short HTACT : 1;
                unsigned short : 3;
                unsigned short IDMON : 1;
                unsigned short LNST : 2;
            }
            BIT;
        }
        SYSSTS0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 15;
                unsigned short PLLLOCK : 1;
            }
            BIT;
        }
        PLLSTA;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 4;
                unsigned short HNPBTOA : 1;
                unsigned short EXICEN : 1;
                unsigned short VBUSEN : 1;
                unsigned short WKUP : 1;
                unsigned short RWUPE : 1;
                unsigned short USBRST : 1;
                unsigned short RESUME : 1;
                unsigned short UACT : 1;
                unsigned short : 1;
                unsigned short RHST : 3;
            }
            BIT;
        }
        DVSTCTR0;
        char wk0[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 12;
                unsigned short UTST : 4;
            }
            BIT;
        }
        TESTMODE;
        char wk1[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 2;
                unsigned short DFACC : 2;
                unsigned short : 7;
                unsigned short TENDE : 1;
            }
            BIT;
        }
        D0FBCFG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 2;
                unsigned short DFACC : 2;
                unsigned short : 7;
                unsigned short TENDE : 1;
            }
            BIT;
        }
        D1FBCFG;
        unsigned short CFIFO;
        unsigned short CFIFO1;
        unsigned short D0FIFO;
        unsigned short D0FIFO1;
        unsigned short D1FIFO;
        unsigned short D1FIFO1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RCNT : 1;
                unsigned short REW : 1;
                unsigned short : 2;
                unsigned short MBW : 2;
                unsigned short : 1;
                unsigned short BIGEND : 1;
                unsigned short : 2;
                unsigned short ISEL : 1;
                unsigned short : 1;
                unsigned short CURPIPE : 4;
            }
            BIT;
        }
        CFIFOSEL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BVAL : 1;
                unsigned short BCLR : 1;
                unsigned short FRDY : 1;
                unsigned short : 1;
                unsigned short DTLN : 12;
            }
            BIT;
        }
        CFIFOCTR;
        char wk2[ 4 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RCNT : 1;
                unsigned short REW : 1;
                unsigned short DCLRM : 1;
                unsigned short DREQE : 1;
                unsigned short MBW : 2;
                unsigned short : 1;
                unsigned short BIGEND : 1;
                unsigned short : 4;
                unsigned short CURPIPE : 4;
            }
            BIT;
        }
        D0FIFOSEL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BVAL : 1;
                unsigned short BCLR : 1;
                unsigned short FRDY : 1;
                unsigned short : 1;
                unsigned short DTLN : 12;
            }
            BIT;
        }
        D0FIFOCTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short RCNT : 1;
                unsigned short REW : 1;
                unsigned short DCLRM : 1;
                unsigned short DREQE : 1;
                unsigned short MBW : 2;
                unsigned short : 1;
                unsigned short BIGEND : 1;
                unsigned short : 4;
                unsigned short CURPIPE : 4;
            }
            BIT;
        }
        D1FIFOSEL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BVAL : 1;
                unsigned short BCLR : 1;
                unsigned short FRDY : 1;
                unsigned short : 1;
                unsigned short DTLN : 12;
            }
            BIT;
        }
        D1FIFOCTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short VBSE : 1;
                unsigned short RSME : 1;
                unsigned short SOFE : 1;
                unsigned short DVSE : 1;
                unsigned short CTRE : 1;
                unsigned short BEMPE : 1;
                unsigned short NRDYE : 1;
                unsigned short BRDYE : 1;
            }
            BIT;
        }
        INTENB0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVRCRE : 1;
                unsigned short BCHGE : 1;
                unsigned short : 1;
                unsigned short DTCHE : 1;
                unsigned short ATTCHE : 1;
                unsigned short : 1;
                unsigned short L1RSMENDE : 1;
                unsigned short LPMENDE : 1;
                unsigned short : 1;
                unsigned short EOFERRE : 1;
                unsigned short SIGNE : 1;
                unsigned short SACKE : 1;
                unsigned short : 3;
                unsigned short PDDETINTE : 1;
            }
            BIT;
        }
        INTENB1;
        char wk3[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BRDYE : 1;
                unsigned short PIPE8BRDYE : 1;
                unsigned short PIPE7BRDYE : 1;
                unsigned short PIPE6BRDYE : 1;
                unsigned short PIPE5BRDYE : 1;
                unsigned short PIPE4BRDYE : 1;
                unsigned short PIPE3BRDYE : 1;
                unsigned short PIPE2BRDYE : 1;
                unsigned short PIPE1BRDYE : 1;
                unsigned short PIPE0BRDYE : 1;
            }
            BIT;
        }
        BRDYENB;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9NRDYE : 1;
                unsigned short PIPE8NRDYE : 1;
                unsigned short PIPE7NRDYE : 1;
                unsigned short PIPE6NRDYE : 1;
                unsigned short PIPE5NRDYE : 1;
                unsigned short PIPE4NRDYE : 1;
                unsigned short PIPE3NRDYE : 1;
                unsigned short PIPE2NRDYE : 1;
                unsigned short PIPE1NRDYE : 1;
                unsigned short PIPE0NRDYE : 1;
            }
            BIT;
        }
        NRDYENB;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BEMPE : 1;
                unsigned short PIPE8BEMPE : 1;
                unsigned short PIPE7BEMPE : 1;
                unsigned short PIPE6BEMPE : 1;
                unsigned short PIPE5BEMPE : 1;
                unsigned short PIPE4BEMPE : 1;
                unsigned short PIPE3BEMPE : 1;
                unsigned short PIPE2BEMPE : 1;
                unsigned short PIPE1BEMPE : 1;
                unsigned short PIPE0BEMPE : 1;
            }
            BIT;
        }
        BEMPENB;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 7;
                unsigned short TRNENSEL : 1;
                unsigned short : 1;
                unsigned short BRDYM : 1;
                unsigned short INTL : 1;
                unsigned short EDGESTS : 1;
                unsigned short SOFM : 2;
            }
            BIT;
        }
        SOFCFG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short HSEB : 1;
                unsigned short : 3;
                unsigned short repstart : 1;
                unsigned short : 1;
                unsigned short repsel1 : 1;
                unsigned short repsel0 : 1;
                unsigned short : 2;
                unsigned short clksel1 : 1;
                unsigned short clksel0 : 1;
                unsigned short cdpen : 1;
                unsigned short : 1;
                unsigned short pllreset : 1;
                unsigned short dirpd : 1;
            }
            BIT;
        }
        PHYSET;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short VBINT : 1;
                unsigned short RESM : 1;
                unsigned short SOFR : 1;
                unsigned short DVST : 1;
                unsigned short CTRT : 1;
                unsigned short BEMP : 1;
                unsigned short NRDY : 1;
                unsigned short BRDY : 1;
                unsigned short VBSTS : 1;
                unsigned short DVSQ : 3;
                unsigned short VALID : 1;
                unsigned short CTSQ : 3;
            }
            BIT;
        }
        INTSTS0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVRCR : 1;
                unsigned short BCHG : 1;
                unsigned short : 1;
                unsigned short DTCH : 1;
                unsigned short ATTCH : 1;
                unsigned short : 1;
                unsigned short L1RSMEND : 1;
                unsigned short LPMEND : 1;
                unsigned short : 1;
                unsigned short EOFERR : 1;
                unsigned short SIGN : 1;
                unsigned short SACK : 1;
                unsigned short : 3;
                unsigned short PDDETINT : 1;
            }
            BIT;
        }
        INTSTS1;
        char wk4[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BRDY : 1;
                unsigned short PIPE8BRDY : 1;
                unsigned short PIPE7BRDY : 1;
                unsigned short PIPE6BRDY : 1;
                unsigned short PIPE5BRDY : 1;
                unsigned short PIPE4BRDY : 1;
                unsigned short PIPE3BRDY : 1;
                unsigned short PIPE2BRDY : 1;
                unsigned short PIPE1BRDY : 1;
                unsigned short PIPE0BRDY : 1;
            }
            BIT;
        }
        BRDYSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9NRDYE : 1;
                unsigned short PIPE8NRDYE : 1;
                unsigned short PIPE7NRDYE : 1;
                unsigned short PIPE6NRDYE : 1;
                unsigned short PIPE5NRDYE : 1;
                unsigned short PIPE4NRDYE : 1;
                unsigned short PIPE3NRDYE : 1;
                unsigned short PIPE2NRDYE : 1;
                unsigned short PIPE1NRDYE : 1;
                unsigned short PIPE0NRDYE : 1;
            }
            BIT;
        }
        NRDYSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PIPE9BEMPE : 1;
                unsigned short PIPE8BEMPE : 1;
                unsigned short PIPE7BENP : 1;
                unsigned short PIPE6BENP : 1;
                unsigned short PIPE5BENP : 1;
                unsigned short PIPE4BENP : 1;
                unsigned short PIPE3BENP : 1;
                unsigned short PIPE2BENP : 1;
                unsigned short PIPE1BENP : 1;
                unsigned short PIPE0BENP : 1;
            }
            BIT;
        }
        BEMPSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short OVRN : 1;
                unsigned short CRCE : 1;
                unsigned short : 3;
                unsigned short FRNM : 11;
            }
            BIT;
        }
        FRMNUM;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 13;
                unsigned short UFRNM : 3;
            }
            BIT;
        }
        UFRMNUM;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 9;
                unsigned short USBADDR : 7;
            }
            BIT;
        }
        USBADDR;
        char wk5[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BREQUEST : 8;
                unsigned short BMREQUESTTYPE : 8;
            }
            BIT;
        }
        USBREQ;
        unsigned short USBVAL;
        unsigned short USBINDX;
        unsigned short USBLENG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 11;
                unsigned short DIR : 1;
            }
            BIT;
        }
        DCPCFG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DEVSEL : 4;
                unsigned short : 5;
                unsigned short MXPS : 7;
            }
            BIT;
        }
        DCPMAXP;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short SUREQ : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short SUREQCLR : 1;
                unsigned short : 2;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short PINGE : 1;
                unsigned short : 1;
                unsigned short CCPL : 1;
                unsigned short PID : 2;
            }
            BIT;
        }
        DCPCTR;
        char wk6[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 12;
                unsigned short PIPESEL : 4;
            }
            BIT;
        }
        PIPESEL;
        char wk7[ 2 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TYPE : 2;
                unsigned short : 3;
                unsigned short BFRE : 1;
                unsigned short DBLB : 1;
                unsigned short CNTMD : 1;
                unsigned short SHTNAK : 1;
                unsigned short : 2;
                unsigned short DIR : 1;
                unsigned short EPNUM : 4;
            }
            BIT;
        }
        PIPECFG;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short BUFSIZE : 5;
                unsigned short : 2;
                unsigned short BUFNMB : 8;
            }
            BIT;
        }
        PIPEBUF;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short DEVSEL : 4;
                unsigned short : 1;
                unsigned short MXPS : 11;
            }
            BIT;
        }
        PIPEMAXP;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 3;
                unsigned short IFIS : 1;
                unsigned short : 9;
                unsigned short IITV : 3;
            }
            BIT;
        }
        PIPEPERI;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE1CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE2CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE3CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE4CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE5CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE6CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE7CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
