FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE8CTR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short BSTS : 1;
                unsigned short INBUFM : 1;
                unsigned short CSCLR : 1;
                unsigned short CSSTS : 1;
                unsigned short : 1;
                unsigned short ATREPM : 1;
                unsigned short ACLRM : 1;
                unsigned short SQCLR : 1;
                unsigned short SQSET : 1;
                unsigned short SQMON : 1;
                unsigned short PBUSY : 1;
                unsigned short : 3;
                unsigned short PID : 2;
            }
            BIT;
        }
        PIPE9CTR;
        char wk8[ 14 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE1TRE;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRNCNT : 16;
            }
            BIT;
        }
        PIPE1TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE2TRE;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRNCNT : 16;
            }
            BIT;
        }
        PIPE2TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE3TRE;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRNCNT : 16;
            }
            BIT;
        }
        PIPE3TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE4TRE;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRNCNT : 16;
            }
            BIT;
        }
        PIPE4TRN;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short TRENB : 1;
                unsigned short TRCLR : 1;
            }
            BIT;
        }
        PIPE5TRE;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short TRNCNT : 16;
            }
            BIT;
        }
        PIPE5TRN;
        char wk9[ 44 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short UPPHUB : 4;
                unsigned short HUBPORT : 3;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD0;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short UPPHUB : 4;
                unsigned short HUBPORT : 3;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short UPPHUB : 4;
                unsigned short HUBPORT : 3;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD2;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short UPPHUB : 4;
                unsigned short HUBPORT : 3;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD3;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short UPPHUB : 4;
                unsigned short HUBPORT : 3;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD4;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short UPPHUB : 4;
                unsigned short HUBPORT : 3;
                unsigned short USBSPD : 2;
            }
            BIT;
        }
        DEVADD5;
        char wk10[ 36 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 8;
                unsigned short HWLPM : 1;
            }
            BIT;
        }
        LPCTRL;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short SUSPENDM : 1;
            }
            BIT;
        }
        LPSTS;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short SUSMON : 1;
                unsigned short : 1;
                unsigned short OPMODE : 2;
                unsigned short TERMSEL : 1;
                unsigned short XCVRSEL : 2;
            }
            BIT;
        }
        PHYFUNCTR;
        char wk11[ 4 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 5;
                unsigned short DMPUDWN : 1;
                unsigned short DPPUDWN : 1;
            }
            BIT;
        }
        PHYOTGCTR;
        char wk12[ 52 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 6;
                unsigned short PDDETSTS : 1;
                unsigned short CHGDETSTS : 1;
                unsigned short : 2;
                unsigned short DCPMODE : 1;
                unsigned short VDMSRCE : 1;
                unsigned short IDPSINKE : 1;
                unsigned short VDPSRCE : 1;
                unsigned short IDMSINKE : 1;
                unsigned short IDPSRCE : 1;
            }
            BIT;
        }
        BCCTRL;
        char wk13[ 14 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short impoffset2 : 1;
                unsigned short impoffset1 : 1;
                unsigned short impoffset0 : 1;
                unsigned short hsiup3 : 1;
                unsigned short hsiup2 : 1;
                unsigned short hsiup1 : 1;
                unsigned short hsiup0 : 1;
                unsigned short pcompenb : 1;
                unsigned short : 3;
                unsigned short dfall1 : 1;
                unsigned short dfall0 : 1;
                unsigned short drise1 : 1;
                unsigned short drise0 : 1;
            }
            BIT;
        }
        PHYTRIM1;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 1;
                unsigned short dis2 : 1;
                unsigned short dis1 : 1;
                unsigned short dis0 : 1;
                unsigned short : 2;
                unsigned short prd1 : 1;
                unsigned short prd0 : 1;
                unsigned short hsrxenmode : 1;
                unsigned short : 3;
                unsigned short squ3 : 1;
                unsigned short squ2 : 1;
                unsigned short squ1 : 1;
                unsigned short squ0 : 1;
            }
            BIT;
        }
        PHYTRIM2;
        char wk14[ 12 ];
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 8;
                unsigned long DVBSTS : 1;
                unsigned long : 1;
                unsigned long DOVCB : 1;
                unsigned long DOVCA : 1;
                unsigned long : 2;
                unsigned long DM : 1;
                unsigned long DP : 1;
                unsigned long : 11;
                unsigned long FIXPHY : 1;
                unsigned long : 3;
                unsigned long SRPC : 1;
            }
            BIT;
        }
        DPUSR0R;
        union
        {
            unsigned long LONG;
            struct
            {
                unsigned long : 8;
                unsigned long DVBINT : 1;
                unsigned long : 1;
                unsigned long DOVRCRB : 1;
                unsigned long DOVRCRA : 1;
                unsigned long : 2;
                unsigned long DMINT : 1;
                unsigned long DPINT : 1;
                unsigned long : 8;
                unsigned long DVBSE : 1;
                unsigned long : 1;
                unsigned long DOVRCRBE : 1;
                unsigned long DOVRCRAE : 1;
                unsigned long : 2;
                unsigned long DMINTE : 1;
                unsigned long DPINTE : 1;
            }
            BIT;
        }
        DPUSR1R;
    };

    struct st_wdt
    {
        unsigned char WDTRR;
        char wk0[ 1 ];
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short : 2;
                unsigned short RPSS : 2;
                unsigned short : 2;
                unsigned short RPES : 2;
                unsigned short CKS : 4;
                unsigned short : 2;
                unsigned short TOPS : 2;
            }
            BIT;
        }
        WDTCR;
        union
        {
            unsigned short WORD;
            struct
            {
                unsigned short REFEF : 1;
                unsigned short UNDFF : 1;
                unsigned short CNTVAL : 14;
            }
            BIT;
        }
        WDTSR;
        union
        {
            unsigned char BYTE;
            struct
            {
                unsigned char RSTIRQS : 1;
            }
            BIT;
        }
        WDTRCR;
    };

