FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
#endif /* ifdef __RX_LITTLE_ENDIAN__ */
enum enum_ir
{
    IR_BSC_BUSERR = 16, IR_RAM_RAMERR = 18,
    IR_FCU_FIFERR = 21, IR_FCU_FRDYI = 23,
    IR_ICU_SWINT2 = 26, IR_ICU_SWINT,
    IR_CMT0_CMI0,
    IR_CMT1_CMI1,
    IR_CMTW0_CMWI0,
    IR_CMTW_CMWI1,
    IR_USBHS_D0FIFO2, IR_USBHS_D1FIFO2,
    IR_USB0_D0FIFO0, IR_USB0_D1FIFO0,
    IR_RSPI0_SPRI0 = 38, IR_RSPI0_SPTI0,
    IR_QSPI_SPRI = 42, IR_QSPI_SPTI,
    IR_SDHI_SBFAI,
    IR_MMC_MBFAI,
    IR_SSI0_SSITXI0, IR_SSI0_SSIRXI0,
    IR_SSI1_SSIRTI1,
    IR_SRC0_IDEI0 = 50, IR_SRC0_ODFI0,
    IR_RIIC0_RXI0, IR_RIIC0_TXI0,
    IR_RIIC2_RXI2, IR_RIIC2_TXI2,
    IR_SCI0_RXI0 = 58, IR_SCI0_TXI0,
    IR_SCI1_RXI1, IR_SCI1_TXI1,
    IR_SCI2_RXI2, IR_SCI2_TXI2,
    IR_ICU_IRQ0, IR_ICU_IRQ1, IR_ICU_IRQ2, IR_ICU_IRQ3, IR_ICU_IRQ4, IR_ICU_IRQ5, IR_ICU_IRQ6, IR_ICU_IRQ7, IR_ICU_IRQ8, IR_ICU_IRQ9, IR_ICU_IRQ10, IR_ICU_IRQ11, IR_ICU_IRQ12, IR_ICU_IRQ13, IR_ICU_IRQ14, IR_ICU_IRQ15,
    IR_SCI3_RXI3, IR_SCI3_TXI3,
    IR_SCI4_RXI4, IR_SCI4_TXI4,
    IR_SCI5_RXI5, IR_SCI5_TXI5,
    IR_SCI6_RXI6, IR_SCI6_TXI6,
    IR_LVD1_COMPA1,
    IR_LVD2_COMPA2,
    IR_USB0_USBR0,
    IR_RTC_ALARM, IR_RTC_PRD,
    IR_USBHS_HSUSBR,
    IR_IWDT_IWUNI,
    IR_WDT_WUNI,
    IR_SCI7_RXI7, IR_SCI7_TXI7,
    IR_SCIF8_RXIF8, IR_SCIF8_TXIF8,
    IR_SCIF9_RXIF9, IR_SCIF9_TXIF9,
    IR_SCIF10_RXIF10, IR_SCIF10_TXIF10,
    IR_ICU_GROUPBE0, IR_ICU_GROUPBE1, IR_ICU_GROUPAE0, IR_ICU_GROUPAE1, IR_ICU_GROUPBL0, IR_ICU_GROUPBL1, IR_ICU_GROUPAL0, IR_ICU_GROUPAL1,
    IR_SCIF11_RXIF11, IR_SCIF11_TXIF11,
    IR_SCI12_RXI12, IR_SCI12_TXI12,
    IR_DMAC_DMAC0I = 120, IR_DMAC_DMAC1I, IR_DMAC_DMAC2I, IR_DMAC_DMAC3I, IR_DMAC_DMAC74I,
    IR_ICU_OST,
    IR_EXDMAC_EXDMAC0I, IR_EXDMAC_EXDMAC1I,
    IR_PERIB128_INTB128,
    IR_PERIB129_INTB129,
    IR_PERIB130_INTB130,
    IR_PERIB131_INTB131,
    IR_PERIB132_INTB132,
    IR_PERIB133_INTB133,
    IR_PERIB134_INTB134,
    IR_PERIB135_INTB135,
    IR_PERIB136_INTB136,
    IR_PERIB137_INTB137,
    IR_PERIB138_INTB138,
    IR_PERIB139_INTB139,
    IR_PERIB140_INTB140,
    IR_PERIB141_INTB141,
    IR_PERIB142_INTB142,
    IR_PERIB143_INTB143,
    IR_PERIB144_INTB144,
    IR_PERIB145_INTB145,
    IR_PERIB146_INTB146,
    IR_PERIB147_INTB147,
    IR_PERIB148_INTB148,
    IR_PERIB149_INTB149,
    IR_PERIB150_INTB150,
    IR_PERIB151_INTB151,
    IR_PERIB152_INTB152,
    IR_PERIB153_INTB153,
    IR_PERIB154_INTB154,
    IR_PERIB155_INTB155,
    IR_PERIB156_INTB156,
    IR_PERIB157_INTB157,
    IR_PERIB158_INTB158,
    IR_PERIB159_INTB159,
    IR_PERIB160_INTB160,
    IR_PERIB161_INTB161,
    IR_PERIB162_INTB162,
    IR_PERIB163_INTB163,
    IR_PERIB164_INTB164,
    IR_PERIB165_INTB165,
    IR_PERIB166_INTB166,
    IR_PERIB167_INTB167,
    IR_PERIB168_INTB168,
    IR_PERIB169_INTB169,
    IR_PERIB170_INTB170,
    IR_PERIB171_INTB171,
    IR_PERIB172_INTB172,
    IR_PERIB173_INTB173,
    IR_PERIB174_INTB174,
    IR_PERIB175_INTB175,
    IR_PERIB176_INTB176,
    IR_PERIB177_INTB177,
    IR_PERIB178_INTB178,
    IR_PERIB179_INTB179,
    IR_PERIB180_INTB180,
    IR_PERIB181_INTB181,
    IR_PERIB182_INTB182,
    IR_PERIB183_INTB183,
    IR_PERIB184_INTB184,
    IR_PERIB185_INTB185,
    IR_PERIB186_INTB186,
    IR_PERIB187_INTB187,
    IR_PERIB188_INTB188,
    IR_PERIB189_INTB189,
    IR_PERIB190_INTB190,
    IR_PERIB191_INTB191,
    IR_PERIB192_INTB192,
    IR_PERIB193_INTB193,
    IR_PERIB194_INTB194,
    IR_PERIB195_INTB195,
    IR_PERIB196_INTB196,
    IR_PERIB197_INTB197,
    IR_PERIB198_INTB198,
    IR_PERIB199_INTB199,
    IR_PERIB200_INTB200,
    IR_PERIB201_INTB201,
    IR_PERIB202_INTB202,
    IR_PERIB203_INTB203,
    IR_PERIB204_INTB204,
    IR_PERIB205_INTB205,
    IR_PERIB206_INTB206,
    IR_PERIB207_INTB207,
    IR_PERIA208_INTA208,
    IR_PERIA209_INTA209,
    IR_PERIA210_INTA210,
    IR_PERIA211_INTA211,
    IR_PERIA212_INTA212,
    IR_PERIA213_INTA213,
    IR_PERIA214_INTA214,
    IR_PERIA215_INTA215,
    IR_PERIA216_INTA216,
    IR_PERIA217_INTA217,
    IR_PERIA218_INTA218,
    IR_PERIA219_INTA219,
    IR_PERIA220_INTA220,
    IR_PERIA221_INTA221,
    IR_PERIA222_INTA222,
    IR_PERIA223_INTA223,
    IR_PERIA224_INTA224,
    IR_PERIA225_INTA225,
    IR_PERIA226_INTA226,
    IR_PERIA227_INTA227,
    IR_PERIA228_INTA228,
    IR_PERIA229_INTA229,
    IR_PERIA230_INTA230,
    IR_PERIA231_INTA231,
    IR_PERIA232_INTA232,
    IR_PERIA233_INTA233,
    IR_PERIA234_INTA234,
    IR_PERIA235_INTA235,
    IR_PERIA236_INTA236,
    IR_PERIA237_INTA237,
    IR_PERIA238_INTA238,
    IR_PERIA239_INTA239,
    IR_PERIA240_INTA240,
    IR_PERIA241_INTA241,
    IR_PERIA242_INTA242,
    IR_PERIA243_INTA243,
    IR_PERIA244_INTA244,
    IR_PERIA245_INTA245,
    IR_PERIA246_INTA246,
    IR_PERIA247_INTA247,
    IR_PERIA248_INTA248,
    IR_PERIA249_INTA249,
    IR_PERIA250_INTA250,
    IR_PERIA251_INTA251,
    IR_PERIA252_INTA252,
    IR_PERIA253_INTA253,
    IR_PERIA254_INTA254,
    IR_PERIA255_INTA255
};

enum enum_dtce
{
    DTCE_ICU_SWINT2 = 26, DTCE_ICU_SWINT,
    DTCE_CMT0_CMI0,
    DTCE_CMT1_CMI1,
    DTCE_CMTW0_CMWI0,
    DTCE_CMTW_CMWI1,
    DTCE_USBHS_D0FIFO2, DTCE_USBHS_D1FIFO2,
    DTCE_USB0_D0FIFO0, DTCE_USB0_D1FIFO0,
    DTCE_RSPI0_SPRI0 = 38, DTCE_RSPI0_SPTI0,
    DTCE_QSPI_SPRI = 42, DTCE_QSPI_SPTI,
    DTCE_SDHI_SBFAI,
    DTCE_MMC_MBFAI,
    DTCE_SSI0_SSITXI0, DTCE_SSI0_SSIRXI0,
    DTCE_SSI1_SSIRTI1,
    DTCE_SRC0_IDEI0 = 50, DTCE_SRC0_ODFI0,
    DTCE_RIIC0_RXI0, DTCE_RIIC0_TXI0,
    DTCE_RIIC2_RXI2, DTCE_RIIC2_TXI2,
    DTCE_SCI0_RXI0 = 58, DTCE_SCI0_TXI0,
    DTCE_SCI1_RXI1, DTCE_SCI1_TXI1,
    DTCE_SCI2_RXI2, DTCE_SCI2_TXI2,
    DTCE_ICU_IRQ0, DTCE_ICU_IRQ1, DTCE_ICU_IRQ2, DTCE_ICU_IRQ3, DTCE_ICU_IRQ4, DTCE_ICU_IRQ5, DTCE_ICU_IRQ6, DTCE_ICU_IRQ7, DTCE_ICU_IRQ8, DTCE_ICU_IRQ9, DTCE_ICU_IRQ10, DTCE_ICU_IRQ11, DTCE_ICU_IRQ12, DTCE_ICU_IRQ13, DTCE_ICU_IRQ14, DTCE_ICU_IRQ15,
    DTCE_SCI3_RXI3, DTCE_SCI3_TXI3,
    DTCE_SCI4_RXI4, DTCE_SCI4_TXI4,
    DTCE_SCI5_RXI5, DTCE_SCI5_TXI5,
    DTCE_SCI6_RXI6, DTCE_SCI6_TXI6,
    DTCE_PDC_PCDFI = 97,
    DTCE_SCI7_RXI7, DTCE_SCI7_TXI7,
    DTCE_SCIF8_RXIF8, DTCE_SCIF8_TXIF8,
    DTCE_SCIF9_RXIF9, DTCE_SCIF9_TXIF9,
    DTCE_SCIF10_RXIF10, DTCE_SCIF10_TXIF10,
    DTCE_SCIF11_RXIF11 = 114, DTCE_SCIF11_TXIF11,
    DTCE_SCI12_RXI12, DTCE_SCI12_TXI12,
    DTCE_DMAC_DMAC0I = 120, DTCE_DMAC_DMAC1I, DTCE_DMAC_DMAC2I, DTCE_DMAC_DMAC3I,
    DTCE_EXDMAC_EXDMAC0I = 126, DTCE_EXDMAC_EXDMAC1I,
    DTCE_PERIB128_INTB128,
    DTCE_PERIB129_INTB129,
    DTCE_PERIB130_INTB130,
    DTCE_PERIB131_INTB131,
    DTCE_PERIB132_INTB132,
    DTCE_PERIB133_INTB133,
    DTCE_PERIB134_INTB134,
    DTCE_PERIB135_INTB135,
    DTCE_PERIB136_INTB136,
    DTCE_PERIB137_INTB137,
    DTCE_PERIB138_INTB138,
    DTCE_PERIB139_INTB139,
    DTCE_PERIB140_INTB140,
    DTCE_PERIB141_INTB141,
    DTCE_PERIB142_INTB142,
    DTCE_PERIB143_INTB143,
    DTCE_PERIB144_INTB144,
    DTCE_PERIB145_INTB145,
    DTCE_PERIB146_INTB146,
    DTCE_PERIB147_INTB147,
    DTCE_PERIB148_INTB148,
    DTCE_PERIB149_INTB149,
    DTCE_PERIB150_INTB150,
    DTCE_PERIB151_INTB151,
    DTCE_PERIB152_INTB152,
    DTCE_PERIB153_INTB153,
    DTCE_PERIB154_INTB154,
    DTCE_PERIB155_INTB155,
    DTCE_PERIB156_INTB156,
    DTCE_PERIB157_INTB157,
    DTCE_PERIB158_INTB158,
    DTCE_PERIB159_INTB159,
    DTCE_PERIB160_INTB160,
    DTCE_PERIB161_INTB161,
    DTCE_PERIB162_INTB162,
    DTCE_PERIB163_INTB163,
    DTCE_PERIB164_INTB164,
    DTCE_PERIB165_INTB165,
    DTCE_PERIB166_INTB166,
    DTCE_PERIB167_INTB167,
    DTCE_PERIB168_INTB168,
    DTCE_PERIB169_INTB169,
    DTCE_PERIB170_INTB170,
    DTCE_PERIB171_INTB171,
    DTCE_PERIB172_INTB172,
    DTCE_PERIB173_INTB173,
    DTCE_PERIB174_INTB174,
    DTCE_PERIB175_INTB175,
    DTCE_PERIB176_INTB176,
    DTCE_PERIB177_INTB177,
    DTCE_PERIB178_INTB178,
    DTCE_PERIB179_INTB179,
    DTCE_PERIB180_INTB180,
    DTCE_PERIB181_INTB181,
    DTCE_PERIB182_INTB182,
    DTCE_PERIB183_INTB183,
    DTCE_PERIB184_INTB184,
    DTCE_PERIB185_INTB185,
    DTCE_PERIB186_INTB186,
    DTCE_PERIB187_INTB187,
    DTCE_PERIB188_INTB188,
    DTCE_PERIB189_INTB189,
    DTCE_PERIB190_INTB190,
    DTCE_PERIB191_INTB191,
    DTCE_PERIB192_INTB192,
    DTCE_PERIB193_INTB193,
    DTCE_PERIB194_INTB194,
    DTCE_PERIB195_INTB195,
    DTCE_PERIB196_INTB196,
    DTCE_PERIB197_INTB197,
    DTCE_PERIB198_INTB198,
    DTCE_PERIB199_INTB199,
    DTCE_PERIB200_INTB200,
    DTCE_PERIB201_INTB201,
    DTCE_PERIB202_INTB202,
    DTCE_PERIB203_INTB203,
    DTCE_PERIB204_INTB204,
    DTCE_PERIB205_INTB205,
    DTCE_PERIB206_INTB206,
    DTCE_PERIB207_INTB207,
    DTCE_PERIA208_INTA208,
    DTCE_PERIA209_INTA209,
    DTCE_PERIA210_INTA210,
    DTCE_PERIA211_INTA211,
    DTCE_PERIA212_INTA212,
    DTCE_PERIA213_INTA213,
    DTCE_PERIA214_INTA214,
    DTCE_PERIA215_INTA215,
    DTCE_PERIA216_INTA216,
    DTCE_PERIA217_INTA217,
    DTCE_PERIA218_INTA218,
    DTCE_PERIA219_INTA219,
    DTCE_PERIA220_INTA220,
    DTCE_PERIA221_INTA221,
    DTCE_PERIA222_INTA222,
    DTCE_PERIA223_INTA223,
    DTCE_PERIA224_INTA224,
    DTCE_PERIA225_INTA225,
    DTCE_PERIA226_INTA226,
    DTCE_PERIA227_INTA227,
    DTCE_PERIA228_INTA228,
    DTCE_PERIA229_INTA229,
    DTCE_PERIA230_INTA230,
    DTCE_PERIA231_INTA231,
    DTCE_PERIA232_INTA232,
    DTCE_PERIA233_INTA233,
    DTCE_PERIA234_INTA234,
    DTCE_PERIA235_INTA235,
    DTCE_PERIA236_INTA236,
    DTCE_PERIA237_INTA237,
    DTCE_PERIA238_INTA238,
    DTCE_PERIA239_INTA239,
    DTCE_PERIA240_INTA240,
    DTCE_PERIA241_INTA241,
    DTCE_PERIA242_INTA242,
    DTCE_PERIA243_INTA243,
    DTCE_PERIA244_INTA244,
    DTCE_PERIA245_INTA245,
    DTCE_PERIA246_INTA246,
    DTCE_PERIA247_INTA247,
    DTCE_PERIA248_INTA248,
    DTCE_PERIA249_INTA249,
    DTCE_PERIA250_INTA250,
    DTCE_PERIA251_INTA251,
    DTCE_PERIA252_INTA252,
    DTCE_PERIA253_INTA253,
    DTCE_PERIA254_INTA254,
    DTCE_PERIA255_INTA255
};

enum enum_ier
{
    IER_BSC_BUSERR = 0x02,
    IER_RAM_RAMERR = 0x02,
    IER_FCU_FIFERR = 0x02, IER_FCU_FRDYI = 0x02,
    IER_ICU_SWINT2 = 0x03, IER_ICU_SWINT = 0x03,
    IER_CMT0_CMI0 = 0x03,
    IER_CMT1_CMI1 = 0x03,
    IER_CMTW0_CMWI0 = 0x03,
    IER_CMTW_CMWI1 = 0x03,
    IER_USBHS_D0FIFO2 = 0x04, IER_USBHS_D1FIFO2 = 0x04,
    IER_USB0_D0FIFO0 = 0x04, IER_USB0_D1FIFO0 = 0x04,
    IER_RSPI0_SPRI0 = 0x04, IER_RSPI0_SPTI0 = 0x04,
    IER_QSPI_SPRI = 0x05, IER_QSPI_SPTI = 0x05,
    IER_SDHI_SBFAI = 0x05,
    IER_MMC_MBFAI = 0x05,
    IER_SSI0_SSITXI0 = 0x05, IER_SSI0_SSIRXI0 = 0x05,
    IER_SSI1_SSIRTI1 = 0x06,
    IER_SRC0_IDEI0 = 0x06, IER_SRC0_ODFI0 = 0x06,
    IER_RIIC0_RXI0 = 0x06, IER_RIIC0_TXI0 = 0x06,
    IER_RIIC2_RXI2 = 0x06, IER_RIIC2_TXI2 = 0x06,
    IER_SCI0_RXI0 = 0x07, IER_SCI0_TXI0 = 0x07,
    IER_SCI1_RXI1 = 0x07, IER_SCI1_TXI1 = 0x07,
    IER_SCI2_RXI2 = 0x07, IER_SCI2_TXI2 = 0x07,
    IER_ICU_IRQ0 = 0x08, IER_ICU_IRQ1 = 0x08, IER_ICU_IRQ2 = 0x08, IER_ICU_IRQ3 = 0x08, IER_ICU_IRQ4 = 0x08, IER_ICU_IRQ5 = 0x08, IER_ICU_IRQ6 = 0x08, IER_ICU_IRQ7 = 0x08, IER_ICU_IRQ8 = 0x09, IER_ICU_IRQ9 = 0x09, IER_ICU_IRQ10 = 0x09, IER_ICU_IRQ11 = 0x09, IER_ICU_IRQ12 = 0x09, IER_ICU_IRQ13 = 0x09, IER_ICU_IRQ14 = 0x09, IER_ICU_IRQ15 = 0x09,
    IER_SCI3_RXI3 = 0x0A, IER_SCI3_TXI3 = 0x0A,
    IER_SCI4_RXI4 = 0x0A, IER_SCI4_TXI4 = 0x0A,
    IER_SCI5_RXI5 = 0x0A, IER_SCI5_TXI5 = 0x0A,
    IER_SCI6_RXI6 = 0x0A, IER_SCI6_TXI6 = 0x0A,
    IER_LVD1_COMPA1 = 0x0B,
    IER_LVD2_COMPA2 = 0x0B,
    IER_USB0_USBR0 = 0x0B,
    IER_RTC_ALARM = 0x0B, IER_RTC_PRD = 0x0B,
    IER_USBHS_HSUSBR = 0x0B,
    IER_IWDT_IWUNI = 0x0B,
    IER_WDT_WUNI = 0x0C,
    IER_PDC_PCDFI = 0x0C,
    IER_SCI7_RXI7 = 0x0C, IER_SCI7_TXI7 = 0x0C,
    IER_SCIF8_RXIF8 = 0x0C, IER_SCIF8_TXIF8 = 0x0C,
    IER_SCIF9_RXIF9 = 0x0C, IER_SCIF9_TXIF9 = 0x0C,
    IER_SCIF10_RXIF10 = 0x0D, IER_SCIF10_TXIF10 = 0x0D,
    IER_ICU_GROUPBE0 = 0x0D, IER_ICU_GROUPBE1 = 0x0D, IER_ICU_GROUPAE0 = 0x0D, IER_ICU_GROUPAE1 = 0x0D, IER_ICU_GROUPBL0 = 0x0D, IER_ICU_GROUPBL1 = 0x0D, IER_ICU_GROUPAL0 = 0x0E, IER_ICU_GROUPAL1 = 0x0E,
    IER_SCIF11_RXIF11 = 0x0E, IER_SCIF11_TXIF11 = 0x0E,
    IER_SCI12_RXI12 = 0x0E, IER_SCI12_TXI12 = 0x0E,
    IER_DMAC_DMAC0I = 0x0F, IER_DMAC_DMAC1I = 0x0F, IER_DMAC_DMAC2I = 0x0F, IER_DMAC_DMAC3I = 0x0F, IER_DMAC_DMAC74I = 0x0F,
    IER_ICU_OST = 0x0F,
    IER_EXDMAC_EXDMAC0I = 0x0F, IER_EXDMAC_EXDMAC1I = 0x0F,
    IER_PERIB128_INTB128 = 0x10,
    IER_PERIB129_INTB129 = 0x10,
    IER_PERIB130_INTB130 = 0x10,
    IER_PERIB131_INTB131 = 0x10,
    IER_PERIB132_INTB132 = 0x10,
    IER_PERIB133_INTB133 = 0x10,
    IER_PERIB134_INTB134 = 0x10,
    IER_PERIB135_INTB135 = 0x10,
    IER_PERIB136_INTB136 = 0x11,
    IER_PERIB137_INTB137 = 0x11,
    IER_PERIB138_INTB138 = 0x11,
    IER_PERIB139_INTB139 = 0x11,
    IER_PERIB140_INTB140 = 0x11,
    IER_PERIB141_INTB141 = 0x11,
    IER_PERIB142_INTB142 = 0x11,
    IER_PERIB143_INTB143 = 0x11,
    IER_PERIB144_INTB144 = 0x12,
    IER_PERIB145_INTB145 = 0x12,
    IER_PERIB146_INTB146 = 0x12,
    IER_PERIB147_INTB147 = 0x12,
    IER_PERIB148_INTB148 = 0x12,
    IER_PERIB149_INTB149 = 0x12,
    IER_PERIB150_INTB150 = 0x12,
    IER_PERIB151_INTB151 = 0x12,
    IER_PERIB152_INTB152 = 0x13,
    IER_PERIB153_INTB153 = 0x13,
    IER_PERIB154_INTB154 = 0x13,
    IER_PERIB155_INTB155 = 0x13,
    IER_PERIB156_INTB156 = 0x13,
    IER_PERIB157_INTB157 = 0x13,
    IER_PERIB158_INTB158 = 0x13,
    IER_PERIB159_INTB159 = 0x13,
    IER_PERIB160_INTB160 = 0x14,
    IER_PERIB161_INTB161 = 0x14,
    IER_PERIB162_INTB162 = 0x14,
    IER_PERIB163_INTB163 = 0x14,
    IER_PERIB164_INTB164 = 0x14,
    IER_PERIB165_INTB165 = 0x14,
    IER_PERIB166_INTB166 = 0x14,
    IER_PERIB167_INTB167 = 0x14,
    IER_PERIB168_INTB168 = 0x15,
    IER_PERIB169_INTB169 = 0x15,
    IER_PERIB170_INTB170 = 0x15,
    IER_PERIB171_INTB171 = 0x15,
    IER_PERIB172_INTB172 = 0x15,
    IER_PERIB173_INTB173 = 0x15,
    IER_PERIB174_INTB174 = 0x15,
    IER_PERIB175_INTB175 = 0x15,
    IER_PERIB176_INTB176 = 0x16,
    IER_PERIB177_INTB177 = 0x16,
    IER_PERIB178_INTB178 = 0x16,
    IER_PERIB179_INTB179 = 0x16,
    IER_PERIB180_INTB180 = 0x16,
    IER_PERIB181_INTB181 = 0x16,
    IER_PERIB182_INTB182 = 0x16,
    IER_PERIB183_INTB183 = 0x16,
    IER_PERIB184_INTB184 = 0x17,
    IER_PERIB185_INTB185 = 0x17,
    IER_PERIB186_INTB186 = 0x17,
    IER_PERIB187_INTB187 = 0x17,
    IER_PERIB188_INTB188 = 0x17,
    IER_PERIB189_INTB189 = 0x17,
    IER_PERIB190_INTB190 = 0x17,
    IER_PERIB191_INTB191 = 0x17,
    IER_PERIB192_INTB192 = 0x18,
    IER_PERIB193_INTB193 = 0x18,
    IER_PERIB194_INTB194 = 0x18,
    IER_PERIB195_INTB195 = 0x18,
    IER_PERIB196_INTB196 = 0x18,
    IER_PERIB197_INTB197 = 0x18,
    IER_PERIB198_INTB198 = 0x18,
    IER_PERIB199_INTB199 = 0x18,
    IER_PERIB200_INTB200 = 0x19,
    IER_PERIB201_INTB201 = 0x19,
    IER_PERIB202_INTB202 = 0x19,
    IER_PERIB203_INTB203 = 0x19,
    IER_PERIB204_INTB204 = 0x19,
    IER_PERIB205_INTB205 = 0x19,
    IER_PERIB206_INTB206 = 0x19,
    IER_PERIB207_INTB207 = 0x19,
    IER_PERIA208_INTA208 = 0x1A,
    IER_PERIA209_INTA209 = 0x1A,
    IER_PERIA210_INTA210 = 0x1A,
    IER_PERIA211_INTA211 = 0x1A,
    IER_PERIA212_INTA212 = 0x1A,
    IER_PERIA213_INTA213 = 0x1A,
    IER_PERIA214_INTA214 = 0x1A,
    IER_PERIA215_INTA215 = 0x1A,
    IER_PERIA216_INTA216 = 0x1B,
    IER_PERIA217_INTA217 = 0x1B,
    IER_PERIA218_INTA218 = 0x1B,
    IER_PERIA219_INTA219 = 0x1B,
    IER_PERIA220_INTA220 = 0x1B,
    IER_PERIA221_INTA221 = 0x1B,
    IER_PERIA222_INTA222 = 0x1B,
    IER_PERIA223_INTA223 = 0x1B,
    IER_PERIA224_INTA224 = 0x1C,
    IER_PERIA225_INTA225 = 0x1C,
    IER_PERIA226_INTA226 = 0x1C,
    IER_PERIA227_INTA227 = 0x1C,
    IER_PERIA228_INTA228 = 0x1C,
    IER_PERIA229_INTA229 = 0x1C,
    IER_PERIA230_INTA230 = 0x1C,
    IER_PERIA231_INTA231 = 0x1C,
    IER_PERIA232_INTA232 = 0x1D,
    IER_PERIA233_INTA233 = 0x1D,
    IER_PERIA234_INTA234 = 0x1D,
    IER_PERIA235_INTA235 = 0x1D,
    IER_PERIA236_INTA236 = 0x1D,
    IER_PERIA237_INTA237 = 0x1D,
    IER_PERIA238_INTA238 = 0x1D,
    IER_PERIA239_INTA239 = 0x1D,
    IER_PERIA240_INTA240 = 0x1E,
    IER_PERIA241_INTA241 = 0x1E,
    IER_PERIA242_INTA242 = 0x1E,
    IER_PERIA243_INTA243 = 0x1E,
    IER_PERIA244_INTA244 = 0x1E,
    IER_PERIA245_INTA245 = 0x1E,
    IER_PERIA246_INTA246 = 0x1E,
    IER_PERIA247_INTA247 = 0x1E,
    IER_PERIA248_INTA248 = 0x1F,
    IER_PERIA249_INTA249 = 0x1F,
    IER_PERIA250_INTA250 = 0x1F,
    IER_PERIA251_INTA251 = 0x1F,
    IER_PERIA252_INTA252 = 0x1F,
    IER_PERIA253_INTA253 = 0x1F,
    IER_PERIA254_INTA254 = 0x1F,
    IER_PERIA255_INTA255 = 0x1F
};

enum enum_ipr
{
    IPR_BSC_BUSERR = 0,
    IPR_RAM_RAMERR = 0,
    IPR_FCU_FIFERR = 1, IPR_FCU_FRDYI = 2,
    IPR_ICU_SWINT2 = 3, IPR_ICU_SWINT = 3,
    IPR_CMT0_CMI0 = 4,
    IPR_CMT1_CMI1 = 5,
    IPR_CMTW0_CMWI0 = 6,
    IPR_CMTW_CMWI1 = 7,
    IPR_USBHS_D0FIFO2 = 32, IPR_USBHS_D1FIFO2 = 33,
    IPR_USB0_D0FIFO0 = 34, IPR_USB0_D1FIFO0 = 35,
    IPR_RSPI0_SPRI0 = 38, IPR_RSPI0_SPTI0 = 39,
    IPR_QSPI_SPRI = 42, IPR_QSPI_SPTI = 43,
    IPR_SDHI_SBFAI = 44,
    IPR_MMC_MBFAI = 45,
    IPR_SSI0_SSITXI0 = 46, IPR_SSI0_SSIRXI0 = 47,
    IPR_SSI1_SSIRTI1 = 48,
    IPR_SRC0_IDEI0 = 50, IPR_SRC0_ODFI0 = 51,
    IPR_RIIC0_RXI0 = 52, IPR_RIIC0_TXI0 = 53,
    IPR_RIIC2_RXI2 = 54, IPR_RIIC2_TXI2 = 55,
    IPR_SCI0_RXI0 = 58, IPR_SCI0_TXI0 = 59,
    IPR_SCI1_RXI1 = 60, IPR_SCI1_TXI1 = 61,
    IPR_SCI2_RXI2 = 62, IPR_SCI2_TXI2 = 63,
    IPR_ICU_IRQ0 = 64, IPR_ICU_IRQ1 = 65, IPR_ICU_IRQ2 = 66, IPR_ICU_IRQ3 = 67, IPR_ICU_IRQ4 = 68, IPR_ICU_IRQ5 = 69, IPR_ICU_IRQ6 = 70, IPR_ICU_IRQ7 = 71, IPR_ICU_IRQ8 = 72, IPR_ICU_IRQ9 = 73, IPR_ICU_IRQ10 = 74, IPR_ICU_IRQ11 = 75, IPR_ICU_IRQ12 = 76, IPR_ICU_IRQ13 = 77, IPR_ICU_IRQ14 = 78, IPR_ICU_IRQ15 = 79,
    IPR_SCI3_RXI3 = 80, IPR_SCI3_TXI3 = 81,
    IPR_SCI4_RXI4 = 82, IPR_SCI4_TXI4 = 83,
    IPR_SCI5_RXI5 = 84, IPR_SCI5_TXI5 = 85,
    IPR_SCI6_RXI6 = 86, IPR_SCI6_TXI6 = 87,
    IPR_LVD1_COMPA1 = 88,
    IPR_LVD2_COMPA2 = 89,
    IPR_USB0_USBR0 = 90,
    IPR_RTC_ALARM = 92, IPR_RTC_PRD = 93,
    IPR_USBHS_HSUSBR = 94,
    IPR_IWDT_IWUNI = 95,
    IPR_WDT_WUNI = 96,
    IPR_PDC_PCDFI = 97,
    IPR_SCI7_RXI7 = 98, IPR_SCI7_TXI7 = 99,
    IPR_SCIF8_RXIF8 = 100, IPR_SCIF8_TXIF8 = 101,
    IPR_SCIF9_RXIF9 = 102, IPR_SCIF9_TXIF9 = 103,
    IPR_SCIF10_RXIF10 = 104, IPR_SCIF10_TXIF10 = 105,
    IPR_ICU_GROUPBE0 = 106, IPR_ICU_GROUPBE1 = 107, IPR_ICU_GROUPAE0 = 108, IPR_ICU_GROUPAE1 = 109, IPR_ICU_GROUPBL0 = 110, IPR_ICU_GROUPBL1 = 111, IPR_ICU_GROUPAL0 = 112, IPR_ICU_GROUPAL1 = 113,
    IPR_SCIF11_RXIF11 = 114, IPR_SCIF11_TXIF11 = 115,
    IPR_SCI12_RXI12 = 116, IPR_SCI12_TXI12 = 117,
    IPR_DMAC_DMAC0I = 120, IPR_DMAC_DMAC1I = 121, IPR_DMAC_DMAC2I = 122, IPR_DMAC_DMAC3I = 123, IPR_DMAC_DMAC74I = 124,
    IPR_ICU_OST = 125,
    IPR_EXDMAC_EXDMAC0I = 126, IPR_EXDMAC_EXDMAC1I = 127,
    IPR_PERIB128_INTB128 = 128,
    IPR_PERIB129_INTB129 = 129,
    IPR_PERIB130_INTB130 = 130,
    IPR_PERIB131_INTB131 = 131,
    IPR_PERIB132_INTB132 = 132,
    IPR_PERIB133_INTB133 = 133,
    IPR_PERIB134_INTB134 = 134,
    IPR_PERIB135_INTB135 = 135,
    IPR_PERIB136_INTB136 = 136,
    IPR_PERIB137_INTB137 = 137,
    IPR_PERIB138_INTB138 = 138,
    IPR_PERIB139_INTB139 = 139,
    IPR_PERIB140_INTB140 = 140,
    IPR_PERIB141_INTB141 = 141,
    IPR_PERIB142_INTB142 = 142,
    IPR_PERIB143_INTB143 = 143,
    IPR_PERIB144_INTB144 = 144,
    IPR_PERIB145_INTB145 = 145,
    IPR_PERIB146_INTB146 = 146,
    IPR_PERIB147_INTB147 = 147,
    IPR_PERIB148_INTB148 = 148,
    IPR_PERIB149_INTB149 = 149,
    IPR_PERIB150_INTB150 = 150,
    IPR_PERIB151_INTB151 = 151,
    IPR_PERIB152_INTB152 = 152,
    IPR_PERIB153_INTB153 = 153,
    IPR_PERIB154_INTB154 = 154,
    IPR_PERIB155_INTB155 = 155,
    IPR_PERIB156_INTB156 = 156,
    IPR_PERIB157_INTB157 = 157,
    IPR_PERIB158_INTB158 = 158,
    IPR_PERIB159_INTB159 = 159,
    IPR_PERIB160_INTB160 = 160,
    IPR_PERIB161_INTB161 = 161,
    IPR_PERIB162_INTB162 = 162,
    IPR_PERIB163_INTB163 = 163,
    IPR_PERIB164_INTB164 = 164,
    IPR_PERIB165_INTB165 = 165,
    IPR_PERIB166_INTB166 = 166,
    IPR_PERIB167_INTB167 = 167,
    IPR_PERIB168_INTB168 = 168,
    IPR_PERIB169_INTB169 = 169,
    IPR_PERIB170_INTB170 = 170,
    IPR_PERIB171_INTB171 = 171,
    IPR_PERIB172_INTB172 = 172,
    IPR_PERIB173_INTB173 = 173,
    IPR_PERIB174_INTB174 = 174,
    IPR_PERIB175_INTB175 = 175,
    IPR_PERIB176_INTB176 = 176,
    IPR_PERIB177_INTB177 = 177,
    IPR_PERIB178_INTB178 = 178,
    IPR_PERIB179_INTB179 = 179,
    IPR_PERIB180_INTB180 = 180,
    IPR_PERIB181_INTB181 = 181,
    IPR_PERIB182_INTB182 = 182,
    IPR_PERIB183_INTB183 = 183,
    IPR_PERIB184_INTB184 = 184,
    IPR_PERIB185_INTB185 = 185,
    IPR_PERIB186_INTB186 = 186,
    IPR_PERIB187_INTB187 = 187,
    IPR_PERIB188_INTB188 = 188,
    IPR_PERIB189_INTB189 = 189,
    IPR_PERIB190_INTB190 = 190,
    IPR_PERIB191_INTB191 = 191,
    IPR_PERIB192_INTB192 = 192,
    IPR_PERIB193_INTB193 = 193,
    IPR_PERIB194_INTB194 = 194,
    IPR_PERIB195_INTB195 = 195,
    IPR_PERIB196_INTB196 = 196,
    IPR_PERIB197_INTB197 = 197,
    IPR_PERIB198_INTB198 = 198,
    IPR_PERIB199_INTB199 = 199,
    IPR_PERIB200_INTB200 = 200,
    IPR_PERIB201_INTB201 = 201,
    IPR_PERIB202_INTB202 = 202,
    IPR_PERIB203_INTB203 = 203,
    IPR_PERIB204_INTB204 = 204,
    IPR_PERIB205_INTB205 = 205,
    IPR_PERIB206_INTB206 = 206,
    IPR_PERIB207_INTB207 = 207,
    IPR_PERIA208_INTA208 = 208,
    IPR_PERIA209_INTA209 = 209,
    IPR_PERIA210_INTA210 = 210,
    IPR_PERIA211_INTA211 = 211,
    IPR_PERIA212_INTA212 = 212,
    IPR_PERIA213_INTA213 = 213,
    IPR_PERIA214_INTA214 = 214,
    IPR_PERIA215_INTA215 = 215,
    IPR_PERIA216_INTA216 = 216,
    IPR_PERIA217_INTA217 = 217,
    IPR_PERIA218_INTA218 = 218,
    IPR_PERIA219_INTA219 = 219,
    IPR_PERIA220_INTA220 = 220,
    IPR_PERIA221_INTA221 = 221,
    IPR_PERIA222_INTA222 = 222,
    IPR_PERIA223_INTA223 = 223,
    IPR_PERIA224_INTA224 = 224,
    IPR_PERIA225_INTA225 = 225,
    IPR_PERIA226_INTA226 = 226,
    IPR_PERIA227_INTA227 = 227,
    IPR_PERIA228_INTA228 = 228,
    IPR_PERIA229_INTA229 = 229,
    IPR_PERIA230_INTA230 = 230,
    IPR_PERIA231_INTA231 = 231,
    IPR_PERIA232_INTA232 = 232,
    IPR_PERIA233_INTA233 = 233,
    IPR_PERIA234_INTA234 = 234,
    IPR_PERIA235_INTA235 = 235,
    IPR_PERIA236_INTA236 = 236,
    IPR_PERIA237_INTA237 = 237,
    IPR_PERIA238_INTA238 = 238,
    IPR_PERIA239_INTA239 = 239,
    IPR_PERIA240_INTA240 = 240,
    IPR_PERIA241_INTA241 = 241,
    IPR_PERIA242_INTA242 = 242,
    IPR_PERIA243_INTA243 = 243,
    IPR_PERIA244_INTA244 = 244,
    IPR_PERIA245_INTA245 = 245,
    IPR_PERIA246_INTA246 = 246,
    IPR_PERIA247_INTA247 = 247,
    IPR_PERIA248_INTA248 = 248,
    IPR_PERIA249_INTA249 = 249,
    IPR_PERIA250_INTA250 = 250,
    IPR_PERIA251_INTA251 = 251,
    IPR_PERIA252_INTA252 = 252,
    IPR_PERIA253_INTA253 = 253,
    IPR_PERIA254_INTA254 = 254,
    IPR_PERIA255_INTA255 = 255
};

