FreeRTOS/FreeRTOS/FreeRTOS/Demo/RX600_RX64M_RSK_GCC_e2studio/src/RenesasCode/iodefine.h
#define    __IR( x )         ICU.IR[ IR ## x ].BIT.IR
#define     _IR( x )         __IR( x )
#define      IR( x, y )      _IR( _ ## x ## _ ## y )
#define    __DTCE( x )       ICU.DTCER[ DTCE ## x ].BIT.DTCE
#define     _DTCE( x )       __DTCE( x )
#define      DTCE( x, y )    _DTCE( _ ## x ## _ ## y )
#define    __IEN( x )        ICU.IER[ IER ## x ].BIT.IEN ## x
#define     _IEN( x )        __IEN( x )
#define      IEN( x, y )     _IEN( _ ## x ## _ ## y )
#define    __IPR( x )        ICU.IPR[ IPR ## x ].BIT.IPR
#define     _IPR( x )        __IPR( x )
#define      IPR( x, y )     _IPR( _ ## x ## _ ## y )
#define    __VECT( x )       VECT ## x
#define     _VECT( x )       __VECT( x )
#define      VECT( x, y )    _VECT( _ ## x ## _ ## y )
#define    __MSTP( x )       MSTP ## x
#define     _MSTP( x )       __MSTP( x )
#define      MSTP( x )       _MSTP( _ ## x )

#define    BSC        ( *( volatile struct st_bsc * ) 0x81300 )
#define    CAC        ( *( volatile struct st_cac * ) 0x8B000 )
#define    CAN0       ( *( volatile struct st_can * ) 0x90200 )
#define    CAN1       ( *( volatile struct st_can * ) 0x91200 )
#define    CAN2       ( *( volatile struct st_can * ) 0x92200 )
#define    CMT        ( *( volatile struct st_cmt * ) 0x88000 )
#define    CMT0       ( *( volatile struct st_cmt0 * ) 0x88002 )
#define    CMT1       ( *( volatile struct st_cmt0 * ) 0x88008 )
#define    CMT2       ( *( volatile struct st_cmt0 * ) 0x88012 )
#define    CMT3       ( *( volatile struct st_cmt0 * ) 0x88018 )
#define    CMTW0      ( *( volatile struct st_cmtw * ) 0x94200 )
#define    CMTW1      ( *( volatile struct st_cmtw * ) 0x94280 )
#define    CRC        ( *( volatile struct st_crc * ) 0x88280 )
#define    DA         ( *( volatile struct st_da * ) 0x88040 )
#define    DMAC       ( *( volatile struct st_dmac * ) 0x82200 )
#define    DMAC0      ( *( volatile struct st_dmac0 * ) 0x82000 )
#define    DMAC1      ( *( volatile struct st_dmac1 * ) 0x82040 )
#define    DMAC2      ( *( volatile struct st_dmac1 * ) 0x82080 )
#define    DMAC3      ( *( volatile struct st_dmac1 * ) 0x820C0 )
#define    DMAC4      ( *( volatile struct st_dmac1 * ) 0x82100 )
#define    DMAC5      ( *( volatile struct st_dmac1 * ) 0x82140 )
#define    DMAC6      ( *( volatile struct st_dmac1 * ) 0x82180 )
#define    DMAC7      ( *( volatile struct st_dmac1 * ) 0x821C0 )
#define    DOC        ( *( volatile struct st_doc * ) 0x8B080 )
#define    DTC        ( *( volatile struct st_dtc * ) 0x82400 )
#define    ECCRAM     ( *( volatile struct st_eccram * ) 0x812C0 )
#define    EDMAC0     ( *( volatile struct st_edmac * ) 0xC0000 )
#define    EDMAC1     ( *( volatile struct st_edmac * ) 0xC0200 )
#define    EDMACP     ( *( volatile struct st_edmacp * ) 0xC0400 )
#define    ELC        ( *( volatile struct st_elc * ) 0x8B100 )
#define    EPTPC      ( *( volatile struct st_eptpc * ) 0xC0500 )
#define    EPTPCS0    ( *( volatile struct st_eptpcs * ) 0xC4800 )
#define    EPTPCS1    ( *( volatile struct st_eptpcs * ) 0xC4C00 )
#define    ETHERC0    ( *( volatile struct st_etherc * ) 0xC0100 )
#define    ETHERC1    ( *( volatile struct st_etherc * ) 0xC0300 )
#define    EXDMAC     ( *( volatile struct st_exdmac * ) 0x82A00 )
#define    EXDMAC0    ( *( volatile struct st_exdmac0 * ) 0x82800 )
#define    EXDMAC1    ( *( volatile struct st_exdmac1 * ) 0x82840 )
#define    GPT        ( *( volatile struct st_gpt * ) 0xC2000 )
#define    GPT0       ( *( volatile struct st_gpt0 * ) 0xC2100 )
#define    GPT1       ( *( volatile struct st_gpt0 * ) 0xC2180 )
#define    GPT2       ( *( volatile struct st_gpt0 * ) 0xC2200 )
#define    GPT3       ( *( volatile struct st_gpt0 * ) 0xC2280 )
#define    ICU        ( *( volatile struct st_icu * ) 0x87000 )
#define    IWDT       ( *( volatile struct st_iwdt * ) 0x88030 )
#define    MMC        ( *( volatile struct st_mmc * ) 0x88500 )
#define    MPC        ( *( volatile struct st_mpc * ) 0x8C100 )
#define    MPU        ( *( volatile struct st_mpu * ) 0x86400 )
#define    MTU        ( *( volatile struct st_mtu * ) 0xC120A )
#define    MTU0       ( *( volatile struct st_mtu0 * ) 0xC1290 )
#define    MTU1       ( *( volatile struct st_mtu1 * ) 0xC1290 )
#define    MTU2       ( *( volatile struct st_mtu2 * ) 0xC1292 )
#define    MTU3       ( *( volatile struct st_mtu3 * ) 0xC1200 )
#define    MTU4       ( *( volatile struct st_mtu4 * ) 0xC1200 )
#define    MTU5       ( *( volatile struct st_mtu5 * ) 0xC1294 )
#define    MTU6       ( *( volatile struct st_mtu6 * ) 0xC12A2 )
#define    MTU7       ( *( volatile struct st_mtu7 * ) 0xC12A4 )
#define    MTU8       ( *( volatile struct st_mtu8 * ) 0xC1298 )
#define    PDC        ( *( volatile struct st_pdc * ) 0xA0500 )
#define    POE3       ( *( volatile struct st_poe * ) 0x8C4C0 )
#define    PORT0      ( *( volatile struct st_port0 * ) 0x8C000 )
#define    PORT1      ( *( volatile struct st_port1 * ) 0x8C001 )
#define    PORT2      ( *( volatile struct st_port2 * ) 0x8C002 )
#define    PORT3      ( *( volatile struct st_port3 * ) 0x8C003 )
#define    PORT4      ( *( volatile struct st_port4 * ) 0x8C004 )
#define    PORT5      ( *( volatile struct st_port5 * ) 0x8C005 )
#define    PORT6      ( *( volatile struct st_port6 * ) 0x8C006 )
#define    PORT7      ( *( volatile struct st_port7 * ) 0x8C007 )
#define    PORT8      ( *( volatile struct st_port8 * ) 0x8C008 )
#define    PORT9      ( *( volatile struct st_port9 * ) 0x8C009 )
#define    PORTA      ( *( volatile struct st_porta * ) 0x8C00A )
#define    PORTB      ( *( volatile struct st_portb * ) 0x8C00B )
#define    PORTC      ( *( volatile struct st_portc * ) 0x8C00C )
#define    PORTD      ( *( volatile struct st_portd * ) 0x8C00D )
#define    PORTE      ( *( volatile struct st_porte * ) 0x8C00E )
#define    PORTF      ( *( volatile struct st_portf * ) 0x8C00F )
#define    PORTG      ( *( volatile struct st_portg * ) 0x8C010 )
#define    PORTJ      ( *( volatile struct st_portj * ) 0x8C012 )
#define    PPG0       ( *( volatile struct st_ppg0 * ) 0x881E6 )
#define    PPG1       ( *( volatile struct st_ppg1 * ) 0x881F0 )
#define    QSPI       ( *( volatile struct st_qspi * ) 0x89E00 )
#define    RIIC0      ( *( volatile struct st_riic0 * ) 0x88300 )
#define    RIIC2      ( *( volatile struct st_riic2 * ) 0x88340 )
#define    RSPI0      ( *( volatile struct st_rspi0 * ) 0xD0100 )
#define    RTC        ( *( volatile struct st_rtc * ) 0x8C400 )
#define    RTCB       ( *( volatile struct st_rtcb * ) 0x8C402 )
#define    S12AD      ( *( volatile struct st_s12ad * ) 0x89000 )
#define    S12AD1     ( *( volatile struct st_s12ad1 * ) 0x89104 )
#define    SCI0       ( *( volatile struct st_sci0 * ) 0x8A000 )
#define    SCI1       ( *( volatile struct st_sci0 * ) 0x8A020 )
#define    SCI2       ( *( volatile struct st_sci0 * ) 0x8A040 )
#define    SCI3       ( *( volatile struct st_sci0 * ) 0x8A060 )
#define    SCI4       ( *( volatile struct st_sci0 * ) 0x8A080 )
#define    SCI5       ( *( volatile struct st_sci0 * ) 0x8A0A0 )
#define    SCI6       ( *( volatile struct st_sci0 * ) 0x8A0C0 )
#define    SCI7       ( *( volatile struct st_sci0 * ) 0x8A0E0 )
#define    SCI12      ( *( volatile struct st_sci12 * ) 0x8B300 )
/*#define    SCIA    (*(volatile struct st_scia    *)0x88484) */
/*#define    SCIF10A    (*(volatile struct st_scia    *)0xD0042) */
/*#define    SCIF11A    (*(volatile struct st_scia    *)0xD0062) */
#define    SCIF8     ( *( volatile struct st_scif * ) 0xD0000 )
#define    SCIF9     ( *( volatile struct st_scif * ) 0xD0020 )
#define    SCIF10    ( *( volatile struct st_scif * ) 0xD0040 )
#define    SCIF11    ( *( volatile struct st_scif * ) 0xD0060 )
/*#define    SCIF8A    (*(volatile struct st_scia    *)0xD0002) */
/*#define    SCIF9A    (*(volatile struct st_scia    *)0xD0022) */
#define    SMCI      ( *( volatile struct st_smci * ) 0x88480 )
#define    SMCI0     ( *( volatile struct st_smci0 * ) 0x8A000 )
#define    SMCI1     ( *( volatile struct st_smci0 * ) 0x8A020 )
#define    SMCI2     ( *( volatile struct st_smci0 * ) 0x8A040 )
#define    SMCI3     ( *( volatile struct st_smci0 * ) 0x8A060 )
#define    SMCI4     ( *( volatile struct st_smci0 * ) 0x8A080 )
#define    SMCI5     ( *( volatile struct st_smci0 * ) 0x8A0A0 )
#define    SMCI6     ( *( volatile struct st_smci0 * ) 0x8A0C0 )
#define    SMCI7     ( *( volatile struct st_smci0 * ) 0x8A0E0 )
#define    SMCI12    ( *( volatile struct st_smci0 * ) 0x8B300 )
/*#define    SMCIA    (*(volatile struct st_scia    *)0x88484) */
#define    SRC       ( *( volatile struct st_src * ) 0x98000 )
#define    SSI0      ( *( volatile struct st_ssi * ) 0x8A500 )
#define    SSI1      ( *( volatile struct st_ssi * ) 0x8A540 )
#define    SYSTEM    ( *( volatile struct st_system * ) 0x80000 )
#define    TEMPS     ( *( volatile struct st_temps * ) 0x8C500 )
#define    TMR0      ( *( volatile struct st_tmr0 * ) 0x88200 )
#define    TMR1      ( *( volatile struct st_tmr1 * ) 0x88201 )
#define    TMR2      ( *( volatile struct st_tmr0 * ) 0x88210 )
#define    TMR3      ( *( volatile struct st_tmr1 * ) 0x88211 )
#define    TMR01     ( *( volatile struct st_tmr01 * ) 0x88204 )
#define    TMR23     ( *( volatile struct st_tmr01 * ) 0x88214 )
#define    TPU0      ( *( volatile struct st_tpu0 * ) 0x88108 )
#define    TPU1      ( *( volatile struct st_tpu1 * ) 0x88108 )
#define    TPU2      ( *( volatile struct st_tpu2 * ) 0x8810A )
#define    TPU3      ( *( volatile struct st_tpu3 * ) 0x8810A )
#define    TPU4      ( *( volatile struct st_tpu4 * ) 0x8810C )
#define    TPU5      ( *( volatile struct st_tpu5 * ) 0x8810C )
#define    TPUA      ( *( volatile struct st_tpua * ) 0x88100 )
#define    USB       ( *( volatile struct st_usb * ) 0xA0400 )
#define    USB0      ( *( volatile struct st_usb0 * ) 0xA0000 )
#define    USBHS     ( *( volatile struct st_usbhs * ) 0xD0400 )
#define    WDT       ( *( volatile struct st_wdt * ) 0x88020 )
#endif /* ifndef __RX64MIODEFINE_HEADER__ */
